var store = [{
"title": "2010年自由软件日（合肥站）",
"excerpt":"2010年9月18日在中国科大西区3112教室，中国科学技术大学 Linux User Group(USTC@LUG) 组织了以“人人为我，我为人人”为主题的自由软件日活动，本次活动得到了龙芯梦兰、龙芯俱乐部、中标软件、中科红旗、中国开源软件推进联盟等公司、开源社区，以及合肥工业大学，安徽大学等兄弟院校的大力支持。100多名中国科大、安徽大学、合肥工业大学等高校的在校学生及校友以及合肥地区开源爱好者参加了本次活动。      活动由 LUG 协会现任会长王鹏主持，他首先对自由软件日合肥站的活动流程以及科大 LUG、合肥 LUG 的情况做了具体介绍。在 UBUNTU 创始人给中国开源爱好者的视频播放中，2010 年自由软件日合肥站的活动正式开幕了。      科大网络中心的张焕杰老师首先为大家带来了《Linux在科大校园网络建设中的应用》的专题报告。张焕杰老师是科大92级计算系学生，后来留校在网络信息中心任职，主要工作之一是负责管理科大校园网，他也是国内当年有名的中科大 Linux 三剑客之一。张老师精彩的报告之后开始了休息以及游戏互动环节，在回答了组织方准备的关于自由软件和 Linux 的小问题后，同学们领取了丰厚的奖品。在这中间还穿插了中科红旗 Qomo1.0 社区版发布，中标软件体验有奖征文活动启示等环节，活动中气氛热烈。   休息之后是我们的自由主题演讲活动，一些同学做了开源软件使用相关的技术分享报告，同学们就一些常见问题进行了互动交流。   主题演讲活动之后，进行了现场短信投票，赵希明同学题为《Linux下的日常工作和娱乐》的报告当选为当天最受欢迎的自由主题演讲。之后进行了抽奖环节，若干名参与者成为了当天的幸运观众，并获得了收音机，小玩具等奖品。活动从下午 2:30 一直持续到下午 6:00. 会后举行了 Linux User Dinner(LUD), 在 LUD 中，LUG 的志愿者们就我校 PXE 系统今后的发展，以及结合我校网络环境将要开发的项目进行了讨论与规划。                       ","categories": ["LUG活动"],
"tags": ["USTC_LUG","SFD"],
"url": "https://lug.ustc.edu.cn//news/2010/09/2010-software-freedom-day/",
"teaser": null
},{
"title": "2010年LUG服务器维护计划研讨会",
"excerpt":"2010年10月15日晚上，LUG在科大西区图书馆组织了服务器维护小组第一次例会，会议由LUG协会现任副会长张成同学主持，集中讨论了发展现有网络服务的计划。20余位LUG志愿者参加了本次会议。      张成首先介绍了现在学校linux 用户协会服务器现状，包括debian,oss,pxe,freeshell,lug.ustc等服务器的配置、历史介绍等。然后张成详细介绍了本学期服务器维护小组的工作计划，包括oss/debian系统和服务的更新以及pxe服务的改造构想。      活动计划介绍完之后，大家讨论了活动计划的具体开展方案，各位志愿者根据自己的兴趣爱好、以及服务器维护工作量大小等因素选择加入各个服务器的维护小组。各小组由现在的维护者担任组长，负责组织培训，活动通知等工作。 最后，张成同学做了pxe网络服务的专题讲座。pxe维护小组的同学以及其他感兴趣的同学认真听取了本次讲座。      本次活动从19:00持续到22:30，会议中大家进行了热烈讨论，积极要求参与到服务器的各项维护工作中，为本学年服务器维护工作的开展打下了一个良好的开端。会后部分志愿者还到活动室对将来需要用到的测试服务器等进行了实地考察。  ","categories": ["LUG会议"],
"tags": ["PXE","LUG","Meeting"],
"url": "https://lug.ustc.edu.cn//news/2010/10/2010-lug-server-dev-meeting/",
"teaser": null
},{
"title": "2010年4月 Linux Install Party",
"excerpt":"   Linux Install Party是中国科学技术大学Linux用户协会一年一度举办的活动，主旨在于推广和安装Linux，宣传和鼓励开源和自由软件精神。本次Linux Install Party主题是“草根低碳”。“草根”反映Linux目前已经逐渐平民化的特征，人们往往以为Linux是一个很高深的东西，这次party就是要把Linux带到同学们的身边。“低碳”反映了Linux创新的安装方式，以往安装Linux需要刻录光盘，费时费力不环保，这次party将宣传USB安装和网络安装的方法。本次活动可以让同学们亲身“无痛”体验到Linux，同时获得Linux的相关知识，并在安装Linux环节有专人指导。   由于活动之前通过海报、横幅、bbs进站画面等多种途径的宣传，再加上Mozilla中国、中标软件等公司以及中国开源软件推进联盟的鼎力支持，以及校学生广告艺术协会等兄弟协会和合肥工业大学等兄弟院校同学的大力帮助，本次活动于2010年11月21日在3121教室成功举办，现场200名左右的同学和校友以及开软件软爱好者参加了活动。   本次活动由顾昊同学主持。在活动中，科大计算机系本科的张昊翀同学首先给大家详细介绍了Linux安装的相关知识，包括发行版的选择和如何分区。另外他还向大家介绍了grub的一些知识，例如如何设置默认启动项，如何修复grub以及如何删除grub并修复windows启动项。   紧跟着是趣味问答环节，该环节送出了Mozilla中国、中标软件等公司以及中国开源软件推进联盟赞助的礼物。该环节问了一些很有趣的问题，例如“列举5个以上Linux发行版”、“列举5个以上窗口管理器”、“一块硬盘最多能有几个主分区，为什么？”等等问题。同学们回答踊跃，现场气氛很热烈。   接着科大计算机系研究生张成同学给大家介绍并演示了PXE系统。张成同学现场显示了knoppix、中标普华、ubuntu、mint等操作系统，介绍了如何通过pxe安装linux，并展望了通过pxe建立全校无盘系统的愿景。   之后由祝元宠同学给大家带来了各个Linux发行版的简要介绍。接着便是活动的安装环节，有二十多位同学携带了笔记本电脑现场安装了Linux。同学们十分积极，气氛很热烈，活动从下午两点半持续到了五点半。之后有十几名热心志愿者参加了LUD（Linux User Dinner）聚餐，就Linux社区讨论了许多问题和展望，增进了技术和感情。   活动结束后一周，很多同学发帖询问Linux安装的相关问题，在bbs的Linux版掀起了一个安装Linux的小高潮。   以下是活动现场的照片：                          ","categories": ["LUG活动"],
"tags": ["Linux User Party","Linux Install Party","PXE"],
"url": "https://lug.ustc.edu.cn//news/2010/12/2010-04-linux-install-party/",
"teaser": null
},{
"title": "mirrors.ustc.edu.cn开张啦！",
"excerpt":"经过大半周的迁移和新脚本的测试，现在mirrors.ustc.edu.cn已经基本稳定了。 新机器的域名： IPv4/v6: mirrors.ustc.edu.cn  （能解析出教育网/电信/v6地址） v4only:  mirrors4.ustc.edu.cn （能解析出教育网/电信地址） v6only:  mirrors6.ustc.edu.cn 有些地方（比如我测试的合肥长宽），DNS会解析出电信地址，但使用教育网地址访问更快，这时可以通过修改hosts指定强制使用教育网地址访问。 教育网ip：202.38.95.110 电  信ip：202.141.160.110 v6  地址：2001:da8:d800:95::110 支持的访问方式： http/ftp/rsync 提供的服务： 原debian.ustc.edu.cn和oss.ustc.edu.cn提供的镜像服务基本上都迁移过来了，除fedora/ubuntu-partner外。fedora正在进行同步，ubuntu-partner也会在近几天同步过来。 原centos.ustc.edu.cn提供的centos/epel/linux-2.6.git也已经迁移过来了。 需要注意的修改： debian.ustc.edu.cn和oss.ustc.edu.cn两个域名已经设置为mirrors.ustc.edu.cn的别名，大多数镜像的相对地址没有改变，所以大家基本上不需要对原有设置进行修改（如sources.list），可以继续正常使用。但是以下镜像用户请注意： gentoo用户，原portage地址： rsync://oss.ustc.edu.cn/pub/gentoo-portage 已经调整为： rsync://mirrors.ustc.edu.cn/gentoo-portage cygwin用户，原cygwin源地址： http://oss.ustc.edu.cn/cygwin/cygwin/ 已经调整为： http://mirrors.ustc.edu.cn/cygwin/ 原ubuntu cdimage地址： http://debian.ustc.edu.cn/ubuntu-cd 已经调整为： http://mirrors.ustc.edu.cn/ubuntu-releases 原fedora linux地址： http://oss.ustc.edu.cn/fedora/ 已经调整为： http://mirrors.ustc.edu.cn/fedora/linux/ centos.ustc用户，请修改自己的CentOS-Base.repo和epel.repo，将文件中的域名 centos.ustc.edu.cn 修改为 mirrors.ustc.edu.cn linux-2.6.git用户，请修改origin地址： git remote set-url origin git://mirrors.ustc.edu.cn/linux-2.6.git 使用帮助： 大多数镜像的使用帮助已经完成，大家在对应的目录下，如： http://mirrors.ustc.edu.cn/ubuntu/ 点击页面上方（标题下方）的使用说明链接，可以打开其对应的帮助信息，如如何设置sources.list文件。或者也可以直接打开 http://mirrors.ustc.edu.cn/mirror-help/.html 在首页上点击使用说明链接，点击其中对应的源的链接，也可以跳转查看相应的帮助。 由于人手不够，有些源还没有使用帮助信息，也欢迎大家帮忙写了，发送给我们。 状态监控： 在首页点击页面上方的同步状态链接，可以查看当前各镜像的同步状态，包括成功与否/上游源/镜像体积等。大家如果知道更好（更新、更快）的上游源，请联系我们。 如果同步出现故障，服务器的管理员会收到邮件通知，以尽快处理，所以大家看到状态监控页面中有显示同步失败的条目时，无需联系我们。 如果同步状态上显示同步正常，但实际使用过程中发现镜像有问题，请联系我们。 联系方式： 我们的邮箱：mirrors@ustc.edu.cn 鸣谢： 感谢中国科学技术大学、网络信息中心的支持，特别感谢jameszhang老师为我们提供服务器！...","categories": ["LUG活动"],
"tags": ["LUG","mirrors.ustc.edu.cn"],
"url": "https://lug.ustc.edu.cn//news/2011/04/mirrors-ustc-edu-cn-comes/",
"teaser": null
},{
"title": "Color my desktop,Color my life!",
"excerpt":"4月6日，已经连续多次跳票的Gnome 3终于在大家的翘首企盼中发布了，为了庆祝这件开源社区令人振奋的盛事。中国科大LUG(Linux User Group)特联合北京GUG(Gnome User Group)以及合肥LUG,联合举办Linux 技术沙龙暨Gnome 3发布活动。本次活动获得了中标软件公司的大力支持，并同时很荣幸的邀请到了北京Gnome用户组的李震宁主席参加。      Linux技术沙龙是中国科学技术大学Linux用户协会定期举办的活动，主旨在于推广Linux技术 ，宣传和鼓励开源和自由软件精神。本次Linux技术沙龙主题是“探秘Gnome 3.0”。不了解Linux的人往 往以为Linux是一个很古板的东西，图形化界面很不美观，难以摆脱粗糙风格。“Gnome ”是一种Linux一种桌面环境，以往安装Linux的Gnome1.0与Gnome2.0环境界面，不支持多点触控，操作较为费力，对于习惯windows的用户来说，最不习惯的就是Gnome的单点操作。这次技术沙龙就是要把将宣传千呼万唤始出来的“Gnome 3.0”，也将Gnome 3.0带到同学们的身边。本次活动可以让同学们亲身体验到Gnome 3.0的华丽特效与便捷操作，同时获得Linux与Gnome的相关知识。   由于活动之前通过海报、横幅、bbs进站画面等多种途径的宣传，再加上中标软件公司的鼎力支持，以及合肥工业大学等兄弟院校同学的大力帮助，本次活动于2011年4月16日在3124教室成功举办，现场200名左右的同学和校友以及开软件软爱好者参加了活动。   本次活动由LUG@USTC王鹏会长同学主持。在活动中，北京GUG（Gnome User Group）主席李震宁先生首先给大家详细介绍了Gnome 环境的相关特性，包括Gnome的诞生经过。另外他还向大家介绍了Gnome的一些知识，紧跟着是趣味问答环节，送出中标软件公司赞助的礼物。该环节问了一些很有趣的问题，例如“为什么Gnome的图标为脚印？”、“列举5个以上窗口管理器？”、“什么是GTK？”等等问题。同学们回答踊跃，现场气氛很热烈，回答的同学就能获取一份小礼品。   LUG的祝元宠同学给大家介绍并演示了Gnome 3.0环境。祝元宠同学现场演示了linux在Gnome环境下的新特性，如无限度多窗口功能，绚丽切换窗口功能，多点触控功能等等新特性。同学们均深深体会到了Gnome 3.0令人震撼的华丽和亲和。   科大计算机系研究生，LUG CTO张成同学绍了现在学校linux 用户协会服务器现状，包括科大linux用户协会的创办历史，以及学校LUG资金来源，debian, oss, pxe, freeshell, lug.ustc等服务器的配置。然后张成详细介绍了本学期服务器维护小组的工作计划，包括oss/debian系统和服务的更新以及pxe服务的改造构想，并展望了通过pxe建立全校无盘系统的愿景。   接下来赵希明同学为大家介绍了Linux新手在学习中应该注意的问题,赵希明用风趣幽默的介绍指出了newbie应该遵守的社区礼仪以及在出现问题的时候应该怎样获得帮助。   活动最后由北京GUG主席李震宁先生与王鹏同学给大家进行了抽奖环节，若干名参与者成为了当天的幸运观众，并获得了收音机、文化衫、小玩具等奖品。整个技术沙龙中同学们十分积极，气氛很热烈，活动从下午两点半持续到了五点半。之后有十几名热心志愿者参加了LUD（Linux User Dinner）聚餐，就Linux社区讨论了许多问题和展望，增进了技术和感情。   在活动后的LUD(Linux User Dinner)上同学们对北京GUG主席的到来，以及中标公司长期以来对LUG@USTC的支持表示感谢，李主席与志愿者们共进晚餐。餐会上商讨并同时宣布HFGUG(Hefei Gnome User Group)(筹) 成立,王鹏担任筹委会主任。HFGUG(筹)的成立必将为开源软件特别是Gnome桌面在合肥乃至全国的推广做出自己的贡献。   下面是活动现场的一些照片:                          ","categories": ["LUG活动"],
"tags": ["gnome3","Linux User Party"],
"url": "https://lug.ustc.edu.cn//news/2011/04/gnome3-launch-party/",
"teaser": null
},{
"title": "Fwd: 读书笔记：关于维护服务器的一些技巧",
"excerpt":"寒假读了三本书《LINUX SERVER HACKS 卷二》《实战Nginx：取代Apache的高性能Web服务器》《Linux服务器性能调整》，简单地了解了些linux服务器维护和管理上的技巧。现在就分别简要谈谈我在读这三本书时的感受吧。   一：《LINUX SERVER HACKS 卷二》   首先，这不是一本工具书，而是一本经验集。书内都是很巧妙的一节一节的linux服务器维护技巧，主要目的是提高维护linux是的速度和鲁棒性。说实话，我不是很习惯这种模式的书，因为如果带着问题去读这本书，读完后还是问题，而本不是关心的部分，读完后也很快就忘了。   简言之，我懂这本书里得到的信息有：   一：linux非常灵活，特别是结合NFS以及远程终端，可以做非常有想象力的事情。   二：在复杂的连线环境中记得使用screen   三：脚本可以做几乎任何维护性质的事，而且事情的解决方案往往比你想得简单。   四：注意uid，gid重用可能带来的问题   五：Google万岁   二：《Linux服务器性能调整》   这本书翻译的不是很好，文法晦涩，而且介绍的东西偏深，很多是探讨内核级的优化。感觉看得不是很明白，简单写写吧。   一：关于服务器文件系统的选择：ReiserFS鲁棒性很好，而且对小文件有最佳性能。XFS针对大型文件有最佳性能。   二：一块硬盘上读取外侧磁道的速度要快于内侧磁道，所以分区是可以考虑这点将序号小的分区分配给经常读写的目录。譬如分区时第一个为swap，第二个/var，再者/usr，最后才是根和/home   三：mount文件系统时带上noatime可以提高一些性能。   四：文件系统在创建的时候可以调教一些参数优化性能   五：各类监控/tweak工具：hdparam, iostats, top, vmstat   三：《实战Nginx：取代Apache的高性能Web服务器》   这本书灌水的内容比较多，内容实际上也就是作者博客上的一些应用技巧的整理，可以总结的不多，因为按部就班的做就行了。   从书中看，nginx的性能优于apache，而且在反向代理方面特别有优势，这是它的亮点。Nginx虽然支持rewrite，自我感觉还是蛮好用的，但是不兼容apache的.htaccess，使用时需注意。   Nginx的组件高度模块化，可定制性比较强，具体可在使用时疯狂google。   对于使用php+mysql的场合，注意php使用fastcgi的方式启动，性能貌似比传统cgi要高不少，估计和apache的module差不多   书中没有提到什么值得一提的优化，具体实践的时候多google好了。对于硬件环境不好的服务器，减少nginx工作进程，打开gzip压缩和缓存，为php安装加速器并为低配置环境优化，数据库（例如mysql）在配置时减少内存占用上限。选择myisam而不是innodb。   简言之，这本书最大的作用就是让nginx变得平易近人大家都可尝试了。  ","categories": ["读书笔记"],
"tags": ["nginx","linux server","php","mysql","reading notes"],
"url": "https://lug.ustc.edu.cn//news/2011/04/2011-winter-reading-notes/",
"teaser": null
},{
"title": "Debian中国官方镜像：ftp.cn.debian.org",
"excerpt":"祝贺mirrors.ustc.edu.cn成为Debian中国官方镜像！此前，中国大陆debian镜像与主镜像延迟达24小时以上，现在，ftp.cn.debian.org直接从syncproxy.wna.debian.org接受推送更新，其延迟降到6小时以内。此外，另一国内主力镜像anheng.com从ftp.cn.debian.org接受推送，延迟也在10小时以内。mirrors.sohu.com亦开始从ftp.cn.debian.org同步。   Debian用户使用帮助   使用当前稳定版Debian Squeeze的用户，请使用以下内容替换/etc/apt/sources.list   deb http://ftp.cn.debian.org/debian squeeze main deb-src http://ftp.cn.debian.org/debian squeeze main deb http://ftp.cn.debian.org/debian squeeze-updates main deb-src http://ftp.cn.debian.org/debian squeeze-updates main deb http://mirrors.ustc.edu.cn/debian-security/ squeeze/updates main deb-src http://mirrors.ustc.edu.cn/debian-security/ squeeze/updates main   其他版本用户请参考Debian使用帮助。   镜像同步帮助   Debian Archive   请使用官方推荐的ftpsync脚本进行同步，脚本中有很详细的注释说明。如果有问题，请联系我们。   Debian CD   如果您已经同步了Debain Archive，那么推荐您使用jigdo来同步，这可以节省很多流量和时间，平均每个CD的ISO仅需不到1分钟。这里有使用说明，同步脚本在这里可以下载到。   推送同步   为了尽可能减少与Debian主服务器的延迟，推荐您接受我们的推送。每次ftp.cn.debian.org同步完成后，会主动告知下游源，激活下游源的同步脚本。要接受推送同步，请下载我们的pubkey，并保存到运行同步脚本的用户的~/.ssh/authorized_keys中：   wget -O- http://mirrors.ustc.edu.cn/~stephen/debianpush.pub &gt;&gt; ~/.ssh/authorized_keys   然后发邮件告知您的服务器地址、ssh端口以及用户。   联系方式   如果您对我们的服务器有任何建议或者意见，以及使用中碰到任何问题，都可以联系我们，我们的邮箱是：mirrors AT ustc.edu.cn.  ","categories": ["LUG活动"],
"tags": ["mirrors.ustc.edu.cn","debian","ftp.cn.debian.org"],
"url": "https://lug.ustc.edu.cn//news/2011/05/ftp-cn-debian-org-comes/",
"teaser": null
},{
"title": "Linux版版聚",
"excerpt":"                                                                                            ","categories": ["LUG活动"],
"tags": ["版聚","BBS"],
"url": "https://lug.ustc.edu.cn//news/2011/05/linux-e7-89-88-e7-89-88-e8-81-9a/",
"teaser": null
},{
"title": "定制PXE Live系统",
"excerpt":"现在已经有上百中Linux发行版，很多发行版都提供了通过PXE启动的Live系统。在科大校园网网络启动服务上，我们部署了很多发行版的Live系统，例如Ubuntu、Debian、Deepin、BackTrack、Knoppix等，既给一些需要维护系统的同学带来了极大的便利，也使得那些未接触过Linux的同学可以“无痛”体验各发行版，并决定哪一款发行版更符合自己的口味。然而，随着校园网的发展，大家的需求也变得更加多样化。各发行版的Linux系统已经不能满足大家的需求，因此我们需要自己定制一些系统，以满足在学校中各个场合的需求。 发行版Live系统的限制 发行版提供的Live系统具有这些限制： 数据易失。Live系统启动后所有的修改都保存在内存中，重启系统后所有修改都丢失了。 预装软件少。Live系统只预装了很少的软件，不足以日常办公的需求，即使作为体验系统也偏少 各使用场合的需求 目前在校园网中，大家对系统的需求有这些： 体验系统。对于Linux新手，要决定是否使用一个系统，一次体验是不够的，需要长期的使用，因此需要能够保存一些对系统的修改，如新装的软件、修改的配置文件、一些用户数据 公共机房的系统，需要安装所有常用的软件 个人移动办公使用的系统，需要能够将一些个人数据存放在网络上 因此，我们希望能够定自己定制Live系统，以满足各使用场合的需求。 使用Debian Live定制系统 在各发行版中，Debian提供了定制Live系统的工具，Debian Live。Debian Live的文档中有非常详细的介绍。简化后的步骤为： sudo apt-get install live-build mkdir live-system &amp;&amp; cd live-system lb config sudo lb build 其中，在config前可以自己修改config脚本来对Live系统的一些属性进行定制，例如Live的类型（ISO/PXE/HDD等）、Live系统使用的源、安装的软件等。在build系统之后也可以chroot到目标系统中进行进一步的定制。这篇文章中有一个稍微详细的定制步骤。使用live build可以定制debian，也可以定制ubuntu。 然而，这个方法仍然比较麻烦，定制者需要完全从头定制一个系统，并且不能复用一些其他人已经定制过的系统。因此我们推荐选择一个最接近使用需求的系统，在这个系统的基础之上进行进一步定制，而定制步骤也会简洁很多。 基于Linux Deepin定制Live系统 通过观察容易发现，Ubuntu, Deepin, BackTrack等Live系统都使用相似的方法进行封装，因此基于这些系统进行定制的方法基本相同。而Deepin的中国本地化做的最好，也最接近校园网中的各种需求，因此我们选择基于该系统进行定制。 首先观察一下这个Live系统的结构： $ ls -R .: casper DeepWin.exe isolinux md5sum.txt preseed README.diskdefines ./casper:...","categories": ["经验分享","USTC网络启动服务"],
"tags": ["PXE","deepin","live"],
"url": "https://lug.ustc.edu.cn//news/2011/05/customize-pxe-live-system/",
"teaser": null
},{
"title": "Deepin Linux DAU '2011大会花絮",
"excerpt":"2011年5月28日，我有幸受邀代表中科大LUG前往武汉参加了Deepin Linux开发者和用户大会。此行遇见了很多开源界的知名牛人，收获颇多。由于许多Linux站点都已经对此次会议有十分详细的报导，因此我就不再赘述具体的会议过程，而是更多的介绍些花絮吧。   一些花絮   这次大会主办方是Deepin研发团队，主办方接客非常热情周到。由于火车时刻不是很凑巧，当天赶去无法赶上会议，因此提前一天晚上便到了，当天晚上我被安排跟Hiweed住在一个房间。晚上，刘总（Deepin）、欣姐还有Hiweed与我聊了很多，主要聊了科大LUG在高校推广方面的努力和计划，以及我个人的一些想法，另外刘总也跟我聊了Deepin的发展计划。聊天开始时，Deepin说我们的域名可能有问题了，结果晚上他们刚回去，就发现deepin的域名都无法解析了……现在新的域名已经生效（http://www.linuxdeepin.net/），网站部分内容还没有完全迁移完成，论坛将从深度的其他内容独立出来，并将在近期上线。   第二天早上，跟Hiweed吃早饭的时候，小白（BJGUG负责人）到了，他吃过简单的早餐，就去一所中学了，与学校的老师讨论学校教育中使用开源软件的事。现在有许多中小学的计算机启蒙教育中都开始用开源软件了，很让人振奋 :-)   去会场的路上，大家在开玩笑。前几天某校长在武大被扔鞋，这次我们请来了比较有争议的袁教授，而且此次会议有很多武大的学生参加，会不会也被扔鞋？要不我们自己安排个人来扔鞋吧，还得安排两拨，互扔，炒作气氛！呵呵，just a joke!   这次会议在君宜王朝大酒店举行，可能前期的沟通不是特别好，在布置会场时碰到了些问题，不过对会议影响不大。最“惊险”的算是那个无线话筒吧，似乎耗电量很大，现场试了一下，就掉了一格电（共三格）了，当时担心会不会讲到一半就没声了。还好，六位嘉宾演讲时，都没出问题，在提问阶段，第二个人开始，话筒就没声了T.T……   晚上嘉宾自由交流会上，袁教授发完一个长长的言后，就耷拉脑袋了。我和Hiweed坐在他旁边，都以为他睡着了，后来有个人讲完话后，袁教授突然接话了！原来他没睡着，就是闭幕养神:-) 袁教授其实很可爱，年纪这么大，依然很有激情。对国内开源事业的发展也很关心，这次大会刚回去，就联系与永中的曹参见面，讨论Deepin与永中合作的事，看袁教授最近几天的博文，他对此事一直很上心。   交流会结束后，我们几个年轻人（yanting, Hiweed, Deepin等）出去吃烧烤，随心所欲的聊天。yanting和Hiweed都是很活跃、很有想法、很会闯的人，我的性格跟他们很像，因此听他们讲故事的时候，共鸣很强，感触很深。Deepin跟这它的团队一样很年轻，我相信也同样会很有想法、很有活力！   第二天我受邀去武大参观了他们自强网的工作室和机房。同时也交流了一下两校在推广Linux时的优势和障碍。武大的学生课余时间相对较多，自强网完全由学生来维护，但他们的资源（网络带宽、服务器配置等）有限。科大有着很好的Linux使用的环境，网络条件也非常好，但是大多数学生的课余时间较少。   下午赶去火车站时，由于宾馆在市中心最堵的路段，半天都没打到的，正愁会误点赶不到火车站时，一个小“摩的”（加引号是因为不是摩托车，而是电瓶车，但我想不出用什么词好了 :-P）来了，不到20分钟就赶到火车站了。“摩的”小哥自我介绍说是武大食堂的，下午没事做，就出来转转，能赚点钱就赚一点，要过日子阿。小哥很热情，收的钱也不多（应该比打的便宜），很开心 :-)   会场照片   这些是会场上的一些照片。（大家能否给我推荐个显示图片的插件？可以显示图片总数和当前图片编号的？）                                                                                                                                                                                                                                                                                          相关报导   以下是一些特邀嘉宾对此次大会的报导：      Linux Deepin武汉技术交流会后记（笨兔兔）   Linux Deepin 2011开发者和用户大会实录（驱动之家）   (http://www.ownlinux.cn/2011/05/28/ownlinux-linux-deepin-2011.html)（OwnLinux.cn）   国产Linux发行版面临的机遇和挑战（51CTO）   武汉Deepin DAU会议见闻（basic coder）  ","categories": ["LUG活动"],
"tags": ["deepin","Linux","花絮"],
"url": "https://lug.ustc.edu.cn//news/2011/06/deepin-linux-dau-2011/",
"teaser": null
},{
"title": "中科大Linux文化衫开始接受预定啦！",
"excerpt":"1、圆领样式   此次文化衫主题为Linux 20周年。正面图案分男版和女版，图案分别如下：   男版： http://staff.ustc.edu.cn/~jhqi/LinuxTee2011/front_1.6.0.png   女版： http://staff.ustc.edu.cn/~jhqi/LinuxTee2011/front_1.6.1.png   背面图案为科大维护的服务器历史，男版女版相同，图案如下：   http://staff.ustc.edu.cn/~jhqi/LinuxTee2011/back_1.1.png   2、翻领样式   由于许多网友要求提供翻领样式，因此今年也提供翻领样式，翻领的正面图案是将圆领的背面图案放在左前胸，将圆领的正面图案放到后背。效果如下图的最后一行：   http://staff.ustc.edu.cn/~jhqi/LinuxTee2011/polo_sample_1.png   3、价格   圆领的价格为：￥45   翻领的价格为：￥60   需要邮寄的，需要额外支付￥20邮费。   （科大在校师生、校友请到瀚海星云Linux版回帖预定，价格有优惠哦！）   前20位预定的友人，我们将在邮寄文化衫时附赠一张GNOME3体验光盘。   4、预定方式以及支付方式   您可以通过支付宝向我们支付费用。   我们的支付宝帐号为：lug@ustc.edu.cn，支付流程：                  登录支付宝–&gt;“我的支付宝”–&gt;“我的生活助手”–&gt;“我要付款”–&gt;在“对方支付宝账户”里输入lug@ustc.edu.cn即可。在备注中留下您的姓名，并且向lug@ustc.edu.cn发送一封邮件，标题为”预定文化衫–您的姓名”，内容为您选择的版式（男/女       圆领/翻领）、身高、手机号和详细的收货地址，我们将在24小时内回复您的邮件，表明我们已经收到您的付款和预定。           6、时间安排   本次预定从发本日志起到2011年6月11日晚23时59分结束预定。结束预定后，我们立即联系商家开始制作版衫，并争取一周内完成并开始发放，预计6月18日可以开始发放工作。发放方式到时候再发日志说明。  ","categories": ["LUG活动"],
"tags": ["BBS"],
"url": "https://lug.ustc.edu.cn//news/2011/06/linux-tshirt-2011/",
"teaser": null
},{
"title": "Linux Install Party又来了，就在本周日！",
"excerpt":"Linux Install Party，一个人人都可以参加的linux盛会，Let’s Introduce   Perfection.   如果你是新手，在这里，你可以接触到linux最新鲜的感觉，了解基础并且好用的   linux知识，获得他人的帮助，与linux进行亲密接触！   如果你是高人，在这里，你可以认识志同道合的朋友，交流linux里好玩的技巧和鲜为人   知的秘密，帮助和当年的你一样的初学者，多么有成就感！   Linux Install Party，就在本周日下午2:00，3112教室。   Linux User Group   life, love, linux  ","categories": ["LUG活动"],
"tags": ["Linux Install Party"],
"url": "https://lug.ustc.edu.cn//news/2011/12/linux-install-party2011/",
"teaser": null
},{
"title": "软件自由日 SFD 2012 合肥站活动（附带网上直播地址）",
"excerpt":"SFD 就是传说中的软件自由日（Software Freedom Day），今年的合肥站庆祝活动将在本周六（9月15日）于中国科学技术大学举办。这是一个推广和宣传自由/开源软件的全球性庆祝活动，合肥是全球282个活动举办地之一。 这里有精彩的讲座： 科大LUG前CTO张成师兄将让我们了解自由软件在企业中的应用原来如此多娇 这里有好玩&amp;有用的软件： Linux 上有什么好玩的小游戏？ 小小浏览器不就是上网吗？能玩出什么名堂？ 放音乐、看视频，mplayer是何方神圣？ 如何画函数图像、分析实验数据？ 如何使用虚拟机体验不同的 Linux 发行版？ 如何用 latex 排版出专业的文章？ 开源集成开发环境 Eclipse，听说很强大？ 如何使用科大 FTP 和主页空间？ 大家一定会问：这么多东西，能讲完吗？我们的形式将不局限于讲座，而是展示+体验 :) 现场将有若干展台，专题讲座结束后，大家可以在不同展台之间自由体验、交流，共同体验各种自由软件的魅力。像不像一个自由软件展览会？ 这里有给力的奖品： 有 Meego USB Hub、Meego 电脑包、红旗和自由软件日的文化衫、Ubuntu 贴纸…… 还有 Linux Deepin 12.06, Qomo等 Linux 发行版的官方光碟，一共有80张，在多功能厅门口发放，先到先得哦~ 承办者：中国科学技术大学 Linux 用户协会 时间：    2012年9月15日上午9:30 地点：    中国科学技术大学西区学生活动中心三楼多功能厅 （31.839339,117.253636）...","categories": ["LUG活动"],
"tags": ["LUG","USTC_LUG","SFD"],
"url": "https://lug.ustc.edu.cn//news/2012/09/sfd-2012-hefei-ustc/",
"teaser": null
},{
"title": "科大 LUG Linux User Party 活动成功举行",
"excerpt":"高速发展的互联网改变着人类的生活方式，而基于Linux的Web技术支撑起了当今互联网的大厦。“Let’s Build – Building the Next-generation Web &amp; Architecture”的大标题投影在东区水上报告厅，2012年11月24日下午，科大LUG以“Going Online, Going Native”为主题的Linux User Party活动举行。Guide to Node.js，Linux高性能计算集群，iptables灵活网络配置，LUG Services项目启动……内容充实的讲座持续了四个小时，从不同角度讲述了Linux在Web Services、科学计算和我们生活中的应用，描绘了LUG Services的美丽蓝图。 首先演讲的是《Node.js开发指南》作者、清华大学开源软件镜像维护者、清华大学学生郭家宝。JavaScript技术的进化伴随着多家互联网企业的兴衰，Node.js是目前最流行的将JavaScript用于后端的框架。以往Web开发常常是前后端在不同的编程语言中重复写同样逻辑的代码，而在Node.js中这样的问题得以缓解。 不同于多数后端技术，Node.js采用了事件驱动的非阻塞编程模型，这使得Node.js可以在单线程中达到其他语言中需要多线程才能达到的CPU利用率。借助V8引擎的执行效率，JavaScript已经成为最快的脚本语言之一；再加上异步并发的编程模型，用Node.js可以实现很高性能的Web服务器，尤其适合需要进行“服务器推”的WebSocket类应用。 Node.js强大的性能背后隐藏着编程和调试的困难，例如通过回调函数来进行控制流传递的编程范式。为此，郭家宝发起了开源项目Continuation.js，通过编译将嵌套的回调函数平面化，简化顺序逻辑在Node.js中的实现。 演讲结束后，同学们提出了“现有系统是否应该换用Node.js”、“为什么现在Web开发用的更多是PHP”、“Node.js是否对系统资源消耗很多，是否对硬件配置有较高要求”等很多有趣的问题，郭家宝一一作答，希望我们以更开放的心态迎接新技术。每位提问的观众都收到了一份Ubuntu的精美礼品。 第二个演讲的是科大超算中心李会民老师。2012年世界排名前500的超级计算机中，运行Linux的占90%以上，只有一两台运行的是Windows系统，Linux在高性能计算领域占据统治地位。这场讲座带领我们从Linux这个自由的集市中寻找到合适的工具，让身边的计算资源发挥作用。 短短的一个小时，李会民老师以较快的语速，全面讲解了高性能计算集群： 各计算节点要共享文件，有NFS网络文件系统； 主机账号信息要集中管理，有NIS网络信息服务； 集群要快速安装Linux，以PXE网络启动为基础的kickstart网络安装工具很实用； 集群之间时间要同步，有NTP时间服务器； 集群节点之间要通信，SSH可以用key无密码登录； 要同时管理多台机器，有pdsh这个并行shell和交互式脚本语言expect； 要自动化运行复杂任务，有作业调度系统TORQUE； 要监控系统性能，有集群监控软件Ganglia； 内网服务器要访问外网，有iptables。 并行计算的基本原理，MPI和OpenMP编程框架、GPGPU计算； 还有磁盘配额、编译环境的配置…… 接下来又是一个很多人争着举手发言的互动问答环节。针对一台机器能不能部署高性能计算的疑问，李会民老师说，除了kickstart网络安装之外，上述工具都可以在单台机器上使用，而且其中涉及的技术在日常Linux使用和运维中也是有用的。 利用五分钟的中场休息时间，李喵喵介绍了Linux Deepin这个对新手友好的Linux发行版，并现场发放Linux Deepin赠送的安装光盘。 第三个演讲的是科大Linux用户协会CTO郭家华同学。 科大网络通是什么原理？同学们好奇地抬起了头，”数据包传送过程“显得不再枯燥了。 想与同桌共享网络通？用iptables进行数据包转发； 那么与整个机房共享网络通呢？有网络地址转换（NAT）； 让外网访问内网端口提供的服务，可以用端口映射； 要端口映射到任意计算机，SNAT和DNAT可以配合使用。 特别值得一提的是，演讲所用slides中的网络拓扑结构图是用graphviz画的，图形清晰明了。 活动的压轴环节是LUG网络服务系统介绍与展望。 李喵喵首先介绍了即将发布的USTC Blog服务。尽管社会化媒体层出不穷，但博客仍然是信噪比最高的内容发布平台。在博客中，我们可以发表个人心情，可以制作图片展，可以彰显技术经验，可以作为推广媒体，博客的形式永不过时。USTC...","categories": ["LUG活动"],
"tags": ["Linux User Party"],
"url": "https://lug.ustc.edu.cn//news/2012/11/ustclug-going-online-going-native/",
"teaser": null
},{
"title": "“Linux让一切变得简单”活动",
"excerpt":"2013年4月21日下午，科大LUG与计算机学院学生会合办的“Linux让一切变得简单”活动在3121教室举行。      李博杰首先带来了《OS和网络从这里走来》(slides)，从UNIX操作系统的诞生、兴起讲到AT&amp;T的封闭与UNIX的分裂，再到GNU计划和Linux的诞生，回顾了这段波澜壮阔的操作系统进化史。目前，Linux垄断了高性能计算，并被互联网公司广泛采用，以Linux为主阵地的黑客文化还孕育了自由编程语言、开源硬件。从浏览器发展史和User-Agent的乱象，引出Web开放的趋势。最后，用《大教堂与集市》分析了Linux成功的原因。   在随后的互动环节中，回答出问题的两名同学获得了U盘。      接下来是郭家华的《Linux让你更懂计算机》(slides)。首先，他以娴熟的操作演示了从硬盘中恢复被删除的数据，将硬盘MBR的结构、“设备即文件”的概念和一些瑞士军刀式的Linux命令融入其中。然后，他演示了用tcpdump等抓包工具分析网络状况。最后，他以acm.ustc.edu.cn评测系统为例讲解了传统程序限制方法的“不靠谱”和用ptrace拦截系统调用的沙盒原理。听众们在膜拜技术之余，还体会到Linux工具庖丁解牛般的强大。      接下来沈达为我们带来了《可爱的Python》(slides)。首先，他简短地介绍了Python的优雅特征、编程思想和一些好玩的应用。随后由听众提出问题，他来回答。科学计算中Python和Fortran的比较，从程序语言角度Python和C的比较，Web开发中Python是否合适……沈达将“程序语言的选择一方面是需求，一方面是兴趣”的观点融入互动问答，从多个角度诠释了黑客文化。   在最后的互动环节中，回答出问题的一名同学和最先提出问题的两名同学获得了U盘。活动在大家热烈的讨论中成功结束。   本次活动的所有slides   本次活动的所有照片  ","categories": ["LUG活动"],
"tags": ["USTC_LUG"],
"url": "https://lug.ustc.edu.cn//news/2013/04/linux-make-everything-easy/",
"teaser": null
},{
"title": "2013 LUG换届会议",
"excerpt":"2013年4月28日晚上，LUG在活动室召开了换届会议。LUG新老会员齐聚一堂，商定了LUG下届主要负责人，一起讨论了LUG发展大计。      首先是自我介绍。接下来现任会长、副会长、前任会长分别介绍了一年来的感受与对新一年的期望。然后统计每个人的年级、感兴趣的方向，其间大家纷纷对LUG发展出谋划策，气氛热烈。   在活动方面，大家认为，LUG应该把眼光放到全校，更加关注东区，面向 Linux User，为同学们解决实际需求；而不是成为 Linux Developer Group，昨天考物理、今天维护服务器。在网络服务方面，黄若山提出做贴近普通用户的服务，做得更专业并实现盈利，不过大家认为学校学习紧张，没有时间全力投入；李喵喵再次提出了服务整合和“硬又黑”导航条的设想。      经过反复协商，大家一致推选2010级物理学院的张光宇为新任会长，并依据大家的意愿分配了CTO（技术）、COO（运营）、CPO（资产）、CNO（外联）、CFO（财务）、CIO（宣传）。新一届主要负责人中，2009级1人，2010级1人，2011级2人，2012级2人；计算机学院4人，少年班学院1人，物理学院1人（CIO孙金鹿除外），梯队较为合理。         换届之后，讨论了即将举办的 Ubuntu &amp; Debian Release Party，下半学期的“USTC 主页大赛”（blog 大赛），LUG 十周年宣传册等。   最后，现任CTO郭家华宣布 Mirrors Lab 成立，并为大家开帐号。   参加此次会议的有祝元宠、顾昊、李喵喵、童献、黄若山、李博杰、郭家华、张光宇、沈达、黄震宇、张荣葳、朱晟菁，还有一位妹子。   本次会议的照片在 LUG FTP 的“会议”目录中。  ","categories": ["LUG会议"],
"tags": ["Meeting","USTC_LUG"],
"url": "https://lug.ustc.edu.cn//news/2013/04/lug/",
"teaser": null
},{
"title": "2013科大LUG Linux User Party",
"excerpt":"2013年12月1日，中国科学技术大学校学生Linux用户协会在科大西区活动中心学术报告厅举办了一年一度的Linux User Party。   本次活动主要面向校内学生进行宣传，不仅在在宣传方式上覆盖了大部分常用方式，而且首次推出并免费赠送Linux协会纪念胸章，由此吸引了许多同学的参加。活动总共到场大约70人。         此次活动我们有幸邀请到了科大高性能计算方面的安虹老师，为大家分享Linux系统在高性能计算领域的应用。在演讲结束之后，现场的参与者踊跃地提出自己的疑问，并与 安虹老师交流自己的一些想法。      接着，副会长张荣葳同学为我们介绍Graphviz软件的一些入门知识。      然后是Linux用户协会的陈张同学带我们一起了解了电脑从按开关到见到Linux桌面的细节，在场同学纷纷表收获丰富。   接下来由张光宇同学介绍Linux用户协会比较知名的一个服务：Freeshell。为大家讲解Freeshell的功能和简单用法。   最后，在同学们激烈的讨论中，本次Linux User Party 圆满结束。  ","categories": ["LUG活动"],
"tags": ["Linux User Party"],
"url": "https://lug.ustc.edu.cn//news/2013/12/2013-e7-a7-91-e5-a4-a7lug-software-freedom-day/",
"teaser": null
},{
"title": "2013 Software Freedom Day 合肥站",
"excerpt":"2013年9月21日下午2：30，中国科学技术大学校 Linux 用户协会在合肥市与全球几百所高校和组织一道，举办了 2013 年软件自由日庆祝活动。 本次活动邀请到了上海 Linux User Group 负责人姚欣宇。他同时也是项目托管平台 GitCafe 的创始人兼 Team Leader。他这次为我们带来的话题是 Git 入门介绍。姚欣宇并不是第一次参加我们协会的活动，在2011年的 Linux User Party，我们也曾邀请姚欣宇来为我们分享他的 Linux 经历。 活动的另外一位嘉宾是少年班学院的杨国鑫同学。他是 OpenSUSE 中文社区的活跃成员，同时是OpenSUSE Guide 中文版的作者。他这次为我们带来的话题是 OpenSUSE 使用经验。 在企业赞助方面，我们得到了如下赞助： Linux Deepin 公司赞助的200张光盘 CrossWeaver 公司赞助的20枚价值128元的 CrossOver 正版序列号 GitCafe 公司赞助的20个马克杯 作为合肥唯一的 SFD 活动，我们在活动之前还联系了安徽大学、合肥工业大学等兄弟院校，让这些学校的 Linux 协会、学生会帮忙进行宣传。 本次活动选择西区学术报告厅为活动场地，大约130人参与了我们的活动，现场气氛热烈。 为了能让参与者们加深对各种自由软件的了解，我们精心制作了展板、学习资料等供大家学习。图为现场门口发放学习资料的场景。 首先由上海 Linux User Group 负责人姚欣宇为我们带来《Git简明入门》：...","categories": ["LUG活动"],
"tags": ["LUG","USTC_LUG","SFD"],
"url": "https://lug.ustc.edu.cn//news/2014/08/2013-software-freedom-day/",
"teaser": null
},{
"title": "2014年8月 SFD 工作规划暨新学期 LUG 工作会议",
"excerpt":"2014年8月30日下午2：30，一部分 LUG 活跃会员在东区活动室聚会，讨论即将到来的 SFD 活动的安排事项以及其它 LUG 的工作事项。与会人员包括：张荣葳、杨博远、崔灏、张光宇、朱晟菁、李子天、 高一凡、罗秀哲。 一.  SFD 相关 SFD 活动定于9月20日，是开学后第三周的周六。 1. 形式 嘉宾演讲+其他演讲者演讲+自由软件展示与自由讨论。往年与今年的活动形式都类似这样。 张光宇提出：应当安排使得演讲人数增加，相应的每人的演讲时间压缩。一小时的演讲时间太长，容易导致对某项演讲不感兴趣的同学中途离场。 因此希望：出更多的演讲人数，话题相应增多，从而维持自始至终参与活动的人数。 需做：多找演讲者。应大于等于5人。 预期效果：中场休息时间更多。 需做：中场休息时间可以放合作伙伴的宣传内容；与会的同学们私下交流的机会更多。 2. 嘉宾 刘世伟先生，从事 MIPS 开发。 演讲内容以 FOSS 相关为主，演讲包括在平日工作中对自由软件的使用。 需做：之后应当加强与嘉宾联系。 3. 校内 需要找演讲者。邮件列表，SNS，BBS 需做：由杨博远发帖发邮件进行。 各位也需要私下联系一些人做演讲。 例子：对 Ruby 的介绍演讲。 张光宇：可以考虑做/找网站：在线注册提交演讲的网站（有这样的网站才能有人提交申请，想让人发邮件申请还是不太好。） 例如：Pentabarf：debian conf 所使用的平台。管理会议与event等。ruby依赖？自己搭建。 也可考虑强制提交演讲者写 abstract（投稿时） 演讲：谁想讲就讲，25min+10min 讨论 4. 时间安排 工作应当按照以下的步骤来： 确定演讲者和内容—&gt;定出时间表–&gt;给嘉宾定火车票等。...","categories": ["LUG会议"],
"tags": ["Software Freedom Day","USTC_LUG","news"],
"url": "https://lug.ustc.edu.cn//news/2014/08/2014-e5-b9-b48-e6-9c-88-sfd-e5-b7-a5-e4-bd-9c-e8-a7-84-e5-88-92-e6-9a-a8-e6-96-b0-e5-ad-a6-e6-9c-9f-lug-e5-b7-a5-e4-bd-9c-e4-bc-9a-e8-ae-ae/",
"teaser": null
},{
"title": "2014自由软件日中国科大站",
"excerpt":"SFD自由软件日是一个关于自由软件和开源软件的全球性庆祝活动。9月20日下午，2014 自由软件日中国科大站活动与全世界190个活动站点一道正式拉开序幕。此次活动宣传充分，准备到位，吸引了许多Linux爱好者们参加。   下午2时，活动在东区图书馆四楼学术报告厅准时召开。活动有幸邀请到了北京龙芯俱乐部核心成员刘世伟先生。校网络信息中心副主任张焕杰老师出席了活动。活动由大一新生张静宁同学主持。      维护网络繁忙的开源软件镜像站有什么挑战？Linux用户协会副会长崔灏同学为大家带来演讲《Mirrors是怎样炼成的》。有了mirrors镜像站，在学校使用Linux的同学们就可以以极高的速度获取到使用系统所必需的软件。为了应对高并发所带来的磁盘压力，mirrors服务器上采用了冗余磁盘阵列技术以同时保障数据访问速度与安全性。通过这个演讲，同学们初步了解到了mirrors服务器的运行机理，窥探到了协会技术工作的冰山一角。   接下来我们的特邀嘉宾北京龙芯俱乐部核心成员刘世伟先生为大家带来展示《在Linux下开发PCB》。在几乎一切均以电子化的当今世界，集成电路已成为我们生活的基础。目前主流PCB开发流程均有闭源的商业软件参与，刘先生展示的gEDA软件使大家眼前一亮。原来集成电路开发也可以开源！      说起数学计算软件，大家脑海中首先浮现的会是Matlab、Mathematica等闭源软件。数学计算能不能开源？Linux用户协会资深会员阴钰为大家带来演讲《Sage：集大成者》。Sage整合了目前流行的各种开源计算库，并给它们提供了一套统一的Python接口。Sage的功能非常丰富，符号计算、数值分析、组合数学、统计分析，应有尽有，只有想不到，没有做不到。不少同学对其表示出极大兴趣。      智能手机操作系统并非仅有Android、iOS、Windows Phone三种。新兴力量在开源界不可小觑。Linux用户协会前会长张光宇同学的《Firefox OS 移动应用开发入门》在移动领域为大家带来了新奇的体验。有了Firefox OS，编写移动端应用程序不需要什么高深的知识。只要会写现代网页，一款移动应用即可新鲜出炉。   互联网上信息瞬息万变，无数的黑客觊觎着用户的个人隐私。面对如此，我们唯有用技术武装自己。Linux用户协会会长张荣葳为大家带来演讲《比安全更安全——GnuPG简介》。GnuPG使用经典的非对称加密算法，有效地防止数据在非安全信道传输的过程中被窃取。与基于CA绝对可信性的SSL/TLS不同，GnuPG实现的PGP使用信任网来推断一份公钥是否属于它所声称的实体。许多同学表示对网状的信任关系有兴趣。      在第二个演讲结束以及全部演讲结束时，我们有抽奖环节。在演讲后提问以及抽到幸运数字的听众均获得了由合作公司赞助的小奖品一份。      感谢Mozilla、CSDN、Deepin与SegmentFault公司对活动的大力支持。最后，活动在大家热烈的讨论中成功结束。  ","categories": ["LUG活动"],
"tags": ["Software Freedom Day","SFD","news"],
"url": "https://lug.ustc.edu.cn//news/2014/09/2014-sfd/",
"teaser": null
},{
"title": "2014 秋季学期会员大会",
"excerpt":"2014 社团招新业已结束，为了让新生更好地了解社团情况、增进社员间相互交流，Linux 用户协会于 2014 年 9 月 26 日晚在西区 3A203 教室举行会员大会，邀请所有新会员参加。   晚7时，大会开始。会长张荣葳代表 Linux 用户协会热情欢迎到会的新会员。      副会长杨博远同学详尽介绍了社团的发展历史、活动概括以及技术成就。他有姿有味的讲解吸引了台下所有人的目光！      第三位登场的是分管技术的副会长崔灏同学。杨博远同学的介绍已经非常详尽了，没事做的崔灏同学就带着大家“参观”了一下由协会维护的各个站点和网络服务，包括科大开源镜像站、科大 Blog、图书馆查询机系统等。      接下来，会长张荣葳同学介绍了到场了的本届和往届协会负责人，其中包括：现任 CPO 张恒若、现任 CIO 尤淼、2013 届会长张光宇、2012 届会长李博杰。      大会现场气氛热烈，欢笑声不断，展现了 Linux 社区的和谐与快乐。   大会后，依然有许多新会员踊跃地向协会负责人提问问题。最后，协会还组织新成员参观了 LUG 在西区和东区的活动室。  ","categories": ["LUG活动"],
"tags": ["LUG","news"],
"url": "https://lug.ustc.edu.cn//news/2014/10/2014-autumn-kaiintaikai/",
"teaser": null
},{
"title": "2014 Linux User Party 暨 Freeshell 用户交流会",
"excerpt":"2014 Linux User Party 暨 Freeshell 用户交流会，于今年12月7日（周日）14时30分，在西活学术报告厅成功举行。 本次活动以 “Freeshell 用户交流会” 为主题。Freeshell 上线于 2013 年 1 月，是科大 LUG 利用少院的废旧服务器搭建的 Linux 虚拟机（VPS）平台，供科大师生免费使用，可以用于开发网络服务、搭建个人主页、挂机编译、跑实验程序等等。 本次活动由会长大人张荣葳亲自主持，并有幸请来了 4 位讲者： 科大云框架设计者 王硕博士 —— 《什么是云计算》 LUG资深会员 高一凡同学 —— 《Docker 的简介与进阶》 iCard作者 王译锋 —— 《现场计算来宾学霸指数》 LUG活跃会员 阴钰 —— 《部署一个网页聊天室》 本次活动有近百名同学参加。主办方 LUG 的小伙伴们更是精心准备了奖品，现场还有小零食可以吃。 近年来云计算的概念越来越火，云计算是继1980年代大型计算机到客户端-服务器的大转变之后的又一种巨变。中国科大云是校网络中心一项给科大师生提供虚拟机的服务。而王硕博士以一个科大云框架设计者的角度，给我们介绍了云计算的特点以及科大云搭建过程中用到的技术。他指出，云计算主要提供强大的计算能力和海量的存储能力，并具有可靠性、可扩展性和灵活性的优点。而科大云搭建过程中的关键技术讲解更是十分专业。 第二位讲者的演讲主题——Docker 是一个开源项目，诞生于 2013 年初。Docker 项目的目标是实现轻量级的操作系统虚拟化解决方案。高一凡同学对 Docker...","categories": ["LUG活动"],
"tags": ["news","LUP"],
"url": "https://lug.ustc.edu.cn//news/2014/12/2014-linux-user-party/",
"teaser": null
},{
"title": "Blog 服务器宕机",
"excerpt":"由于维护人员失误与遭受攻击，Blog 服务器于2014年12月18日凌晨宕机，已基本恢复服务。   受影响的服务包括 lug vpn，freeshell 网页前端，freeshell HTTP 反向代理，ssh.freeshell.ustc.edu.cn，部分校内网站 HTTP 反向代理，ustc blog 服务，字体代理服务，自建递归 DNS 服务，archive.lug.ustc.edu.cn，lug 官方邮箱邮件转发等。freeshell 各个计算节点未受影响。   我们近日将在 servers.blog.ustc.edu.cn 上给出一份本次宕机的技术细节。由于时间仓促，如果您发现有哪些服务仍然存在 Bug，请及时向我们反映。   给您带来的不便，敬请谅解。  ","categories": ["LUG服务"],
"tags": ["server"],
"url": "https://lug.ustc.edu.cn//news/2014/12/blog-server-down/",
"teaser": null
},{
"title": "2015 LUG社团换届会议",
"excerpt":"2015年4月25日晚19时30分，校学生Linux用户协会于东区活动室（科大东区图书馆118室）召开了换届会议。   首先，2014-2015届社长张荣葳同学为我们简要总结了过去一年社团的发展与活动情况。过去一年里，社团组织过许多次有影响力的活动，如广场知识问答、自由软件日活动、Linux User Party、女生节特别活动、LaTeX专题讲座等，提升了社团影响力；也经历了许多变迁与挑战，如活动室迁移、各种服务器宕机事故等。期间，技术方面也取得了进步，如暑假期间对mirrors服务器的在线维护与修理，其它服务器的维护，cuihao, zhsj, gaoyifan 等技术骨干的努力，也诞生了一批基于freeshell的应用成果，如南七书库、icard、选课查询系统等，激发了同学们的编程热情，也对开源软件与开源精神作出了宣传与普及。LUG取得了一定的成就，挖掘出了一批有技术实力的新人，也吸取了各类教训与经验。展望未来，外部环境的变化带来了许多未知数，需要社团继续进行发展与改革。   会议第二部分进行了社长与副会长的更替与选举。上任会长张荣葳决定加入校社团管理指导委员会并卸任会长职位。张荣葳同学向到场同学介绍了社长与副社长的职务工作内容：社长应统筹规划社团发展，掌握社团历史，规划社团工作，分发工作，与管指委与团委进行联络（政治资源、资金、等等）。副社长应辅佐社长处理工作，进行事物分派并完成各种具体的工作。   上任副社长崔灏同学决定参选社长职务。崔灏同学作了竞选演讲，称自己作为副社长工作一年，比较了解社团工作；作为上一届CTO，技术水平较好，对服务器维护了解，有能力担任社长工作。   副社长职位上，崔天一、左格非、杨博远、张静宁四人参选。经过讨论，与会人员决定选出三位副社长。四位候选人均发表了竞选演讲。   之后进行了一人一票的选举投票，其结果如下：      选出崔灏同学担任新一届社长，张静宁、杨博远、左格非同学担任副社长。            图为崔灏同学发表就职感想。   第三部分讨论了社团各种O(“Officer”)的人选。经自我举荐，确定高一凡同学担任CTO职位，崔天一同学担任CFO，尤淼同学主动承担了整理 LUG Wiki 和 LUG FTP 的工作，其余人选待定。   之后，大家讨论了LUG近期的发展与工作事项，包括版衫制作与白帽子大赛的准备以及相关小聚的举办问题，气氛热烈。邓云天同学代表管指委对新一届领导人员就任表示祝贺，希望大家能够共同努力办好社团，使LUG更上一层楼。   与会人员包括崔灏、崔天一、邓云天、高一凡、何旭东、李博杰、沈达、王皓、于天泽、尤淼、杨博远、祝元宠、张恒若、左格非、朱晟菁、张荣葳、张静宁、郑子涵等（名单暂有遗漏，请联系 LUG 进行补充）。其中，邓云天委员助理作为校社团管理指导委员会的代表参会监督。      会后，相关人员还就感兴趣的问题进行了讨论。      本次会议照片上传至 LUG FTP “会议”文件夹中。  ","categories": ["LUG会议"],
"tags": ["Meeting","USTC_LUG","news"],
"url": "https://lug.ustc.edu.cn//news/2015/04/2015-lug-election/",
"teaser": null
},{
"title": "2015 瀚海星云BBS 板板衫方案",
"excerpt":"版衫设计方案征集帖：   http://bbs.ustc.edu.cn/cgi/bbstcon?board=Linux&amp;file=M.1430644311.A   往届版衫方案：   https://lug.ustc.edu.cn/wiki/lug/banshan   活动流程：征集设计方案 → 投票确定设计方案 → 版衫预定 → 版衫发放   版衫方案   目前有3位同学投稿（zhaochi、ewind、JennyZhang @BBS）他们可以免费获得今年的版衫一件；现在，一共有7种设计方案，如下：   方案一   作者：zhaochi 图片：正面图      方案二   作者：JennyZhang 图片：正面、背面效果图，正面、背面图   github commit style               方案三   作者：ewind 图片：正面效果图      方案四   作者：ewind 图片：背面效果图      方案五   作者：ewind 图片：正面效果图      方案六   作者：ewind 图片：背面效果图      编者注：这个背面图打印的面积比较大，可能需要3个版….   方案七   作者：ewind 图片：正面效果图      投票链接   http://www.sojump.com/jq/5057174.aspx   关于底衫与订购商店   底衫由于选择的范围很大，质量价格各种因素很多，工作人员将尽量挑选好的底衫（就不投票决定了，因为目前也没有筛选出来）。底衫样式和颜色会在预定的时候给大家挑选，订购商店我们还在挑选中，有靠谱的、有经验的同学欢迎给我们推荐好的店铺。   欢迎回复本文吐槽。  ","categories": ["LUG活动"],
"tags": ["版衫"],
"url": "https://lug.ustc.edu.cn//news/2015/05/2015-linux-user-group-banshan/",
"teaser": null
},{
"title": "投票结果",
"excerpt":"这次版衫制作，征集到的设计方案 最后的投票结果是： (A) 方案一 5 票 约占 3% (B) 方案二 36 票 约占 23% (C) 方案三 43 票 约占 27% (D) 方案四 13 票 约占 8% (E) 方案五 11 票 约占 7% (F) 方案六 6 票 约占 4% (G) 方案七 22 票 约占 14% (H) 方案八：重制2010年版衫 16 票 约占 10%...","categories": ["LUG活动"],
"tags": ["news","版衫"],
"url": "https://lug.ustc.edu.cn//news/2015/05/2015-linux-tshirt-voting-result-and-order/",
"teaser": null
},{
"title": "5月30日服务器宕机说明",
"excerpt":"blog 服务器于5月30日凌晨起宕机。目前技术人员正在尝试修复，暂时没有修复 ETA。您的博客数据均有备份，暂时无需担心数据丢失问题。   宕机影响范围包括科大博客服务、Freeshell 控制节点与网络控制面板、LUG VPN 防污染DNS等。Freeshell 工作节点暂未受到影响，您仍然能够远程登录虚拟机。   其它服务器可能受到影响；我们正在评估影响范围与严重性。  ","categories": ["LUG服务"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2015/06/201406-server-fault-announce/",
"teaser": null
},{
"title": "GitLab服务器紧急维护通知",
"excerpt":"接到用户反馈，无法git clone项目。   我们发现GitLab服务器文件系统损坏。   目前暂停了GitLab服务，正在紧急维护中。  ","categories": ["LUG服务"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2015/06/gitlab-emergency-maintenance/",
"teaser": null
},{
"title": "mirrors.ustc.edu.cn",
"excerpt":"科大开源软件镜像服务正常。 lug.ustc.edu.cn 目前正常运行的服务包括 LUG Wiki、lug.ustc.edu.cn/sites/*。即日起 LUG 博客（https://lug.ustc.edu.cn/blog/）恢复服务。 LUG FTP 尚未正式恢复。如有迫切需求，请使用 ftp://backup.ustclug.org，使用方法与先前 LUG FTP 相同。 9.3 补充：LUG FTP 现已回复。请使用ftp://ftp.lug.ustc.edu.cn。现在 LUG FTP 部署在 donut 机器上。 freeshell.ustc.edu.cn 目前服务恢复面临技术问题：上游基于 3.10 内核和 CentOS 7 的 OpenVZ 部署方案仍不成熟，故当前处于等待上游开发的阶段，暂无恢复时间表。 8.21补充：如有熟练运用 OpenVZ 或了解内核调试相关技术，有能力且愿意协助项目解决 bug 的同学，欢迎投简历至 lug (at) ustc.edu.cn 了解并参与项目开发，感激不尽 9.3补充：目前 bug 修复有所进展，开发正缓慢进行。 blog.ustc.edu.cn 科大博客已恢复服务。如果使用出现问题，请向我们反映。 Time Machine Time Machine...","categories": ["LUG服务"],
"tags": ["USTC_LUG","server"],
"url": "https://lug.ustc.edu.cn//news/2015/08/lug-service-restore-status/",
"teaser": null
},{
"title": "LUG版衫制作手册",
"excerpt":"上学期5月3日到6月15日制作了LUG 2015版衫，前后花了一个多月的时间，感觉做版衫真是一件十分耗费时间精力的大活动。第一次负责LUG版衫的制作，总结一下一个月的工作。主要流程如下，我们逐一讲解。 方案征集 → 版衫投票 → 协商定稿 → 版衫预定 → 统计制作 → 版衫发放 → 售后服务 方案征集 方案征集前一般要策划时间，一般我们都是毕业季做版衫，6月中旬前要把版衫发出去，需要提前一个半月开始准备。因此版衫征集，五月初就应该发帖了。 发帖要求：这是版衫制作的第一个贴子，需要介绍活动流程，让关注版衫制作的同学知道接下来都要发生什么。其次，发帖主要目的是征集版衫设计方案，因此需要写清设计要求、投稿方式、方案如何选择，另外给投稿者的奖励也十分必要，最后附上往届版衫设计图给大家开脑洞。 注意事项：要求投稿者提供版衫正反面，如果只提供正面图像，背面视为空白。 要做事情：BBS发帖，各种社交平台宣传 建议时间：建议版衫征集时间为14天 版衫投票 版衫方案征集结束后，应该尽快整理版衫方案，为投票做准备。征集到的方案，列出采纳的方案、作者、图片。选择一个投票平台进行投票，注意每个投票的方案都应该包含正反面（无论反面是否空白）。 要做的事情：整理版衫方案发帖，发起投票，各种社交平台宣传 建议时间：整理方案、制作投票时间1天，投票时间6天 卖家协商 版衫方案确定之后，需要尽快定稿。首先，我们需要寻找一家为我们制作版衫的卖家。并根据卖家的要求提供设计图文件，因此必不可少要和联系设计作者。因为，有时根据底衫颜色还需要提供不同颜色的图案，所需的图片大小等，都需要设计作者提供。 其实应该之前就开始寻找卖家，需要根据底衫样式、质量、价格、颜色、制作时间等因素综合考虑。 和卖家定稿之后，需要把大致价格定下来，因为版衫的最终价格和制作数量、印制板数也有关，这个只有等预定结束之后才知道。而预定之前又必须告诉同学们版衫多少钱。所以必须定价建议比卖家给我的价格高一些。这次卖家跟我说大概一件47块，我们定价50。但就社团全部的付出来说，建议定价再高10元，因为需要奖励版衫给投稿的人，也需要库存一些之后卖，多的钱可以作为社团经费。 要做的事情：寻找卖家、联系设计作者、与卖家协商好版衫定稿、定价 建议时间：多方联系到版衫定稿建议2天 版衫预定 在版衫预定发帖前，需要确定预定的方式。考虑到短信、邮件预定我们需要自己统计，建议采用发问卷、或者在线预定平台预定。因为具体每个预定都涉及到很多参数，如衣服尺码、颜色、款式、预订人姓名、联系方式、是否快递、地址等等。另外，我们是预定即付款，否则我们需要垫1万元左右。 由于版衫预定数量决定了版衫的制作量/销售量，我们需要重点宣传，因此需要制作海报、传单来提高预订数量。在预定期间，一定要多宣传，天天刷存在感。 另外，需要单独联系当初给版衫投稿的人，问他们预定信息。 发帖要求：我们把投票结果公布和版衫预定说明合在一个帖子里。首先我们需要在帖子里公开版衫投票的结果，具体的公布每个方案的得票数。然后，把和卖家商量好的版衫设计稿展示出来，有几种颜色，是否分男女款说明清楚。还需要说明预定方式、预定时间、付款方式、预计到货时间。 要做的事情：决定预定方式、发帖、各种社交平台宣传、做海报传单 建议时间：7天 统计制作 版衫预定结束后，需要和卖家确认各种颜色、尺码、款式制作的数量。除了已经预定的同学，我们还需要库存10-20件版衫下学期给卖给新生、或者作为活动奖品。库存的版衫颜色、尺码、款式可以参考预定的数据。此时需要交一定比例的预付金额，因此需要和买家确认最终的总价格。需要统计的可能会涉及各种预定信息，包括是否交钱。也要问清楚多少天可以拿到版衫。 确定后，版衫即投入制作。 需要做的事：统计预定信息、和卖家协商确认、付预定金额 建议时间：统计确定信息1天，版衫制作12天 版衫发放 版衫方法前必然是卖家把版衫寄过来，那么收快递的时候就要确认卖家是否寄了正确数量、款式的版衫。这次每件版衫上都贴有预订者姓名小纸条，是卖家已经贴好的。友情提示快递比较重，需要两三个人一起去取。遇到数量不对还需和卖家联系，建议版衫差不多全发出去之后再给卖家付尾款。 版衫发放前需要发帖，提前到发放点准备好版衫，领版衫需签收，2、3个人一起去发放即可。建议集中一个小时内发版衫，之后需要自行来活动室取。 要做的事情：收快递验货、发帖、宣传、发放版衫、付尾款 建议的时间：1天收快递验货，1天发放版衫。 售后服务 版衫发出去之后，总有人大小不合适什么的，让他们自行交换，因此在BBS上面发一个版衫问题反馈帖子，集中交流。...","categories": ["LUG活动"],
"tags": ["版衫"],
"url": "https://lug.ustc.edu.cn//news/2015/09/lug-banshan-commission-guide/",
"teaser": null
},{
"title": "2015软件自由日中国科大站",
"excerpt":"2015年9月19日是第12个软件自由日。当日下午，中国科大学生 Linux 用户协会在西区活动中心学术报告厅举办了软件自由日科大站庆祝活动。共有超过100位科大及社会人士参加了本次活动。   这是协会连续第六年承办软件自由日中国科大站活动。本次活动中，我们很荣幸地邀请了两位嘉宾进行自由软件主题演讲，他们是在红帽中国从事内核工程师工作的科大校友叶超先生，和对科学数值计算有着丰富的了解的物院13级的罗秀哲同学。协会指导教师张焕杰老师和社团管指委的张荣葳同学也参加的本次活动。   下午2时许，活动还未开始，同学们就已经陆续进入会场西活学术报告厅。我们向参加活动的同学发放了 Linux 系统体验光盘、笔记本、贴纸等精美纪念品。同学们对于本次活动表现出了极大兴趣，不断有同学向工作人员了解演讲内容和活动流程详情。甚至有来自合肥其他兄弟院校的同学，也慕名来到科大参加本次活动。      下午2:30，学术报告厅已经几乎坐满，还有同学在源源不断地进入会场。在主持人张静宁和协会工作人员的组织下，活动正式开始。   叶超先生首先为科大同学带来了《从红帽工程师的角度看开源》主题演讲。他从开源的意义谈起，生动地解释了开源的精神和理念；又结合开源项目实例，展示了当前席卷软件业的开源潮流。最后，他结合自己的工作，解释了开源巨头红帽公司是如何同开源社区展开良好合作的。演讲中，叶超先生多次和同学们互动问答；演讲后，同学们更是不断积极地提问。现场气氛十分热烈。      中场休息时，我们播放了由协会前辈张成学长和李博杰学长拍摄的小短片。学长们对协会的发展做出了很大贡献，也对协会有着浓厚的感情。他们特意拍摄了这些短片，希望通过自己的解说帮助新成员了解校学生 Linux 用户协会这个大家庭。随后，协会副会长左格非同学为大家带来了《自由软件新闻吐槽》小演讲。十分钟的演讲中，他从几个著名开源软件发布的重大更新谈起，带领同学们纵览过去一年中自由软件的大事记。   接下来，罗秀哲同学带来了《Julia——科学计算的银弹》主题演讲。Julia 是一门新兴的高性能数值计算语言，也是一个蓬勃发展的自由软件项目。罗秀哲同学结合自己的科研经历，介绍了 Julia 的优势和发展前景，向同学们大力推广这一自由软件。他还表达了自己希望在科大乃至中国建立起 Julia 中文社区的想法，希望同学们发扬自由软件精神，为 Julia 的发展群策群力。最后，他邀请了同样是 Julia 语言活跃推广者的科大物院12级的徐浩同学来到台上，为同学们介绍了 Julia 的社区发展。现场气氛十分活跃。      两场演讲后，活动进入了尾声，但最后的抽奖活动又将现场气氛推向了一个新的高潮。我们安排了有趣的名片交换活动，每位参加者都事先收到了一张他人填写的名片。抽奖时，每位中奖者不仅收到一份自己的礼物，还要将另一份礼物亲自送给收到的名片上的同学。我们希望抽奖活动带给同学们的不仅仅是奖品，更是一份崭新的友谊。      活动结束后，徐浩同学还用自己的无人机为参加活动的同学拍摄了特别的合影。我们对徐浩同学别出心裁的彩蛋表示感谢。   本次活动受到了各大开源社区和企业的支持，中国科大学生 Linux 用户协会对这些单位的支持表示由衷的感谢（排名不分先后）：      云端开发平台 Coding 为活动提供了抱枕、图书、贴纸等精美纪念品；   Canonical 提供了 Ubuntu 主题的笔记本、贴纸等小纪念品；   红帽中国和 Fedora 中文社区提供了 Linux 系统体验光盘、奖品U盘、服饰等活动物资；   深度科技提供了U盘、图书等纪念品。  ","categories": ["LUG活动"],
"tags": ["SFD"],
"url": "https://lug.ustc.edu.cn//news/2015/09/2015sfd/",
"teaser": null
},{
"title": "2016 LUG社团换届会议",
"excerpt":"2016年4月24日下午15时，校学生Linux用户协会于东区活动室(科大东区图书馆605室)召开了换届会议。   首先，为了活跃气氛，2015-2016届会长崔灏同学向大家展示了android 6.0的新功能：USB MIDI 输入，将手机接到电脑的虚拟键盘上之后弹出了优美的旋律。   步入正题，崔灏同学总结了过去一年的社团情况。比如举办了Linux Install Party，白帽子大赛，服务器遭受大规模攻击等等。然后由本届CTO高一凡同学总结了技术工作。在这一年中用捐赠获得的6台服务器中的4台搭建了Vmware vSphere集群并把许多服务(gitlab, mail, vpn, 防污染dns等)迁移到它上面，还有对一些服务进行了docker化(典型的是gitlab和lug ftp)。此外，仍有一些项目处于开发缓慢或停滞状态如vpn、统一认证、freeshell。   下一项内容，由崔灏同学介绍了今年的候选人政策。本年度社团换届要求社团换届先上报候选人名单，由管指委组织培训和考试，合格通过方能成为社团负责人。本社团共上报三名候选人但最终通过的只有崔天一一人。   为选举做准备，到场的每位同学都做了自我介绍，除了让大家进一步熟悉一下之外，还要交代个人愿意在下一学年中为社团做些什么，承担什么样的任务。每个人自我介绍完了之后现任会长还根据平时的接触补充了一些评价。            会议最后一项，进行选举，今年的选举形式有些变化，虽然只有一位候选人通过了管指委的考试，但并不能只指定一人作为负责人。所以这一次到场的每个人都是候选人。大家根据之前其他人的自我介绍对心目中下一任LUG负责人进行匿名投票。最后根据唱票结果，包括唯一被管指委方面承认的会长崔天一在内，会议共选出了4位负责人，分别是左格非、崔天一、曾键、郑子涵。之后当选的4位负责人分别发表了当选感言。按照惯例还应确定下一届的各种officer人选，经自我举荐和大家讨论确定了CTO由曾键担任、CFO由金孜达担任、CIO由崔天一担任。               与会人员包括杨博远、曾键、张光宇、李嘉豪、王子博、崔灏、郑子涵、左格非、朱沛俊、王子浩、崔天一、赵彦冰、张静宁、张振兴、徐弈、于天泽、高一凡、卢星、金孜达、张荣葳、何旭东、赵驰。以上名单来自会议签到。   其中张荣葳同学既是老会长又代表本届社团管指委员会分管委员参加。   会议记录感谢杨博远。   本次会议照片上传至 LUG FTP “会议”文件夹中。  ","categories": ["LUG会议"],
"tags": ["USTC_LUG","换届","崔灏","左格非","曾键","郑子涵","金孜达"],
"url": "https://lug.ustc.edu.cn//news/2016/05/2016-lug-election/",
"teaser": null
},{
"title": "西区图书馆新活动室启用",
"excerpt":"2016年6月16日，LUG西区新活动室启用，并成为今后唯一的社团活动室。一部分LUG成员在当日早上从东区图书馆605老活动室与东图一楼将大部分活动材料与各类物品搬迁到了西区活动室。      新的西区活动室仍然由图书馆提供，位于西区图书馆206室。具体地点在西区图书馆主楼二楼西北角，十分接近原308活动室。   16日早上，东区的同学们使用三轮车数次来回才将东区的活动物品与书库书籍搬到了西区。      同学们从早上工作至中午，将活动室打扫干净并对书籍进行上架、配置活动室有线和无线网络。到16日下午，活动室已经能正式投入使用。      历史上，LUG的活动室长期位于西区图书馆308室；前两年的数次搬迁均是西区图书馆的大规模重新装修计划的结果。经过数次辗转之后，LUG活动室重新回到了西区，在可以预期的将来，西区新活动室定能为LUG的活动提供更好的便利条件。   原东区活动室将于近日被收回。本次活动的原始照片存储在LUG FTP上。  ","categories": ["LUG活动"],
"tags": ["LUG","USTC_LUG","news"],
"url": "https://lug.ustc.edu.cn//news/2016/06/new-activity-room-in-west-library/",
"teaser": null
},{
"title": "2016软件自由日中国科大站",
"excerpt":"2016年9月15日下午，2016年软件自由日（SFD）中国科大站活动在西活学术报告厅成功举办。当天下午，虽然天公不作美，大雨倾盆，又适逢中秋佳节，仍有70余位同学冒雨赶来参加我们的活动，现场气氛热烈，效果良好。         本次活动我们有幸邀请到了来自Canonical的李彬工程师为我们介绍《Ubuntu和Gnome的桌面环境》，Linux用户协会执行会长左格非同学为大家介绍了《开源通信软件协议》和《出国网络加速服务的实现》，深受在场同学的欢迎。   不到2:30分，同学们便冒着大雨赶到会场，在场工作人员为大家准备了各类开源软件纪念品供大家自行领取，此外，活动当天还为大家提供了月饼，在场的同学们共度中秋佳节。   2:30分，活动正式开始，左格非同学首先登场作题为《开源通信软件的加密》的介绍。左格非同学先介绍了Telegram软件及其安全、非商业化等特点。接着，左格非分别介绍Telegram在正常通信和私密通信时所使用的协议。从非对称密钥谈起，逐步深入，提到消息的识别，防止重放攻击等内容。在场同学认真倾听。接着，左格非介绍了GPG的基本原理，同时为大家介绍了LUG提供的新服务——GPG Key Server。接下来，同学们踊跃提问，现场氛围十分热烈。      在5分钟的茶歇后，由Canonical的李彬工程师为大家介绍《Ubuntu和Gnome的桌面环境》。李彬工程师从一张涵盖多个开源软件LOGO的图开始，娓娓道来桌面环境的历史与未来发展。接着，李彬现场演示了在Gnome环境下开发插件的方法。最后，演讲在热烈的掌声中结束。      5分钟的茶歇时间，大家围在李彬工程师身旁，争相试用Ubuntu手机和平板电脑。座位被围得水泄不通。      下一场报告是左格非同学为大家介绍“出国网络加速服务的实现”。左格非同学从最普通的socks代理开始，逐步深入，介绍了GRE隧道，kcp tunnel等最新技术。接着，左格非同学介绍了用户访问控制的实现——Freeradius，其提供了认证、授权、计费的功能。然后，左格非介绍了多种用户接入VPN技术——PPTP, L2TP/IPSEC, OpenVPN, IKEv2，并比较了他们之间的优劣。最后，左格非介绍了LUG VPN服务的申请和管理办法。   活动结束后，部分Linux用户协会成员自发的组织了中秋晚宴活动，和嘉宾一起共度中秋佳节。   本次活动参与者同往年相比较少，主要由于时间选择不当。中秋节许多同学有其它安排，时间冲突，以后再选时间要把类似的因素考虑进去。这三场演讲有深有浅，取材于大家经常使用的软件，能吸引大家的兴趣。另外活动的纪念品发放了不少，宣传Ubuntu，Fedora，Deepin的效果也不错。   感谢以下单位对本次活动的大力支持：      Canonical提供了笔记本、马克杯、贴纸等纪念品   Fedora中文社区提供了Linux体验光盘，徽章，贴纸   深度科技提供了手提袋、贴纸、安装光盘和U盘  ","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2016/09/2016-sfd-ustc/",
"teaser": null
},{
"title": "LUG带同学们走进神秘的网络中心机房",
"excerpt":"2016年10月23日上午，校学生Linux用户协会组织协会的同学们参观了校网络中心和超算中心。23日9点整，就有40人等待在东区第五教学楼门口等待出发。      本次活动由协会的负责人带队，兵分两路，交叉参观。一路先行参观网络中心，接着与另一路交换，参观超算中心。   校网络信息中心坐落于第五教学楼东北角，一座紧邻着居民区的低调的小楼里。刚带领同学们走进网络中心的楼，就遇见了为我们介绍，带领我们参观的热情的张焕杰老师。   同学们呈扇形围绕在张老师身边，张老师亲切的为我们讲解了网络中心的职能，网络中心所进行的信息化建设，校园网的结构，以及对技术进行了探讨。         接着，张老师打开网络中心服务器机房的大门，同学们蜂拥而入，进入网络中心。张老师介绍说，学校的核心交换机就是下面这个CISCO设备      接着，张老师爆出惊人内幕“学校十多个G的出口流量全是从四台服务器上流过的，其中一台自07年以来就没有down过。”围绕在张老师身旁，张老师为我们详细介绍了机房的布置结构，其供电，网络等设施。接着，张老师与我们详细探讨了网络通的实现方法，以及西区频繁断网的原因——供电不足、电三楼空调设备老旧和其解决方法。      参观完网络中心，就和另一路同学互换，步行进入一个就在学霸们脚下但不惹人注目的地方——东区图书馆一楼参观超算中心。   超算中心李会民副主任早就等待在超算中心的门口等待着一行人的到来。刚一到，李老师便热情的给我们介绍起了超算中心的职能、超算中心机房的结构等内容，同学们认真听讲解。      接着，李老师为我们现场演示了服务器的维修，同学们亲自上阵，“友好“的练习了对服务器风扇、CPU等部件的更换。      最重要的当然是走进机房了，在李老师的带领下，同学们走入机房对超算机群进行了参观。      最后，由衷的感谢张焕杰老师和李会民老师带领我们参观网络中心和超算中心。  ","categories": ["LUG活动"],
"tags": ["LUG","USTC_LUG","网络中心","超算中心","服务器","网络通","李会民","张焕杰"],
"url": "https://lug.ustc.edu.cn//news/2016/10/visiting_network_center/",
"teaser": null
},{
"title": "2017 Linux 板版衫设计方案征集",
"excerpt":"又是一年毕业季～ Linux 板 &amp; USTC LUG 版衫企划启动啦！   跟往年一样，首先征集设计方案。5月底将通过投票选出最受欢迎的设计方案，并启动预订。6月份毕业生离校前完成版衫制作和发放。   设计要求      主题：Linux 与自由软件，体现瀚海星云 Linux 板或 USTC LUG 特色   底色：不限，建议至少包含白色、灰色设计方案   图案：正面或双面图案（可设袖标），提交图案分辨率不低于 300DPI，并附简单效果图说明图案位置。   授权：投稿作品默认以 CC BY-SA 4.0 协议发布。如果选择其他授权，则应确保作品可以在 CC BY-SA 协议下再发布。   可以参考一下往年的版衫设计方案。   投稿方式      方式１：回复瀚海星云 BBS 的征集贴，以附件形式附上设计图   方式２：发邮件至 lug@ustc.edu.cn，标题「2017 版衫设计方案投稿」   方案选择   若方案多于1种，则通过投票来选出最终方案。投票将在方案征集后一周进行。   奖励      被选中方案的设计者可免费获得两件 2017 Linux 板版衫。   得票前6名的其他未选中方案，设计者可免费获得一件 2017 Linux 板版衫。   征集时间   即日起至北京时间 5月14日（周日）23:59:59。  ","categories": ["LUG活动"],
"tags": ["LUG","版衫"],
"url": "https://lug.ustc.edu.cn//news/2017/05/2017-bbs-linux-banshan/",
"teaser": null
},{
"title": "2017 Linux 板版衫候选方案公布与投票",
"excerpt":"2017年Linux板版衫设计方案出炉啦！经过一周的征集，本次共获得了两份投稿的设计方案，将通过投票决定最终制作的版衫样式。   BBS 投票页面联动：点我前往   候选方案展示   版衫候选设计方案详细图片请见LUG FTP 页面（https://ftp.lug.ustc.edu.cn/%E7%89%88%E8%A1%AB/2017banshan/voting/）。   方案一：Kernel Panic                     方案二：Simple and Stupid      背面样式与方案一相同。     投票参与方式      填写问卷星问卷进行投票：http://tp.sojump.cn/jq/14217611.aspx；   在瀚海星云BBS上回复帖子进行投票；   两个途径将会合并计票，请勿重复投票。   投票截止时间：2017年5月25日23时59分（北京时间）     常见问题   颜色选择？   当年设计（方案一、方案二）暂定白、蓝、黑。往年版衫复刻需要根据具体设计重新配定颜色。   订购开始日期？   投票结束后会开始着手联系厂家制作并搜集订购信息。   版衫何时能到手？   应当在7月之前，我们会争取在毕业生离校前完成。   我不是科大学生/教工，可否投票？   只要您有购买的意愿，可以的。   我不在合肥，版衫国内快递订购是否可能？   有可能，可能性较大。   我不在境内，版衫跨境订购是否可能？   有可能，可能性较小。   定价？   与具体生产厂家相关，但一般不会超过50元/件。  ","categories": ["LUG活动"],
"tags": ["LUG","版衫"],
"url": "https://lug.ustc.edu.cn//news/2017/05/2017-bbs-linux-banshan-voting/",
"teaser": null
},{
"title": "2017 Linux 板版衫投票结果公示",
"excerpt":"经统计，2017年版衫投票结果如下：                  方案名       问卷票数       BBS票数       合计                       方案一       48       4       52                 方案二       34       0       34                 2010年重制       13       7       20                 2015年重制       5       1       6                 2012年重制       3       0       3                 2011年重制       4       0       4                 2008年重制       0       0       0                 2007年重制       2       0       2                 总计       109       12       121           根据以上情况，今年将按照方案一进行制作。具体预订登记方法将稍后发布。  ","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2017/05/2017-bbs-linux-banshan-voteresult/",
"teaser": null
},{
"title": "2017 Linux 板版衫预订开始！",
"excerpt":"经过紧张的投票，我们决定使用方案１作为今年版衫。   BBS相同文章联动：点我   预订方法   即日起，我们将开始版衫预订工作，为版衫制作筹集足够的资金。   科大的同学预计6月18日前可以收到货。校外同学请准确填写快递地址。   定价   版衫定价：50元（一口价）   自提不收运费，快递运费到付   截止日期   截止日期：2017-6-6 23:59   预订方法      转账到支付宝帐号 crtmike (At) hotmail.com 姓名：马凯；头像为浑天仪。建议备注姓名+手机号以便追溯！   填写表单 https://t.cn/RSfG5md 如果购买多件烦请分别多次填写！   预订说明      目前暂定在T社（tshe.com）制作版衫。底衫如无意外会在 https://www.tshe.com/styles/2 和 https://www.tshe.com/styles/4 两款底衫中选择一种。我们会选择单件50元以内最好的棉质底衫制作版衫；   出于成本考虑，每种颜色订单数大于10件才会制作；   如订单无效或未制作，转账将在6月20日前原路返还；   如单件价格低于50元，结余资金将作为 USTC LUG 社团经费，公开使用情况。   如果有其他问题，请咨询：   LUG 邮箱： lug (at) ustc.edu.cn   负责人QQ： 515166698   设计图展示                    ","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2017/06/2017-linux-banshan-preorder-start/",
"teaser": null
},{
"title": "LUG LOGO 征集活动",
"excerpt":"中国科学技术大学校学生 Linux 用户协会（简称 LUG）拟更换社团 LOGO，现采用征集活动的形式向全校师生，校友及所有开源社区的朋友征集 LOGO 设计方案，欢迎大家积极参与！ 设计理念 LOGO 对于 LUG 的校内和校外形象有着重要的作用，它将用于以下用途： 网站图标； 帐号头像； 宣传海报； 幻灯片； 版衫和其他周边； 对外合作 等。 LUG 作为包容开放的技术类社团，设计作品可以参考以下方面（不要求全部满足）： 体现自由软件精神； 契合自由软件社区氛围； 具有时代感和较强的艺术表现力； 表现 LUG 的社团风格、特色、历史积淀。 LOGO 要求简明，清晰，辨识度高，设计方案不得侵犯他人著作权。 提交内容 参加征集的作品可以是 PNG，JPG 等位图格式，也可以是矢量图格式或 PSD 等格式。也可以是简笔画，表现自己的创意即可。作品提交时还应附上对作品的设计解释。 注意：经评选后，最终选定的一等奖作品要求能够提供成品矢量图或者 PSD 文件，包括透明背景，深色背景，以及浅色背景三个版本，并至少有一个与 USTCLUG 文字搭配使用的示例，但成品的制作可以在征集活动结束后完成。 奖励办法 一等奖 1 名：数位板或移动硬盘（二选一或选择其他等值奖品），和印有新 LOGO 的一系列定制周边（版衫，水杯，贴纸，鼠标垫，徽章，钥匙链）；设计作品作为 LUG 的 LOGO 使用，并在...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2018/05/lug-logo-collect/",
"teaser": null
},{
"title": "服务器宕机通知",
"excerpt":"2018-06-16 UPDATE3: 目前以下服务已经恢复正常： 主页 (wiki)：https://lug.ustc.edu.cn/ （已恢复） 代码托管平台：https://git.ustclug.org/ （已恢复，建议用户切换新地址：git.lug.ustc.edu.cn） LUG FTP：https://ftp.lug.ustc.edu.cn/ （已恢复） 反向代理：*.proxy.ustclug.org （已恢复） 如果您使用上述服务时遇到问题，请向我们反馈。 2018-06-15 UPDATE2: 目前以下服务已经恢复正常： 主页 (wiki)：https://lug.ustc.edu.cn/ （已恢复） 代码托管平台：https://git.ustclug.org/ （已恢复，建议用户切换新地址：git.lug.ustc.edu.cn） LUG FTP：https://ftp.lug.ustc.edu.cn/ （已恢复） 由于网络架构的变化，部分服务需要您的 DNS 缓存过期后得到新的解析结果才能生效，这依赖于您的网络环境，您也可以尝试手动刷新缓存。维护期间服务的稳定性有下降，这是正常现象，如果您在使用中持续遇到问题，请联系我们。 从数据备份中恢复数据并没有计划中的这么一帆风顺，我们仍在努力恢复受影响的各项服务，接下来的工作计划是按照以下顺序继续恢复服务： 反向代理：*.proxy.ustclug.org 网络加速服务：vpn.ustclug.org VPN 在线申请系统：https://getvpn.ustclug.org/ 轻量级网络加速服务：https://light.ustclug.org/ 给您带来的不便敬请谅解。 2018-06-14 UPDATE1: 初步的调查结果显示，此次宕机事件原因是虚拟机宿主机 3 号节点上的一块年代久远的硬盘因为老化或其他原因出现问题，导致该节点上运行的虚拟机全部宕机，并且导致该节点也无法被虚拟机集群控制，其上运行的虚拟机亦无法直接的迁移。 目前的修复方案是从我们的数据备份中恢复重要的服务到没有受影响的节点上重新运行，恢复备份和重建原有的网络环境还需要一段时间，给您带来的不便敬请谅解。 今天早些时候（2018-06-14 00:40 左右），由于我们的虚拟机宿主机 3 号节点的某些问题，LUG 内网包括网关与统一认证在内的部分关键服务器宕机，进而导致一部分服务不能正常提供，我们已经知悉并且开始处理这些问题。 以下服务因为此事件暂时不能正常运行，正在抢修中： 代码托管平台：https://git.ustclug.org/ （已恢复）...","categories": ["LUG服务器"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2018/06/server-down/",
"teaser": null
},{
"title": "2018 秋季学期新生活力课程",
"excerpt":"2018 年 8 月 25 号（星期六）晚，中国科学技术大学学生 Linux 用户协会（简称“协会”）在我校西校区 3A306 教室开展了本学期第一次新生活力课程，约 100 名同学参与了本次活动。   协会的本次新生活力课程主要面向面向才入学的大一新生，以“让大学生活效率腾飞：常用网络资源介绍”和“Linux：你所知道的与不知道的 ”为主题。前者主要介绍中科大校内的实用网络资源和一些校外的一些免费或付费资源，以帮助新生尽快提高学习效率, 享受网络带来的便捷，后者通过对 Linux 和一些优秀桌面应用的介绍，为大家揭下 Linux 的神秘面纱，让大家看到一个更有趣的 Linux。      第一部分由社团 COO 任正行同学主讲。课程中介绍的网络资源将包括校内上网途径，学校购买的 Windows / Linux / macOS 下的各种正版软件，图书馆资源，论文数据库等;还有自助打印，GitLab，一卡通系统，中国最大的开源软件镜像站等服务。         中场休息时协会 CEO 何纪言解答大家的问题，并且简单介绍了我们协会的主题，日常活动，维护的服务，交流方式等。      第二部分是协会 VP 李文睿同学主讲。讲解了 Linux 是一套开源，自由，强大，有趣的操作系统，1991 年由芬兰大学生 Linus 开发，由于其开源的特性，任何人都可以对其作出贡献。Linux 出现近 30 年，现在早已广泛应用在各个领域。      台下的同学们认真的听讲，不时提出问题与主讲人互动。期间协会副会长马凯同学还解答了大家关于邮件列表的问题，协会副会长曾明亮还为大家解答了电脑选购的部分疑问。      本次活动我们还为新生同学们提供了自助饮料和纸杯。   活动结束后大家主动清理了教室并带走垃圾，本次新生活力课程圆满结束，感谢校团委，校学生社团管理指导委员会和计算机科学与技术学院团委的支持！   活动照片和讲稿：LUG FTP  ","categories": ["活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2018/08/freshman-course/",
"teaser": null
},{
"title": "LUG LOGO 征集结果",
"excerpt":"感谢同学们和开源社区的朋友们对我们 LOGO 征集活动的支持！     经过一段时间的征集和评选，我们得到了如下 LOGO 征集活动的结果：             一等奖 : Archlinuxcn 成员张盛宇            二等奖 : 崔灏，严鲸鲸            三等奖 : 薛瑞，蔡文韬，王若晖，王瑞，鲁吴越       在选出一等奖后，我们与获得一等奖的张盛宇先生进行了一系列关于 LOGO 细节修正的讨论，最后决定出了我们的 LOGO：                                                原版       带文字           LOGO 下载地址：logo.zip   根据我们的奖励办法，获得上述奖项的同学将获得印有新 LOGO 的定制周边等奖品，新 LOGO 已经选出，周边等奖品正在制作中，请获得奖品的同学耐心等待，奖品制作出之后我们会联系大家。  ","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2018/09/lug-logo-collect-result/",
"teaser": null
},{
"title": "2018 软件自由日中国科大站",
"excerpt":"2018 年 9 月 15 日下午，2018 年软件自由日（SFD）中国科大站活动在西校区 3C103 教室成功举办。 本次活动我们有幸邀请到了来自 Linux foundation 的 Xu DiXing 和中国科学技术大学网络信息中心的张焕杰老师。Xu DiXing 为我们介绍了《A Hands-On Tutorial on using fabric-sdk-py and writing your first dapp with fabric》，张老师也做了《科大网络原理和 IPV6 介绍》，Linux用户协会副会长马凯同学为大家介绍了《我已阅读并同意：软件许可证简介》，深受在场同学的欢迎。 不到2:30分，同学们便陆续赶到会场，在场工作人员为大家准备了 LUG 徽章等一些纪念品供大家自行领取。 2:30 分，活动正式开始，LUG CEO 何纪言同学先介绍了今年软件自由日的日程安排，赞助本次软件自由日的组织和闪电演讲的报名等。之后由中国科学技术大学网络信息中心的张焕杰老师给我们带来《科大网络原理和 IPV6 介绍》的讲座。张老师的讲座分中国科大校园网络简介，安徽省教育科研网简介，及校园网 IPV6 应用于管理三部分。在讲座中张老师还提及，校园网是没有防火墙的，但通过 IP 黑名单系统等措施使得校园网还是非常安全。由于讲座有很多相关校园网的问题，讲座结束后，很多同学积极提问，张老师也相应地作出了回答。 张老师的演讲结束后，由 Linux foundation 的 Xu...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2018/09/2018-sfd-ustc/",
"teaser": null
},{
"title": "中国科学技术大学第五届信息安全大赛圆满结束",
"excerpt":"2018年10月16日中午，随着分针滴答滴答地与时针在12点处重合，网站提交答案的窗口关闭，也宣布着第五届信息安全大赛落下帷幕。   本次比赛中，共有4000多人次线上报名参赛，2600多人至少完成了一道题，参与人员涵盖校内外，分别来自于清华大学、北京大学、中国科学院大学等91所国内高校，以及几所海外高校。其中来自清华大学的同学获得总榜的第一名，最终以6750分结束比赛，中国科学技术大本科生选手邓龙以总分4050分获得校内榜第一，总榜第十的好成绩。本次比赛校内参加人数众多，共计 424 名本科生参与，139 名研究生博士生参与。   经过赛后主办方的统计，最终确定了获奖名单，并为校内参赛的同学颁奖。2019 年 1 月 3 日晚，第五届信息安全大赛颁奖仪式在西区举行，校内冠军邓龙荣获一等奖，付佳伟、莫子铭、徐一凡、贺泉、杨荣琛五位选手获得二等奖，还有王若麟等二十五位选手获得三等奖。此外还专门设置了面向大一新生的新生特别奖两名，分别为高泽豫和林焕承，面向女生的 Ada 奖一名，获奖者为林元芃。           自2014年起，科大信息安全大赛已经连续举办了五届，往届比赛均顺利进行，规模盛大，影响甚广。第五届信息安全大赛由中国科学技术大学网络空间安全学院、中国科学技术大学校团委、中国科学技术大学管指委主办，中国科学技术大学学生 Linux 用户协会、中国科学技术大学微软学生俱乐部等承办，并由南京大学微软学生俱乐部、湖南大学微软学生俱乐部等协办。本次比赛相比之前规模更大，参与人员更多，并邀请了更多国内高校参赛，旨在给国内高校的同学们提供一个学习交流的平台。并延续了往届的优良传统，努力结合科大特色，坚持向新生倾斜的原则，控制题目难度梯度，强调引导和教育工作。   本次比赛的题目在具有一定教育意义的同时也不失趣味性。题目“猫咪问答”让参赛选手在做题的过程中了解了科大的一些建校历史和 60 周年校庆知识，也向外校的选手宣传了科大；而有趣的“黑曜石浏览器”一题更是在知乎引起了热议。   赛后承办方组织参赛选手于网上 https://github.com/ustclug/hackergame2018-writeups 撰写了题目解答，并可在 https://hack2018.lug.ustc.edu.cn/ 上继续查看题目和提交。  ","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2019/01/hackergame-awards/",
"teaser": null
},{
"title": "Linux 101 第一课暨 Linux 安装聚会成功举办",
"excerpt":"2019 年 3 月 10 日下午，由中国科大学生 Linux 用户协会承办的 Linux 101 第一课暨 Linux 安装聚会活动在西区 3C101 教室顺利举行。 在中国科大，同学们的学习和科研生活中都要广泛地接触 Linux 系统。Linux 101 是中科大 Linux 用户协会成员面向全校开设的长期课程，课程以应用角度出发，带领大家从零开始了解开源 Linux 系统并学会初步应用。Linux 安装聚会是多人集体安装 Linux 的线下活动，旨在由经验丰富的 Linux 用户帮助新手快速且“无痛”地完成 Linux 操作系统的安装。 下午 14:00，何纪言同学对同学们简单地介绍了 Linux 101 以及 Linux 用户协会，之后由李嘉豪同学作了“Linux 101 序–遇见 Linux”的演讲，也就是 Linux 101 第一课。在演讲中，李嘉豪同学介绍了什么是 Linux，它的发展历史，以及一些自由软件相关的知识，并进行了 WSL 和 Ubuntu 虚拟机的演示。 下午...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2019/03/linux-install-party/",
"teaser": null
},{
"title": "2019 Linux 板版衫设计方案征集",
"excerpt":"又是一年毕业季～ Linux 板 &amp; USTC LUG 版衫企划启动啦！ 跟往年一样，首先征集设计方案。4月底将通过投票选出最受欢迎的设计方案，并启动预订。6月份毕业生离校前完成版衫制作和发放。 设计要求 主题：Linux 与自由软件，体现瀚海星云 Linux 板或 USTC LUG 特色 底色：不限，建议至少包含白色、灰色设计方案 图案：正面或双面图案（可设袖标），提交图案分辨率不低于 300DPI，并附简单效果图说明图案位置。 授权：投稿作品默认以 CC BY-SA 4.0 协议发布。如果选择其他授权，则应确保作品可以在 CC BY-SA 协议下再发布。 可以参考一下往年的版衫设计方案。 投稿方式 方式１：回复瀚海星云 BBS 的征集贴，以附件形式附上设计图 方式２：发邮件至 lug@ustc.edu.cn，标题「2019 版衫设计方案投稿」 方案选择 若方案多于1种，则通过投票来选出最终方案。投票将在方案征集后一周进行。 奖励 被选中方案的设计者可免费获得两件 2019 Linux 板版衫。 得票前6名的其他未选中方案，设计者可免费获得一件 2019 Linux 板版衫。 征集时间 即日起至北京时间 4月28日（周日）23:59:59。 参考...","categories": ["LUG活动"],
"tags": ["LUG","版衫"],
"url": "https://lug.ustc.edu.cn//news/2019/04/2019-bbs-linux-banshan/",
"teaser": null
},{
"title": "2019 Linux 版衫预订开始",
"excerpt":"经过版衫方案投票结果（2019 Linux 板版衫候选方案公布与投票），我们最终确定了 2019 Linux 版衫样式，并从即日起开始接受预定。 经过统计，包括微信公众号、BBS 等渠道所有投票中，方案二 Style 1 以 25.7% 的票数位居第一，恭喜设计者陈同学，也非常感谢其他投稿的同学。 我们与作者和供应商 T 社（tshe.com）沟通后决定制作黑色，白色，蓝色三种底色版本，效果图如下： 黑色版： 白色版： 蓝色版： （前印花宽 19.4cm，高 25cm，距离领口 8cm；后印花宽 15cm，高 10.9cm，离领口 8cm） 预定说明 版衫定价：50.00 元/件 付款方式：支付宝转账（详见预定表单） 预定截止时间：2019 年 6 月 21 日 23:59:59 (UTC+8) 注意事项： 在校同学可以在到货之后自提，时间不限（如：暑期和下学期）。不在校的同学请填写准确的邮寄地址，我们将在收到版衫后统一以快递到付寄出（预计 6 月 27 日，较晚预订的同学可能会晚些收到）； 预定和付款同时进行，请在填写表单后尽快完成支付宝转账，备注信息填写预定者手机号； 如订单无效或未制作，付款将全额原路返还； 如需预定不同尺码，请多次填写表单； 出于成本考虑，每种颜色订单数大于 10 件才会制作；...","categories": ["LUG活动"],
"tags": ["LUG","版衫"],
"url": "https://lug.ustc.edu.cn//news/2019/06/2019-bbs-linux-banshan-preorder-start/",
"teaser": null
},{
"title": "2019 秋季学期新生活力课程",
"excerpt":"2019 年 8 月 31 日与 9 月 7 日，USTCLUG 在西校区的 3A110 教室开展了本学期的新生活力课程。 新生活力课程面向入学不久的大一新生。第一次新生活力课程以 Linux 为主题，上半场是由李文睿同学主讲的《Hello, Linux》，他从 Linux 的发行版、日常使用以及命令行等方面对 Linux 操作系统进行简单介绍，希望能够让同学们通过本次讲座了解 Linux；下半场是龚平同学的《Why learn Linux?》讲座，他从现今 Linux 应用情况，结合科大同学未来的学校生活和工作情况，介绍 Linux 系统的重要地位以及学习 Linux 的趣味性，希望能够激发同学们学习 Linux 的乐趣。 考虑到大部分科大新生都还没接触过 Linux 系统，我们专门将一台笔记本安装了 Linux 系统，带去课堂，给大家实机展示，并鼓励大家上手操作。讲座结束的提问环节，大家非常积极踊跃，提出了一系列不仅仅关于 Linux 还有将来四年的学习生活的问题。讲座结束，还有许多同学意犹未尽，希望可以进一步了解什么是 Linux，什么的是自由软件精神，并且希望能稍微了解 Linux 用户协会，我们就带他们去参观 Linux 用户协会的活动室。在活动室中，我们详细回答了关于 Linux 的种种问题。有一位对 Linux 特别感兴趣的同学从现场借走一本关于 Linux 的书籍。直到晚上...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2019/09/2019-freshman-course/",
"teaser": null
},{
"title": "2019 软件自由日中国科大站",
"excerpt":"2019 年 9 月 21 日下午，2019 年软件自由日（SFD）中国科大站活动在西区 3C102 教室顺利举办。 本次活动我们邀请到了校友沈达以及王子博同学和刘紫檀同学为我们带来了精彩的演讲。其中沈达为我们介绍了《GNU TeXmacs: A Free Scientific Editing Platform》，王子博为我们介绍了《开源密码管理器 KeePass》，刘紫檀为我们介绍了《从 Makefile 到 Conan：手把手教你构建 C/C++ 项目》。 在活动开始前同学们陆续到达会场。LUG 为大家提供了一些徽章、贴纸等纪念品以及食物，供大家自行领取。 下午 2:30 活动正式开始。首先是由 LUG 的执行会长陶柯宇同学为大家介绍软件自由日、USTCLUG、本场软件自由日的日程安排，以及闪电演讲等事项。 在简短的介绍后就是校友沈达为大家带来《GNU TeXmacs: A Free Scientific Editing Platform》。TeXmacs 是一个为编写优雅美观的科技类文档而制作的编辑器，有 TeX 和 Emacs 的特点。沈达向大家介绍了 TeXmacs 的一些特性，例如方便的快捷键、导入导出 TeX 格式、调用其他数学计算程序的计算结果、使用 kbd-map 自定义宏等，并且介绍了 TeXmacs 的未来规划，以及他为改进 TeXmacs...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2019/09/2019-sfd-ustc/",
"teaser": null
},{
"title": "中国科学技术大学第六届信息安全大赛圆满结束",
"excerpt":"2019 年 10 月 22 日中午 12:00，网站提交答案的窗口关闭，也宣布着第六届信息安全大赛落下帷幕。 经统计，在本次比赛中，总共有 2682 人注册，1904 人至少完成了一题。比赛期间所有人合计提交了 17098 次 flag，其中约 57.44% 为正确的提交。本次比赛由吉林大学、南开大学、北京邮电大学、重庆大学、哈尔滨工业大学和东北大学的计算机技术类及信息安全类的社团协办，此外还有来自其他高校的同学参加比赛。其中昵称为 Merg1n 的同学获得总榜的第一名，最终以 6400 分结束比赛；中国科学技术大学的本科生选手邓龙以总分 4200 分获得校内榜（不含已毕业同学）第一，总榜第 15 的好成绩。本次比赛校内参加人数众多，共计 395 人参与，其中有 297 名本科生。 经过赛后主办方的统计，最终确定了获奖名单，并为校内参赛的同学颁奖。2019 年 12 月 15 日晚，第六届信息安全大赛颁奖仪式在西区 3A112 举行，校内冠军邓龙荣获一等奖，胡航瑞、高泽豫、李永强、陈翊辉、汪若辰五位选手获得二等奖，还有陈泳融等二十五位选手获得三等奖。此外还专门设置了面向大一新生的新生特别奖两名，分别为陈泳融和谢亦秦，面向女生的 Ada 奖一名，获奖者为李静雯。此外，还颁发了一血奖和分类奖。 自 2014 年起，科大信息安全大赛已经连续举办了六届，往届比赛均顺利进行，规模盛大，影响甚广。第六届信息安全大赛由中国科学技术大学网络空间安全学院、中国科学技术大学校团委、中国科学技术大学管指委主办，中国科学技术大学学生 Linux 用户协会、中国科学技术大学微软学生俱乐部、中国科学技术大学 NEBULA 战队等承办，并由南开大学创新技术俱乐部、北京邮电大学微软学生俱乐部等协办。本次比赛延续了往届的优良传统，努力结合科大特色，坚持向新生倾斜的原则，控制题目难度梯度，强调引导和教育工作。 本次比赛的题目分为 4 类，包含了综合技能、程序逆向与漏洞利用、密码学与数学和网站安全类题目，在具有一定教育意义的同时也不失趣味性。例如，“宇宙终极问题”一题的第一小题与 9 月份科学家得到的丢番图方程...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2019/12/hackergame-2019/",
"teaser": null
},{
"title": "服务器宕机通知（已恢复）",
"excerpt":"2020-01-07 Update 3 代码托管平台 https://git.lug.ustc.edu.cn/ 已恢复正常。 2020-01-07 Update 2 以下服务目前仍有问题，正在抢修中： 代码托管平台：https://git.lug.ustc.edu.cn/ 目前正常的服务： 主页 (wiki)：https://lug.ustc.edu.cn/ LUG FTP：https://ftp.lug.ustc.edu.cn/ 反向代理：*.proxy.ustclug.org 网络加速服务：vpn.ustclug.org VPN 在线申请系统：https://getvpn.ustclug.org/ 轻量级网络加速服务：https://light.ustclug.org/ 服务器统一认证：ldap.ustclug.org 内网 VPN Ganglia 监控：https://status.ustclug.org/ LDAP 配置管理系统（GOSA2） 开源镜像站（HTTP 访问）：https://mirrors.ustc.edu.cn/ 开源镜像站（定时同步；rsync、FTP 访问；帮助页面）：https://mirrors.ustc.edu.cn/ 权威 DNS：ns-a.ustclug.org. ns-b.ustclug.org. ns-c.ustclug.org. 网络启动：pxe.ustc.edu.cn 图书馆透明计算系统 如果您使用上述服务时遇到问题，请向我们反馈。 2020-01-07 Update 1 目前，科大校园网络已经恢复正常，故障原因可见 http://bbs.ustc.edu.cn/cgi/bbstcon?board=USTCnet&amp;file=M.1578332007.A。 我们正在确认目前受到影响的服务范围。 由于科大校园网络的未知故障，LUG 的所有网络服务现在处于不稳定状态。受影响服务的恢复时间暂时无法确定，给您带来的不便敬请谅解！ USTCLUG 2020-01-06 23:34:34...","categories": ["LUG服务器"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2020/01/server-down/",
"teaser": null
},{
"title": "Linux 101 第一课在线上顺利举行",
"excerpt":"2020 年 3 月 15 日下午，由中国科大学生 Linux 用户协会承办的 Linux 101 第一课在线上顺利举行。 在中国科大，同学们的学习和科研生活中都要广泛地接触 Linux 系统。Linux 101 是中科大学生 Linux 用户协会成员面向全校开设的长期课程，课程以应用角度出发，带领大家从零开始了解开源 Linux 系统并学会初步应用。 受到疫情的影响，我们不得不在线上举行活动，并且暂停了往年会与 Linux 101 第一课一同开展的 Linux 安装聚会活动。并且，此次是我们第一次完全在线上举行活动。 在寒假期间，我们组织同学编写了活动系列讲义，存放于 https://101.lug.ustc.edu.cn/ 上。为了解决同学们学习 Linux 的配置环境问题，考虑到无法现场帮助同学们安装系统，在活动开始前，我们打包了一些 Linux 虚拟机镜像，在安装虚拟机软件之后就「开箱即用」。 下午 2:30，活动准时开始。金孜达同学开始向同学们介绍 UNIX 与 Linux 的发展历史，各个 Linux 发行版的基本区别，以及一些自由软件相关的知识，最后向同学们简单地介绍了学生 Linux 用户协会。在直播期间，活动直播间的「最高人气值」高达 3569，不仅有社团内的同学参加，也有很多社团外甚至校外感兴趣的同学过来参加。 在下午 3:55 时，活动正式结束。今后的 Linux 101 课程将会更加深入地介绍...","categories": ["LUG 活动"],
"tags": ["Linux 101"],
"url": "https://lug.ustc.edu.cn//news/2020/03/linux101-online/",
"teaser": null
},{
"title": "「开源软件供应链点亮计划——暑期 2020」USTCLUG 项目提案",
"excerpt":"「开源软件供应链点亮计划」是由中国科学院软件研究所发起并长期支持一项活动，旨在解决基础开源软件面临的许可、质量、维护和技术支持等问题，进而影响整个软件产业的供应链。而「开源软件供应链点亮计划——暑期2020」是由中科院软件所与 openEuler 社区共同举办的一项面向高校学生的暑期活动，旨在鼓励在校学生积极参与开源软件的开发维护，促进国内优秀开源软件社区的蓬勃发展。 此活动与 GSoC (Google Summer of Code) 的模式类似：开源项目/社区提供项目需求与导师 (mentor)；学生申请项目通过后利用暑期的时间进行开发，将成果贡献给社区；主办方（中科院软件所与 openEuler 社区）根据评估结果给学生发放奖金。所有参与的社区列表可查看 https://isrc.iscas.ac.cn/summer2020/#/organisations。 今年夏天，USTCLUG (中科大学生 Linux 用户协会) 计划以社区身份加入此暑期活动。以下是我们计划的项目提案，也欢迎社团的各位同学提出建议。 本提案参考了清华大学 TUNA 协会（清华大学学生网络与开源软件协会）的项目提案，在此表示感谢。 在报名前，请先阅读由主办方提供的学生指南。 科大镜像站前端架构改进 项目描述：目前，科大镜像站的前端架构仍然沿用着 2013 年的设计，但是随着时间的发展，我们也发现目前的镜像站前端架构在用户体验、维护与部署上带来了一些不便。目前的镜像站主页是由一套 Python 脚本每小时从模板生成得到的，虽然足够使用，但是在维护中也遇到了一些问题，诸如界面设计的实用性、主页与 status 页面显示不一致等问题。本项目希望能够通过调整镜像站前端架构，提高用户体验，降低维护的复杂度，也方便其他需要的镜像站部署页面显示的解决方案。 项目难度：低 项目社区导师：付佳伟 导师联系方式：ibug@ustclug.org 合作导师联系方式：陶柯宇 taoky@ustclug.org 项目产出要求：以下要求不需要全部达到，选择感兴趣的方向即可 调整页面结构，与 Nginx FancyIndex 结合，提供美观的文件列表页面 改进页面功能，提供准确的仓库最近更新时间（可以参考 status 页面） 为了得到准确的更新时间，需要能够与多种同步后端结合，包括科大镜像站目前使用的镜像同步工具 Yuki，以及传统的 crontab + 同步脚本的方式 与帮助页面更好的结合，例如...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2020/05/opensource-summer-projects/",
"teaser": null
},{
"title": "近期部分服务中断通知（已修复）",
"excerpt":"2020-06-05 10:27 Update 5 ESXi 主机所在网段网络不稳定的原因已经查明，与网段内 ARP 包相关。目前已经修复。 此外，反向代理于 2 日进行了一些调整，详情见 https://github.com/ustclug/discussions/issues/325#issuecomment-637319675。 2020-05-31 22:45 Update 4 间歇性的网络问题仍然存在，我们将继续排查问题。 2020-05-31 14:09 Update 3 在校园网路由清空了内部转发表后，目前 ESXi 主机已经运行 7 小时而未出现网络问题。我们仍在监测问题是否已经解决。 2020-05-30 16:15 Update 2 我们注意到 ESXi 主机再次出现了间歇性的网络问题。包括 git.lug.ustc.edu.cn 在内的服务受到影响。我们正在尝试排查问题。 2020-05-26 23:10 Update 1 git.lug.ustc.edu.cn 目前已经恢复。 近期 USTCLUG 的一部分网络服务出现中断，具体情况如下： *.proxy.ustclug.org（开源软件反向代理）与 servers.ustclug.org（服务器新闻站）的校外访问，24 日晚由于服务器月流量超额而暂停，具体情况见 https://github.com/ustclug/discussions/issues/325。在 6 月份服务恢复后，我们将对反代服务进行调整。...","categories": ["LUG服务器"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2020/05/servers-down/",
"teaser": null
},{
"title": "新网站上线啦",
"excerpt":"经过多位成员连续多日的努力，Linux 用户协会的网站焕然一新。现在你所看到的页面正是我们新网站上线后的第一篇新闻。 新的网站采用 Jekyll 静态网站方案，基于 minimal-mistakes 修改的主题，并使用 GitHub Actions 自动构建，利用 webhook 通知服务器自动部署。 重新设计的网站架构带来了多方面的好处： 首先是更美观了：我们选用的主题既适用于首页等展示性页面，又适用于 wiki、文档、文章等内容性页面，同时还采用了响应式设计 (responsive design)，使得同一个页面在不同大小的屏幕上都能获得较好的显示效果 功能方面，我们终于将 wiki（即本网站）、news（社团新闻）和 planet（社团博客）合并到了一起，一定程度上解决了社团网站太多、内容过于分散、账号系统混乱的问题 基于 Git 的版本管理和协作更加方便：如同我们的旧新闻站，现在我们所有修改都有完整的历史记录，同时也能以 Pull Request 的形式接受投稿及修改建议 更易于维护及部署：纯静态的网站不需要维护数据库及 PHP 运行环境等，只需要一个能提供静态文件的服务器即可运行。我们采用了 OpenResty 作为 HTTP 服务器，在使用 Nginx 的同时还能通过 Lua 代码提供 webhook 相关功能 本网站的源码位于 ustclug/website，以 Creative Commons Attribution-NonCommercial-ShareAlike (BY-NC-SA) 4.0 协议开源。 原来的网站（wiki）已移动至 https://lug.ustc.edu.cn/oldwiki，旧新闻站仍保留在 https://news.ustclug.org/，其内容不再维护，留作存档。...","categories": ["LUG网站"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2020/08/new-website/",
"teaser": null
},{
"title": "2020 软件自由日中国科大站",
"excerpt":"2020 年 9 月 26 日，USTCLUG 在西校区 3C103 教室开展了本学期第一个大型活动：软件自由日（Software Freedom Day）。 本次活动我们邀请了来自中科院软件所 PLCT 实验室的李威威，以及校内的陈泳融和明宇龙同学，为我们带来了精彩的演讲。 李威威为我们介绍了他所在的程序语言与编译技术实验室在编译技术领域进行的开源贡献。陈泳融同学带领我们走近 Swift 语言，了解 Swift 作为开源项目的发展进程和发展模式以及如何参与 Swift 项目与社区建设。Linux 用户协会 CTO 明宇龙同学向我们介绍了最近十分热门的 Rust 语言，并带领我们一步一步地使用 Rust 语言写出我们自己的内核。 不到 7 点，同学们便陆续来到教室。LUG 为大家提供了一些关于 LUG 和开源/自由软件的徽章、贴纸等纪念品以及饮料和零食，供大家自行取用。 武汉深之度科技公司（Deepin）给 LUG SFD2020 提供了贴纸、钥匙扣等纪念品，在此表示感谢。 七点整，软件自由日活动开始。 首先是 Linux 用户协会会长袁一玮介绍了今年软件自由日的日程安排以及闪电演讲的报名等事宜，之后便正式开始了今天的自由软件日活动。 首先是来自 PLCT 的李威威，他首先介绍了程序语言与编译技术实验室的背景，讲述了实验室的主要工作与目标。其次，他介绍了他们实验室的 RISCV 轻量级模拟器 spike 和 QEMU...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2020/09/software-freedom-day/",
"teaser": null
},{
"title": "游戏安全与 Cheat Engine 核心指北",
"excerpt":"在 2020 年 10 月 17 日，USTCLUG 在西校区 3C102 教室开展了一次 Linux 用户协会小聚活动，邀请了李晨宇同学分享标题为《游戏安全与 Cheat Engine 核心指北》的演讲。   不到七点，就已经有较多的同学来到了教室，等待演讲的开始。在临近开始时，200 人的教室已接近满员。是 LUG 参与人数最多的活动之一。      在开始前，李晨宇同学重申了游戏逆向可能带来的法律风险，告诫同学们绝不可使用逆向工具从事非法的事情。我们固然是科技类社团，但是应当让科技在管控之下，方能使其发挥最大的效用。      之后，李晨宇同学便正式开始了今天的演讲。他介绍了今天的演讲所使用的软件 Cheat Engine，并介绍了 Lua 脚本语言。他的可移植性以及较高的性能，得到了大家的青睐，许多安全工程师都会使用 Lua。   同时，他也介绍了，作为一个 Hypervisor，它提供了对程序与内核之间隔离的方法，使得既是在调试过程中程序崩溃了，甚至导致虚拟出来的内核出错，也不会影响运行中的内核。保证了安全性。      在介绍完了理论知识之后，李晨宇同学使用 Cheat Engine 介绍了如何给 PvZ 这个热门的游戏制作外挂。使用 Lua 的脚本，我们能够实现代码注入，内存查找，代码劫持等功能，如此，我们可以实现包括且不限于向日葵无限产生阳光、秒杀、没有技能冷却的时间、加快时间等操作。虽然看起来这个游戏变得无趣了，但是我们通过游戏逆向的方法，我们掌握了基本的内存存储方法，代码执行等基础技能。      在最后，李晨宇同学带领我们完成了简单的上手实践，回答了同学们的一些问题，并且给同学们点出了相应的学习资料。   至此，本次小聚圆满结束。  ","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2020/10/ce-and-reverse/",
"teaser": null
},{
"title": "LUG 全员大会",
"excerpt":"在 2020 年 10 月 24 日星期六，USTCLUG 在西校区 3C102 教室召开了 LUG 全员大会，由 LUG 主要成员向新成员介绍 LUG 组织的各项精彩活动、维护的服务等信息。 七点整，LUG 全员大会正式开始。 首先，Linux 用户协会会长袁一玮简要介绍了 LUG 概况，包括 LUG 的建立、荣誉、组成以及 LUG 的目标，为新成员解答了“LUG 是什么”这一问题。 LUG 是一个以推广自由软件文化、宣传自由软件价值为目的的协会组织，为带给科大的 Linux 等技术爱好者一个交流学习的环境而努力。 接下来，由 Linux 用户协会 COO 罗丽薇介绍 LUG 所举办的丰富活动。 她先是回顾了刚举办不久的 SFD（软件自由日）和每周小聚，让新成员了解到 LUG 所举办的这类分享活动的形式和主题。 之后，她向新成员介绍了 LUG 即将举办的 Hackergame 活动，鼓励新成员在这一充满趣味性的比赛中学习并得到成长。 她还提到了 LUG 常有的参观网络信息中心活动以及每年举办的...","categories": ["LUG活动"],
"tags": [],
"url": "https://lug.ustc.edu.cn//news/2020/10/freshmen-meeting/",
"teaser": null
},{
"title": "Hello! LUG Planet",
"excerpt":"欢迎大家来到 LUG Planet！这是一个刚刚被发现的新星球，百废待兴。本文是 LUG Planet 的说明书，在你入驻之前，不妨先驻足欣赏一下这片风景。😀 LUG Planet 是什么？ LUG Planet 是…… 由 USTCLUG 负责运营和管理的群体博客。 目标读者与参与者： USTCLUG 会员； 认同 USTCLUG 理念的同好； 希望积极参加 USTCLUG 线上活动的朋友。 主要话题为 USTCLUG 社团的活动覆盖范围： UNIX、Linux 及自由/开源软件； Windows, Microsoft 新技术； 信息安全； 这些技术与 USTC 的碰撞与融合。 LUG Planet 是精神上的 Linux 文摘 计划的延续。我们认可这个群策群力式的知识汇集的理念，但使用更方便和更自由的形式，从而鼓励大家能更积极地参与到这个项目中来。 订阅我们 你可以做一个默默潜水的读者，也可以在评论区与作者激辩，或者亲自成为写作者。但无论如何，你一定非常关注 LUG Planet 的动态。所以我们提供了多种方式确保你能得到及时的通知： RSS 订阅（推荐）。由 LUG...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//planet/2018/08/hello-lug-planet/",
"teaser": null
},{
"title": "USTC Linux 用户生存指南",
"excerpt":"本指南指导中科大 Linux 用户如何使用 Linux 完成各门课程。 注意：本指南目前仅包含部分计算机专业本科课程。欢迎其他同学贡献更多内容！ 程序设计 程序设计课程主要讲授 C 语言知识，而 C 语言本身就是用来 UNIX 的原生语言，所以不会有任何障碍。 建议使用 GCC 或 Clang 作为编译器，使用 GDB 作为调试器。可以选用任意一款文本编辑器（Vim、Emacs、Sublime、Atom、VSCode、gedit、Kate 等）或集成开发环境（如 CLion、Geany、KDevelop）。 兼容性：★★★★★ 数据结构 主要讲授数据结构及其C语言实现。和程序设计一样没有任何问题。 课本（严蔚敏版数据结构）分光盘版和无盘版。光盘内容为算法和数据结构的演示程序，仅支持 MS-DOS 和 Windows，其功能可完全由 VisuAlgo 替代。所以建议购买无盘版。 兼容性：★★★★★ 模拟与数字电路 旧开发板：Digilent Nexys 2 和 3 均有 Linux 工具，Xilinx ISE 也有 Linux 版本。笔者经验是 Xilinx ISE 可以正常使用。 新开发板：Xilinx...","categories": ["Experience"],
"tags": ["Courses"],
"url": "https://lug.ustc.edu.cn//planet/2018/08/USTC-Linux-user-guide/",
"teaser": null
},{
"title": "PXE 是什么",
"excerpt":"预启动执行环境（Preboot eXecution Environment，PXE，也被称为预执行环境)提供了一种使用网络接口（Network Interface）启动计算机的机制。这种机制让计算机的启动可以不依赖本地数据存储设备（如硬盘）或本地已安装的操作系统。——摘自 Archwiki PXE 原理介绍 PXE 协议是由 Intel 设计的，它可以使计算机通过网络启动。协议分为 client 和 server 两端，PXE client 在网卡的 ROM 中，当计算机引导时，BIOS 把 PXE client 调入内存执行，并显示出命令菜单，经用户选择后，PXE client 将放置在远端的操作系统通过网络下载到本地运行。 PXE 可以通过网络直接启动一些 Live Linux，或者调用 Linux Installer，GParted 等工具，较使用 U 盘启动更加方便快捷，有多种工具，Live 系统等可供用户挑选，在紧急维护情况下也有很大的作用。 例子：图书馆查询机 图书馆内的图书查询机就是用 PXE 启动的，启动镜像叫 liims，里面包含了一个以图书馆透明计算系统为主页的浏览器（主页包括了图书查询，邮箱登录，学习空间预约等功能），还有瀚海星云的 telnet 客户端和彩虹猫，用户也可以自己启动一个虚拟机，用 PXE 启动进入查询系统。 PXE 怎么用 使用条件 电脑最好内置有 PXE Boot...","categories": ["Technology"],
"tags": ["PXE"],
"url": "https://lug.ustc.edu.cn//planet/2018/10/PXE-intro/",
"teaser": null
},{
"title": "一个 NFS 的简介",
"excerpt":"NFS（网络文件系统，Network File System）是一个分布式的文件系统，可以用于在局域网中共享文件。它通常运用在 Unix 与类 Unix 操作系统中。对于 Linux 服务器之间的文件共享来说，NFS 相比于其他的方案（如 Samba）更加方便，性能也更好。对于应用程序来说，NFS 也是透明的。 简单配置 NFS 我们以两台 Debian 10 的机器为例1简单配置 NFS 服务端。其余的发行版可以查询各自的手册以获取详细信息。 在绝大多数情况下，NFS 支持已经安装在 Linux 内核中。我们可以使用以下命令安装内核态的 NFS 服务器实现： sudo apt install nfs-kernel-server （如果有兼容 NFSv2 和 NFSv3 的需求，需要安装 portmap） 出于安全性的考虑2，我们假设 NFS 共享的根目录是 /srv/nfs4。 如果需要共享的目录在其他位置，可以使用 bind mount 的方式挂载上去。（当然，对于简单的配置来说，不这样做问题也不大） mount --bind 实际放置文件的目录 /srv/nfs/your_folder_name 编辑 /etc/exports，设置共享文件夹的位置、允许访问的...","categories": ["Technology"],
"tags": ["NFS"],
"url": "https://lug.ustc.edu.cn//planet/2019/08/NFS-intro/",
"teaser": null
},{
"title": "nc 是什么？",
"excerpt":"nc/ncat 是 netcat 的缩写，它可以读写 TCP 与 UDP 端口——或许你看不懂这句话，这没有关系。简单地说，它可以在字符界面下，让你和服务器沟通交流。 一般来说，有很多题目都会要求你使用 nc 连接到他们的服务器，并且进行交互，获得 flag。 如何安装 nc？ nc 命令在 macOS 中是自带的，在 Linux 中一般自带，或是可以使用相应的软件包管理器安装（如在 Debian/Ubuntu 中这个包名叫 netcat）。 当然，如果你在看这篇手册，你的操作系统很有可能是 Windows。它不自带 nc，尽管可以用 WSL 或者虚拟机的方式解决，但是如果你觉得这样太麻烦了，也有另外一些方法。 使用静态链接的 ncat 程序 前往 https://github.com/andrew-d/static-binaries/blob/master/binaries/windows/x86/ncat.exe 下载此程序。我们也在这里提供了一份。下载下来即可。 ncat.zip 下载 注：nc/ncat 事实上是两个不同的程序，但在我们接下来的使用上，基本没有区别。ncat 是由 Nmap 项目开发的“重置版的 Netcat”。 我的杀毒软件报毒！ 这是 virustotal 的检测结果：https://www.virustotal.com/gui/file/d0baada87420dd7c2e63d0dd3248749c06b53806d3021863c4fa659608053a8a/detection 如果你不相信此来源，也可以下载 nmap（一个网络探测、扫描工具），它会附带一个 ncat。 如何使用...","categories": ["Tech Tutorial"],
"tags": ["hackergame","netcat"],
"url": "https://lug.ustc.edu.cn//planet/2019/09/how-to-use-nc/",
"teaser": null
},{
"title": "【译稿】树莓派 4 评测与基准测试：与树莓派 3B+ 相比的改进",
"excerpt":"原文地址：https://ibugone.com/blog/2019/09/raspberry-pi-4-review-benchmark/，作者为 @iBug 同学。以下为翻译部分。 前段时间，我终于拿到了自己心念的树莓派 4（4 GB 的型号），之后我就忍不住试了试，看看它在报道中提到的改进与提升究竟是什么样子的。 我自己的树莓派 3B+ 有个外壳，所以这次购买树莓派 4 的同时，我也订了个铝制的外壳，以减轻发热给树莓派带来的压力。与之前的外壳不同的是，它还配备了两个小风扇，能够大幅度提高散热效率。 就让我们来看一看吧。 概览 新的树莓派 4 装在了类似 3B+ 的包装中，包装正面是树莓派 4 的红底白线的结构图，与本体大小相同。与树莓派 3B 不同的是，3B+ 和 4 都没有用防静电袋包好。当然，这不是什么问题。 它的结构与前几代类似，不过有一些明显的变化。比如说，你肯定会最先注意到那几个 USB 3.0 接口——因为它们是蓝色的。在你观察那几个接口的同时，你很可能也注意到了，有可能是因为千兆网口的升级的缘故，以太网接口换了位置。 有一些小接口，即供电口和视频输出，也有一些变化。树莓派 4 现在需要一根 Type-C 线供电，并且需求提升到了 5V / 3A。目前尚且不知树莓派 4 是否支持类似于高通快充或者 USB PD 这样的快充技术，但是从用户反馈来看，是没有的。旧款上标准大小的 HDMI 也被 micro-HDMI 口替换——而且变成了两个：它们都支持 4K 60fps 输出，而且可以同时输出！尽管我打算把树莓派当无头（无显示的）服务器来用，用树莓派配桌面环境的人可能会喜欢这个特性。...","categories": ["Technology","Translation"],
"tags": ["树莓派"],
"url": "https://lug.ustc.edu.cn//planet/2019/09/raspberry-4/",
"teaser": null
},{
"title": "使用 Beancount 进行记账并自动记录一卡通消费",
"excerpt":"本文首发于 https://charlesliu7.github.io/blackboard/2019/07/24/beancount/ 偶尔看到了复式记账这个概念，对精细记账的我而言很受用，选择 Beancount 这样的开源工具的原因莫过于账本数据完全由自己掌握，而不是被各大 APP 所保管。本文从一次个人实践的角度来说明一下复式记账的使用。 本篇文章是一个从零开始的个人实践记录，涵盖 文件组织 -&gt; 基本账本书写 -&gt; 爬取一卡通数据并自动记录，供同样使用 Beancount 的同学做参考，但此实践并不一定完全合乎其他人的使用习惯，如果有其它记录策略也是可以的。本文内容基于读者对复式记账和 Beancount 语法有一定了解的情况下撰写的，关于复式记账的概念和一些诸多基本功能介绍，可以参考阅读以下文章： 文本记账综述、复式记账开源工具比较 Beancount复式记账（一）：为什么 开始！ 安装使用 Beancount 是一个 Python 实现的开源工具，在本地即可运行，首先从 PyPI 获取： pip install beancount fava 其中 beancount 是核心包，包含核心的命令行工具；fava 是网页可视化工具。 这里有一个fava 示例账本 ，对应的 Beancount 源代码可以在 Bitbucket 上下载。 本文的示例账本以及可视化可以在该仓库查看。 克隆该仓库，在命令行中使用 fava main.beancount。 $ fava main.beancount Running...","categories": ["USTC"],
"tags": ["Beancount","eCard"],
"url": "https://lug.ustc.edu.cn//planet/2020/08/keeping-account-with-beancount/",
"teaser": null
},{
"title": "提问的智慧",
"excerpt":"How To Ask Questions The Smart Way Copyright © 2001, 2006, 2014 Eric S. Raymond, Rick Moen 本指南英文版版权为 Eric S. Raymond, Rick Moen 所有。 原文网址:http://www.catb.org/~esr/faqs/smart-questions.html Copyleft 2001 by D. H. Grand(nOBODY/Ginux), 2010 by Gasolin, 2015 by Ryan Wu 本中文指南是基于原文 3.10 版以及 2010 年由 Gasolin 所翻译版本的最新翻译； 协助指出翻译问题， 请发Issue，或直接发Pull Request给我。 本文另有繁体中文版: https://github.com/ryanhanwu/How-To-Ask-Questions-The-Smart-Way...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/doc/smart-questions/",
"teaser": null
},{
"title": "引导技术浅析",
"excerpt":"计算机从来不是聪明的“电脑”，它只是在硬件设计者和程序员的设计下按部就班地运行。 当计算机启动的时候它就需要这样的指示：“我现在该干嘛”。它不会主动地启动一个用户想要的系统，而是需要有个家伙，我们称之为loader来告诉它完成这件事情，这个过程就叫boot（引导）。 计算机需要从存有程序数据的媒介里获取这个loader，这个时候它开始访问CMOS芯片里的指定的媒介，从中寻找loader。对于不同的媒介，可以在各自的某段地址里找到最初的引导代码，这段地址就称为引导区。引导区的代码载入之后，计算机就有了文件访问等更强大的功能，便开始进行下一步的引导。 通常引导区的引导代码里指定了下一步的引导文件的位置和名称，于是计算机便据此载入引导文件，引导文件载入后的计算机更加强大，能够接收用户输入，并能交互地回显用户操作。 接下来计算机开始寻找操作系统的内核，开始正式的系统启动过程。这时就不在我们讨论范围内了。 载入了loader的计算机通常是如上所说地引导操作系统内核，然而也可以再更换性地载入另一个loader，将计算机的上下文环境变为另一个loader。很多时候我们会需要这种强大的功能满足我们的需求。 grub，全称为GRand Unified Bootloader，就是一个功能十分强大的loader，它提供了多种引导方式，同时有很好的交互界面，能够方便设置各种引导环境和参数。 GRUB4DOS快速入门 为什么是grub4dos grub4dos可以看作是grub的衍生版本，又从syslinux里吸取了一些东西。 grub4dos的优势大致如下： 精简，非常适合U盘使用，其程序文件只有一个，外加一个用于配置的menu.lst； 引导扇区里的引导代码对主程序的寻找是自动的，也就是说当你安装好引导扇区里的引导代码后可以任意改变引导程序的位置（只要还是在根目录）； 支持ntfs，且与Windows的loader可以完美地互相引导。鉴于现行的PC基本上都是Windows PC，经常有需要用的地方； 方便的使用光盘/软盘镜像 国内研究较多，各种系统论坛都有相关的讨论和文档。 grub4dos也有一些缺点： 可扩充性差，只支持固定的几种文件系统：fat32, ntfs, ext2/ext3/ext4； 兼容性下降，某些机型可能引导不起来。这也是功能增加的必然结果。 安装grub4dos 可以从grub4dos的主页http://download.gna.org/grub4dos/获取grub4dos，解压后获取后面操作需要的文件。 grub4dos仅由两部分组成：处于任意一个可访问分区根目录的grldr主程序文件，用来引导扇区的引导代码。另外还有一个可选的配置文件menu.lst。 首先是安装引导代码： Windows：可使用grubinst_gui，可从http://download.gna.org/grubutil/下载。 Linux: bootlace.com /dev/sdx（sdx为你的盘符） 接下来就是拷贝文件了，大家都会，一切搞定，就这么简单。 如果你用的是自己的主机，已经装了别的系统，有自己的loader，你也可以用系统的loader来引导grub4dos。这一步取代了引导代码的安装。 grub引导 grub2引导 XP（ntldr）引导 Windows 7（bootmgr）引导 使用grub4dos 学习grub4dos最好的方法就是看人家的menu.lst，menu.lst里的每条title实际上就是一系列的grub引导命令。 下面贴一下我移动硬盘里的grub4dos的menu.lst： # GRUB boot loader configuration. # # By...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/greenwarm/",
"teaser": null
},{
"title": "Linux_summary",
"excerpt":"— greenwarm 2010/11/13 14:30   对GNU和Linux的一些理解   题记 —— Linux是一份UNIX兼容的内核源码   最初计算机都是有重要的工程计算任务的昂贵器械，同时其运算能力也十分有限，上层开发也比较麻烦。于是就有了UNIX，UNIX可以看成是计算机硬件上的Lua，有精简的设计，却同时满足个性化的、复杂的任务处理需求。   后来发生了一些奇妙的事情，作为辅助计算机工作的UNIX系统本身开始变得收费和闭源，PC/个人电脑的概念开始出现时，这时出现了两种力量，一种是想将开源的方式继续传承下去，一种是想在廉价的PC上使用强大的UNIX，于是就分别有了GNU和Linux。这时，GNU的发起人发现了Linux的优越性，Linus本人也是开源爱好者（open source is good），于是二者合而为一，成为了GNU/Linux。Linux继承了UNIX的一系列优点，却也保留了UNIX的传统的设计习惯，如适合分布式架构的图形系统构架，然而对于那些渴望拥有自己UNIX设备的人来说，能在自己的PC上运行Linux无疑是件非常快乐的事。这时的Linux可以看成是free UNIX。   再之后，以用户友好和多媒体应用为基本理念的PC出现了，其中包括著名的Microsoft和Apple。一方面Linux被大量优秀的工作提升性能，成为了重要的服务器系统，另一方面Linux的一帮geeker们开始建立Linux内核上的以GNU软件搭建的图形系统，这时就有著名的GNOME和KDE。   再后来，Microsoft成为了帝国，同时网络应用在PC应用中迅速崛起，很多人开始注意到了GNU/Linux可以作为网络终端的其他选择。于是开始有了Ubuntu。由于GNU/Linux良好的可定制性，及大量艺术工作者的加入，使得Linux十分养眼，加之Ubuntu之流的大力宣传。Linux开始在桌面领域流行起来，然而由于一些历史的原因，GNU/Linux的很多设计与桌面应用格格不入，这是一个戴着脚镣跳舞的时代。   再后来，最大的互联网公司Google发现未来的应用将安放在统一开放的“云平台”上，终端机的设计可以尽可能简化，终端机的类型也可以多样化，其主要作品有Android和Chrome OS。于是Linux开始进入云时代。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/greenwarm/linux_summary/",
"teaser": null
},{
"title": "Live Linux 发行版",
"excerpt":"简介   Live模式的Linux在维护、安装、体验等方面有很大的优势，其中有一部分发行版本身更是就以Live模式发行的。吾生也晚，很多早期的live版本未能见证其壮大、鼎盛。   下面只介绍一些我见过的不错的live Linux发行版   Slitaz   非常小巧，30M，同时拥有完善的图形界面和图形程序。同时它也是十分易于定制的   Tiny Core Linux   更加小巧，分有GUI和无GUI的两个版本，有GUI的用的是flwm，一个极度精炼的wm。   关键是官网的定制教程非常详细，作者也设计了bootlocal.sh等一系列强大的定制框架。   Parted Magic   非常笨重的维护专用，但是依然具有良好的可定制性   Puppy Linux   专为USB设计的live发行版，预装的软件为现今的多数玩家所不屑，但是USB保存机制确是非常强大。   然而似乎没有直接定制镜像的教程。   Debian Linux   有一个定制工具和详细的教程。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/greenwarm/livedist/",
"teaser": null
},{
"title": "Linux的多媒体支持",
"excerpt":"平时爱折腾多媒体方面的东西，对多媒体多少也有一点了解，下面分享一些Linux多媒体应用的见解，不足之处欢迎大家指正。 本文的组织如下：前面是对整体情况的一些介绍，后面就是具体的应用了。 多媒体文件结构介绍 音视频流 音视频流是多媒体文件的核心数据。 文件容器 音视频流封装在文件里的方式。 编码 音视频流如果以原始编码的方式存储，将需占用巨大的空间，为此需要编码以达到压缩的目的。 Linux的多媒体框架 GStreamer 成熟，LGPL，因而被广泛使用。可以使用gstreamer-ffmpeg，还有gstreamer-pitfdll来使用Windows的Direct Show滤镜（win32codecs）。GNOME下有著名的前端Totem。 Xine 另一个多媒体框架，GPL。曾经的亮点是可以wrapper Windows的DirectShow滤镜（win32codecs）。 Mplayer/Mencoder 完整的多媒体平台。Mplayer是一个播放器，Mencoder是一个非常有名的转码器，Windows下很多转码工具其实都是它的前端。因为Mplayer主要是作为一个播放器，所以其对影音源的读取能力很强，包括各种DVD和蓝光DVD。通常，即使你使用ffmpeg制作DVDRip，也需要使用Mplayer来先将影音流dump出来。 VLC 完整统一的多媒体平台。与Mplayer一样同时支持编解码和播放，同时对流媒体支持非常好，甚至用来在线播放ftp里的电影都非常稳定，可以作为流媒体服务器。 VLC提供了一个完整的框架，但是由于年纪轻，文档少，一些功能还有不稳定的因素，因此现在还不是最完美的方案，但我们有理由相信，也许将来VLC将成为主流的跨平台播放器。 XMMS2 精炼的音频播放框架。命令行参数十分友好，而且是以后台daemon的方式运行，因此是个非常好的命令行音乐播放器。 FFmpeg 通用的转码平台，大牛Fabrice Bellard发起的项目，libavcodec就是其中最重要的一个组件，实际上上边很多播放器强大的解码能力都是由此项目提供的。 ffmpeg可以支持copy，可以用来从影片里提取声音，或者切割多媒体文件。由于它是作为一个转码平台，能够输出许多容器格式，因此在提取和切割方面十分强大。 HandBrake 针对视频收藏分享的转码平台，能够使用x264和xvid两种编码器，并最后封装成强大的mkv格式。各平台下都有相应的版本；GUI和CLI接口十分友好，参数设置方便，且可以从GUI生成命令行参数。 Linux的编解码器 神级的解码器libavcodec FFmpeg中最重要的部分，对i386和arm指令集优化极高，遗憾地是现在对多核的支持还比较早期。 昔日王者的编码器xvid 当年DVD Rip的事实标准格式。据说是MPEG4标准的一个实现，很多便携MP4都支持这种格式（通常是用avi封装）。 前沿编码器x264 h264编码器的一个实现，现在几乎所有的高清电影都用这种格式和该编码器编码，将来应该会更加流行；普清视频也有用这种编码器编码，通常称为half cd，以提供较好的压缩率。 而且h264的软硬件解码已十分完善，很多显卡也支持h264硬件解码，同时也有可以接受的软件解码库。所以无论从压缩质量还是兼容性来说，都可以使用它来编码你的收藏视频。 ffmpeg和mencoder都有x264支持，只要在编译时开启了相应选项，就能直接在其中方便地使用x264。 解流与混流 mkvtoolnix MKV的推动者，最完美的MKV解决方案。可以从GUI生成命令行参数。 用Mplayer看影片 Mplayer非常强大，不仅对ffmpeg的libavcodec支持非常好，还能调用各种外部的解码库；缺点是没有好用的GUI前端，Gnome Mplayer还不错，但是还是有些不足的细小地方，但是Mplayer的CLI是非常强大的。下面介绍~/.mplayer/config文件的配置。 顺便再提一个很shit的问题：如果你用的是A卡+fglrx的驱动，你需要使用gl模式的输出，原因如下： Catalyst’s Xv implementation...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/greenwarm/multimedia/",
"teaser": null
},{
"title": "认识Linux远程桌面控制",
"excerpt":"X window比MS windows先进的地方是, X window是个基于网络的的图形视窗系统, 本身就具有远程控制的强大功能. 用户在远程系统上登录执行X 应用程序, 并将Xclients执行的结果传回本地主机. 这就是我下面要介绍的Remote X. 这里我要说的不是telnet, rsh之类的远程控制工具, 而是指远程控制桌面应用. X window比MS windows先进的地方是, X window是个基于网络的的图形视窗系统, 本身就具有远程控制的强大功能. 用户在远程系统上登录执行X 应用程序, 并将Xclients执行的结果传回本地主机. 这就是我下面要介绍的Remote X 一、Remote X 假设本地主机ip为172.16.1.1, 远程的主机ip为172.16.1.2 第一步, 在本地主机上的任意一个xterm中执行xhost, 用来允许远程的其它主机可以和本地主机的X server联网: 　　xhost + 172.16.1.2 如果不指定任何ip地址, 则表示权限完全放开, 这会带来安全问题, 要小心! 第二步, 确认本地主机的xfs是运行的. 用ps检查一下进程. 第三步, 从本地主机(172.16.1.1)上通过网络登录到远程主机172.16.1.2上, 你用telnet, ssh, rsh都可以. 设置DISPLAY变量. 　　export...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/greenwarm/remotedesktop/",
"teaser": null
},{
"title": "虚拟化简介",
"excerpt":"虚拟化的含义丰富，应用广泛。目前虚拟化技术主要关注于服务器虚拟化，即在一个宿主计算机上提供多个独立操作系统。 进行虚拟化 就是要将某种形式的东西以另外一种形式呈现出来。对计算机进行虚拟化就是要将计算机以多台计算机或一台完全不同的计算机的形式呈现出来。 虚拟化也可以将多台计算机组合成一台计算机的形式呈现出来。这通常称为服务器聚合或网格计算。 什么是虚拟化 虚拟化的类型 实现虚拟化的方法不止一种。实际上，有几种方法都可以通过不同层次的抽象来实现相同的结果。本节将介绍 Linux 中常用的4种虚拟化方法，以及它们相应的优缺点。 1.1.1.1 硬件仿真 毫无疑问，最复杂的虚拟化实现技术就是硬件仿真。在这种方法中，可以在宿主系统上创建一个硬件虚拟机（Virtual Machine）来仿真所想要的硬件。 使用硬件仿真的主要问题是速度会非常慢。由于每条指令都必须在底层硬件上进行仿真，因此速度减慢 100 倍的情况也并不稀奇。若要实现高度保真的仿真，包括周期精度、所仿真的 CPU 管道以及缓存行为，实际速度差距甚至可能会达到 1000 倍之多。 硬件仿真也有自己的优点。例如，您可以运行多个虚拟机，每个虚拟器仿真一个不同的处理器。 1.1.1.2 完全虚拟化 完全虚拟化（full virtualization），也称为原始虚拟化，是另外一种虚拟化方法。这种模型使用一个虚拟机，它在客户操作系统和原始硬件之间进行协调。“协调”在这里是一个关键，因为 VMM（Virtual Machine Monitor） 在客户操作系统和裸硬件之间提供协调。特定受保护的指令必须被捕获下来并在 hypervisor 中进行处理，因为这些底层硬件并不由操作系统所拥有，而是由操作系统通过 hypervisor 共享。 虽然完全虚拟化的速度比硬件仿真的速度要快，但是其性能要低于裸硬件，因为中间经过了 hypervisor 的协调过程。完全虚拟化的最大优点是操作系统无需任何修改就可以直接运行。惟一的限制是操作系统必须要支持底层硬件。 1.1.1.3 超虚拟化 超虚拟化（paravirtualization）是另外一种流行的虚拟化技术，它与完全虚拟化有一些类似。这种方法使用了一个 hypervisor 来实现对底层硬件的共享访问，还将与虚拟化有关的代码集成到了操作系统本身中。这种方法不再需要重新编译或捕获特权指令，因为操作系统本身在虚拟化进程中会相互紧密协作。 超虚拟化技术需要为 hypervisor 修改客户操作系统，这是它的一个缺点。但是超虚拟化提供了与未经虚拟化的系统相接近的性能。与完全虚拟化类似，超虚拟化技术可以同时支持多个不同的操作系统。 1.1.1.4 操作系统级别的虚拟化 最后一种技术是操作系统级的虚拟化，它使用的技术与前面所介绍的有所不同。这种技术在操作系统本身之上实现服务器的虚拟化。这种方法支持单个操作系统，并可以将独立的服务器相互简单地隔离开来。 操作系统级的虚拟化要求对操作系统的内核进行一些修改，但是其优点是可以获得原始性能。 1.1.2 与Linux有关的虚拟化项目...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/greenwarm/virtualization/",
"teaser": null
},{
"title": "1.2 Xen简介",
"excerpt":"Xen 是在剑桥大学作为一个研究项目被开发出来的，它已经在开源社区中得到了极大的推动。Xen 是一款 半虚拟化（paravirtualizing） VMM（虚拟机监视器，Virtual Machine Monitor）， 这表示，为了调用系统管理程序，要有选择地修改操作系统，然而却不需要修改操作系统上运行的应用程序。 虽然 VMWare 等其他虚拟化系统实现了完全的虚拟化（它们不必修改使用中的操作系统），但它们仍需要进行实时的机器代码翻译，这会影响性能。 由于 Xen 需要修改操作系统内核，所以您不能直接让当前的 Linux 内核在 Xen 系统管理程序中运行，除非它已经 移植到了 Xen 架构。不过，如果当前系统可以使用新的已经移植到 Xen 架构的 Linux 内核，那么 您就可以不加修改地运行现有的系统。 图 1-1 简单的 Xen 架构 Xen 是一个开放源代码的para-virtualizing虚拟机（VMM）或“管理程序 ”，是为x86架构的机器而设计的。Xen 可以在 一套物理硬件上安全的执行多个虚拟机。 1.2.1 硬件支持 目前运行在x86架构的 机器上，需要P6或更新的处理器（比如 Pentium Pro, Celeron, Pentium II, Pentium III, Pentium IV, Xeon,...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/greenwarm/xen%E7%AE%80%E4%BB%8B%E4%B8%8E%E4%BD%BF%E7%94%A8/",
"teaser": null
},{
"title": "中国科学技术大学 Linux 用户协会",
"excerpt":"中国科学技术大学 Linux 用户协会（科大 LUG）是由在校的 GNU/Linux 爱好者发起并组成的全校性群众团体，是一个以推广自由软件文化、宣传自由软件价值为目的的协会组织。 了解更多 English Version 特色活动 LUG 每周小聚: 每周末由同学带来的技术分享演讲。 Linux Install Party: 推广和安装 Linux，宣传和鼓励开源和自由软件精神的活动。 Linux 101: 帮助新手学习 Linux 的系列活动。 自由软件日: 在国际自由软件基金会（SFI）的领导下，由自由/开源软件爱好者自发筹集的非盈利性活动。 信息安全大赛: 每年秋季学期举办的信息安全竞赛。 网络服务 开源软件镜像 LUG FTP(各种资源汇总) 网络启动服务 GitLab 代码托管 其他 请参阅 LUG 网络服务总则 联系我们 QQ 群: 适合于即时性较强的讨论，较正式的讨论还请使用邮件列表。具体群号请查看 qq.ustclug.org 的 TXT 记录。 邮件列表: ustc_lug (at) googlegroups.com...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/",
"teaser": null
},{
"title": "中国科学技术大学 Linux 用户协会",
"excerpt":"English Version 中国科学技术大学 Linux 用户协会是由中国科学技术大学在校的 GNU/Linux 爱好者发起并组成的一个全校性群众团体。成立协会的目的在于联合科大的 GNU/Linux 使用者，搭建信息交流共享的平台，宣传自由软件的价值，提高自由软件社区文化氛围，推广自由软件在科大校园乃至合肥地区的应用。 Linux 用户协会正式成立于 2003 年，至今已经走过了十多个年头，是安徽省高校中一个以推广自由软件社区文化、宣传自由软件价值为目的的协会组织，也是中国大陆高校发展最好的 Linux/自由软件社团之一。在各届协会成员和志愿者的共同努力下，协会开展了许多有意义的活动，如 Linux 网络技术讲座、“GNU/Linux Install Party”、PMP 中的嵌入式 Linux 技术讲座、Oracle 和开源技术报告、“合肥地区开源软件竞赛”、自由软件日技术沙龙、每周小聚和多次 GNU/Linux 系统使用和编程讲座。 自 2003 年开始，协会开始维护国内知名的 Debian 镜像服务器 http://debian.ustc.edu.cn，目前在学校网络中心的支持下，该服务器和 http://oss.ustc.edu.cn 整合为 http://mirrors.ustc.edu.cn ，并成为 Debian, Ubuntu, Fedora, Archlinux 等多个发行版的官方源以及 Debian 在中国的官方镜像：http://ftp.cn.debian.org 。利用少年班学院的退役超算，协会建立起了 freeshell 服务器，为科大师生提供了容易上手的 Linux VPS。在网络信息中心的帮助下，协会建立了 PXE 网络启动系统，使得在校内可以很快的试用和安装 Linux 系统。协会同时对图书馆的无盘查询系统进行维护。...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/intro/",
"teaser": null
},{
"title": "Linux User Group @ USTC",
"excerpt":"USTC LUG is the abbreviation for Linux User Group (LUG) of University of Science and Technology of China (USTC). USTC LUG is a technology-leading association that consists of the GNU/Linux enthusiasts in USTC. The aim of USTC LUG is to unite the GNU/Linux users in USTC, to build a platform...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/intro_english/",
"teaser": null
},{
"title": "使用badblocks命令处理硬盘坏道",
"excerpt":"对硬盘数据的操作存在风险，请谨慎操作   扫描硬盘坏道   命令：   badblocks /dev/sdXX [-s -b4096 -o err.log]   常用命令解释：  -s：在屏幕上显示进度  -b：每次扫描的块大小  -o：将错误输出到文件   利用硬盘的重分配特性修复坏道   硬盘上的芯片存有一个GList，里面存储着盘面上的坏道信息，当读写到其记录的地址时会自动重映射另一个地址来代替损坏的区域。而往其中添加内容很简单：只要往坏道上写数据（读不行），硬盘会自动重映射。   警告：本操作会覆盖硬盘目标区域的数据，请谨慎使用   技巧：可以使用dd命令使用conv=noerror, sync参数先备份目标区域的数据，在修复后用dd写回，具体请参阅man dd   命令：   badblocks -w [-f] /dev/sdXX [-s -b4096] end start   常用命令解释：  -w：写入命令，通过在坏道地址强制写入来让硬盘自动重映射。  -f：强制写入，在已确定目标不被系统读写而-w仍然拒绝写入时使用。这个参数应该尽量避免！  end, start：强制写入的开始和终止块地址，与-b制定的大小相配和。   其他更为深入的使用方式请参阅man badblocks   来源声明   blog/badblocks.txt · 最后更改: 2013/04/29 08:04 (外部编辑)  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/badblocks/",
"teaser": null
},{
"title": "crontab",
"excerpt":"Cron服务通常用于循环定期执行任务，而crontab 用于添加、删除和查看Cron项目。 每个用户的crontabs是独立的。如果/etc/cron.allow存在，则必须在里面添加username（每个条目一行）来获得使用crontab命令的权限。如果/etc/cron.deny存在，则必须保证用户名不在其中才能使用crontab命令。如果两个文件都存在，则cron.allow的优先级更高。如果两个文件都不存在，则可能只有root或者所有用户都可以使用crontab命令。 crontab命令 命令使用方法： crontab [ -u user ] file crontab [ -u user ] [ -i ] { -e | -l | -r } 当指定了file的时候，这个文件被用作该用户的cron表项。 参数含义： -u 指定用户。通常没有这个参数的时候默认使用当前用户，但是在使用su命令的时候可能会有问题。因此建议一直使用-u参数指定用户。 -e 编辑用户的cron表 -l 列出用户的cron内容 -r 删除当前用户的cron表 -i 配合-r使用，在进行删除的时候提供选择 crontab文件的编辑 以#开头的行表示注释，但是注释不能与cron命令或者环境参数设置语句在同一行。 环境变量设置语句为 name = value形式，但是value里面引用的变量不会被解析。例如$HOME不会解释为用户的home目录，而是直接当作字符串“$HOME”处理，环境变量通常用于设置$SHELL (默认为/bin/sh), $MAILTO(默认为crontab关联的用户), $PATH（默认为/usr/bin:/bin）等等。 每行的内容依次为分、时、月中的某天、月份、星期中的某天 。 示例：...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/crontab/",
"teaser": null
},{
"title": "ed 文本编辑器使用笔记",
"excerpt":"昨晚抽风一般地想要学学 ed 究竟应该怎么用，于是花了十多分钟学习了一下基础用法，可以保证在紧急情况下“存活”。稍微整理一下自己学到的用法： 调用 ed [file] 一般使用 如果是创建新文件的话，进入程序后除了光标什么都不会显示；如果是打开已有文件，那么会显示一行文件大小的字节数，然后光标到下一行等待用户输入。 ed 是基于行的文本编辑器，也就是说同时只能显示或编辑文件的某一行。和 Vi 类似，存在两种模式：输入模式和命令模式。默认打开文件后进入命令模式。 既然是基于行的编辑器，那么 ed 有一个“当前行”的概念，可以使用 n 查看之，会打印出当前所在行号。默认打开文件后自动跳转至文件末尾（也就是最后一行）。 在命令模式下输入编辑器不认识的命令，会回显一个问号 ? 表示输入错误。 文字输入 切换至输入模式的命令如下： a，在当前行的下一行开始插入文字； i，在当前行的上一行开始插入文字； c，抹除当前行的所有文字，重新输入。 注意 c 命令的危险性。 切换至输入模式后，就请随意地打字吧，回车也会忠实地写入文件。缺点是没有办法修改回车符以前的输错的文字。如果想修改，必须退出当前的输入模式再尝试修改。 如果想退出输入模式，在新行输入 . 即可。就是英文句点。 导航 以下导航命令应当在命令模式下使用。 直接输入行号并回车，跳转到对应行，并回显对应行的文字（不带行号）。 输入回车，会跳转到下一行，并回显对应行的文字（不带行号）。 输入 . ，会重复显示当前行的文字（不带行号）。 输入 n，会回显当前行的文字（带行号）。 保存与退出 在编辑已有文件的时候，输入 w 可以进行保存，回显新文件的字节大小。 在编辑新文件时，需要在 w 后接上文件名。回显相同。 按 q...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/ed_editor_usage/",
"teaser": null
},{
"title": "ExPASy的ps_scan在linux下的简明配置指南",
"excerpt":"配置数据库 下载数据库 wget -c ftp://ftp.expasy.org/databases/prosite/release_with_updates/prosite.dat 给一个文件夹$PROSITE的环境变量，然后把prosite.dat放在$PROSITE/里头。例如我把 prosite.dat放在/home/sun/ps _scan/下 export PROSITE=“/home/sun/ps_scan” 配置软件 下载软件 wget -c ftp://ftp.expasy.org/databases/prosite/tools/ps_scan/ps_scan_linux_x86_elf.tar.gz 解压缩 tar -zxvf /home/sun/ps_scan_linux_x86_elf.tar.gz -C /home/sun/ps_scan/ 得到ps scan文件夹中有如下文件：LICENSE，pfscan，pfsearch，psa2msa，ps scan.pl, README, README.prf. 其中LICENSE是该软件的协议，pfscan, pfsearch, psa2msa三个文件是可执行文件，ps_ scan.pl是perl脚本，两个README是使用指导。 把三个可执行文件放进$PATH文件夹。 sudo cp pfscan /usr/local/bin/ sudo cp pfsearch /usr/local/bin/ sudo cp psa2msa /usr/local/bin/ 运行软件 perl ps_scan.pl [options] 这里你需要处于ps_scan.pl所在的目录下，至于数据库，由于前边设置过环境变量，软 件会自动找到。当然你也可以在[options]的后头接上数据库的文件。[options]的参数 可以在README里头找到。...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/expasy-ps_scan/",
"teaser": null
},{
"title": "Linux 文摘",
"excerpt":"这里收录一些本 Wiki 上有关 Linux 使用的有用文章和一些有用的链接。 超级计算中心培训资料 Linux 操作系统使用基础 读书笔记 文章名称 备注 《程序员的自我修养》读书笔记   读书笔记：关于维护服务器的一些技巧   手把手读书报告   《鸟哥的 Linux 私房菜 – 基础学习篇》读书笔记   来自王光远同学的emacs读书笔记   《黑客与画家》读书笔记   另请参阅读书笔记 其它文章 文章名称 备注 Linux 下关于硬盘 S. M. A. R. T 的相关操作   crontab 使用方法   screen 使用方法   ed 使用方法   lftp...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/",
"teaser": null
},{
"title": "lftp",
"excerpt":"lftp是一款基于命令行的文件传输程序。除了FTP外，她还支持FTPS, HTTP, HTTPS, HFTP, FISH和SFTP。它还有一个实用的特性，支持FXP，即在两台FTP服务器间传文件，绕过客户机。此外，她还有一个内建的BitTorrent客户端。 常用命令 配置文件 lftp启动后会一次读取/etc/lftp.conf、~/.lftprc和~/.lftp/rc。 通常我们将常用的设置写入~/.lftprc或者~/.lftp/rc中。 下面是一份lftprc的样例： .lftprc #在浏览GBK编码的ftp时，可以执行gbkserver命令迅速切换。 alias gbkserver set ftp:charset gbk;set file:charset utf-8 alias utfserver set ftp:charset UTF-8;set file:charset utf-8   #使得ls的输出更友好、美观 alias ls cls -lhSF set color:use-color true   #本地文件名使用utf8存储 set file:charset utf-8   #对202.38.64.22站点的独立设置 set ftp:passive-mode/202.38.64.22 no set ftp:charset/202.38.64.22 gbk 在被动模式下，lftp主动连接服务器进行数据传输。在主动模式下，服务器会主动连接lftp进行数据传输。 被动模式当您在防火墙后面时很有用。...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/lftp/",
"teaser": null
},{
"title": "手把手读书报告",
"excerpt":"来自：黄若山 书在前面的部分可以说是LFS的中译版本。如何搭建Linux其实就是利用现有的Linux系统和gcc编译器，编译得到一个不再依赖原有系统的Linux。这依赖其实最主要的就是Glibc了。其实整个过程对我来说，在两次编译gcc的过程是最美妙的，其他的就是源码安装软件而已。 所以我就说说我对如何得到全新gcc这个过程理解。 glibc是个独立依赖的库，它只和内核提供的接口有关，不再依赖其他文件。gcc在编译软件时，可以只使用glibc完成编译过程。所以要实现整个新系统的独立，只要用新gcc使用新的glibc。这个过程的实现是先用旧的glibc和gcc（记为glibc1、gcc1），gcc1+glibc1=gcc2, gcc2+glibc1=glibc2, glibc2+gcc2=gcc3, gcc3+glibc2=最终环境所需要的独立编译环境。(这个过程是否正确我不确定，待我细学后继续……） 在编译那个过程后其实就是自己装软件，最后编译内核，配置相应文件，grub，启动新系统…… 我觉得要折腾就折腾前面那部分，然后看看最后的配置文件，比如rc.conf、udev等等的就可以了。全部做下来耗时，没什么意义。除非自己作精简系统。 做完这个之后，其实和安装Gentoo有点像…… 讲讲我看到的一些技巧吧（给新手看的……）： - 多核电脑make的时候，可以make -jN(注：N=CPU核心数目×2+1）1,速度一般要会快很多。 - 自己编译软件时，可以把目标设成~/.bin/local/***;但是不要把对应的可执行文件目录export到PATH;而是把~/.bin/bin添加进PATH，然后把所有可执行文件链接到~/.bin/bin里面。这和最原始的包管理有点像（书说的）。 书的后半部分除了交叉编译和hurd内核和前面的有点相似外，其他的两个部分是LiveCD和USB Live OS的制作。 对于那两个Live系统的制作是很值得一看的，里面见了很多启动的细节，跟在前面编译完目标系统之后。其实在编译目标系统时，基本没什么意思。后面我觉得更有用。后半部分主要讲了initrd和initramfs的两种辅助系统的启动方式，对于想大致了解下系统是怎么启动的（跳过引导的细节），还是很有帮助的。至少它让你懂得如何问真正关于系统启动的问题了。以后你应该不会直接问“电脑是怎么启动的？”，而是“系统启动内核后是怎么样启动外围设备的？”。这就是好书的作用了，它要么使你完全懂得你想要的所有细节，要么使你学会如何正确有效地提问、搜索。 在后面部分，也捡到了一些小技巧，还是供新手参考的： 如何在一个分区上面同时有两个挂载点？如把home和opt挂到一个分区 答案是Aufs。 把经常用的文件，读写非常非常密集的文件放到tempfs上，即先mount -t tmpfs tmpfs /mnt;cp 用镜像文件保存自己的home常用配置。 mount -t tmpfs tempfs /mnt dd of=/mnt/home.img if=/dev/zero -bs=10M -count=10 mke2fs -t ext3 /mnt/home.img mount -o loop /mnt/home.img /somewhere cp ~/*...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/reading_notes/ruoshan-lfs-read-notes/",
"teaser": null
},{
"title": "读书笔记：关于维护服务器的一些技巧",
"excerpt":"寒假读了三本书《LINUX SERVER HACKS 卷二》《实战Nginx：取代Apache的高性能Web服务器》《Linux服务器性能调整》，简单地了解了些linux服务器维护和管理上的技巧。现在就分别简要谈谈我在读这三本书时的感受吧。   一：《LINUX SERVER HACKS 卷二》   首先，这不是一本工具书，而是一本经验集。书内都是很巧妙的一节一节的linux服务器维护技巧，主要目的是提高维护linux是的速度和鲁棒性。说实话，我不是很习惯这种模式的书，因为如果带着问题去读这本书，读完后还是问题，而本不是关心的部分，读完后也很快就忘了。  简言之，我懂这本书里得到的信息有：  一：linux非常灵活，特别是结合NFS以及远程终端，可以做非常有想象力的事情。  二：在复杂的连线环境中记得使用screen  三：脚本可以做几乎任何维护性质的事，而且事情的解决方案往往比你想得简单。  四：注意uid，gid重用可能带来的问题  五：Google万岁   二：《Linux服务器性能调整》   这本书翻译的不是很好，文法晦涩，而且介绍的东西偏深，很多是探讨内核级的优化。感觉看得不是很明白，简单写写吧。  一：关于服务器文件系统的选择：ReiserFS鲁棒性很好，而且对小文件有最佳性能。XFS针对大型文件有最佳性能。  二：一块硬盘上读取外侧磁道的速度要快于内侧磁道，所以分区是可以考虑这点将序号小的分区分配给经常读写的目录。譬如分区时第一个为swap，第二个/var，再者/usr，最后才是根和/home  三：mount文件系统时带上noatime可以提高一些性能。  四：文件系统在创建的时候可以调教一些参数优化性能  五：各类监控/tweak工具：hdparam, iostats, top, vmstat   三：《实战Nginx：取代Apache的高性能Web服务器》   这本书灌水的内容比较多，内容实际上也就是作者博客上的一些应用技巧的整理，可以总结的不多，因为按部就班的做就行了。  从书中看，nginx的性能优于apache，而且在反向代理方面特别有优势，这是它的亮点。Nginx虽然支持rewrite，自我感觉还是蛮好用的，但是不兼容apache的.htaccess，使用时需注意。  Nginx的组件高度模块化，可定制性比较强，具体可在使用时疯狂google。  对于使用php+mysql的场合，注意php使用fastcgi的方式启动，性能貌似比传统cgi要高不少，估计和apache的module差不多  书中没有提到什么值得一提的优化，具体实践的时候多google好了。对于硬件环境不好的服务器，减少nginx工作进程，打开gzip压缩和缓存，为php安装加速器并为低配置环境优化，数据库（例如mysql）在配置时减少内存占用上限。选择myisam而不是innodb。  简言之，这本书最大的作用就是让nginx变得平易近人大家都可尝试了。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/reading_notes/snullp2011-winter-reading-notes/",
"teaser": null
},{
"title": "来自王光远同学的emacs读书笔记",
"excerpt":"作者：王光远   世上的知识有两类：一类习得困难却难以遗忘；另一类学习起来毫无压力，不过却难说真正掌握。Emacs的使用应该就是后者的典范吧。本书通篇所述离不开键盘上的ctrl、alt和各个字母键，但是看来也仅限于此。所以不妨从使用的角度谈谈感想吧。精巧复杂的组合给emacs以强大的生命力，对光标的定位和文字的处理是编辑器的特色，但是不谙此道的新手可能有时还是忍不住用方向键和鼠标定位以求方便。   以前都是C++惯了，寒假早想着学习一门新的语言，perl，兼练习emacs可谓一举两得。现在看来，虽然还是没有熟练到高手的地步，但是这样的过程我还是要推荐的，通过使用来熟练，使对编辑器的操纵成为手指的本能就是最好的学习方式。emacs的强大还在于脱离的鼠标的束缚，编程效率会有极大地提高。很多原本要用鼠标来定位、选择单词、复制删除查找等等的操作都可以用几个简单的组合键来完成。更不用说宏的批量处理能力了。刚开始的不习惯坚持下来就一定会在以后产生极大的生产力。   除了纯粹的编辑文本，有一种说法，emacs是伪装成编辑器的操作系统，网上有专门的网站论述相关的内容，神马上网、日历、地图啊之类的，我就当做是奇技淫巧没有多加关注了，有好奇的同学可以看看。对于不同的编程语言，emacs还有对应的模式，可以高亮关键字或者方便排版。 这也牵涉到编辑器定制的问题，多看看网上给的配置范例，慢慢的就会形成适合自己的方案了。   再回到书上。一、可以按照不同需求读不同的章节，前言有写特定的学习曲线。二、本书以ESC键代替META键，但是在美式键盘上实际上应该是ALT键，不要混淆就好。三、自己弄个常用命令的表贴在案头也应该不错，书后就有这样的活页，照着自制个好了。   就这么多了，多练就好，谁有用过的也想听到你们的感想~  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/reading_notes/wang-guangyuan-emacs-read-digest/",
"teaser": null
},{
"title": "《鸟哥的 Linux 私房菜 – 基础学习篇》读书笔记",
"excerpt":"寒假前从USTCLUG书库中借了这本《鸟哥的 Linux 私房菜 – 基础学习篇》。现还了，补上这篇读书笔记。   这本书很厚，却也只是Linux操作中的基础篇。想来，想熟悉甚至灵活运用Linux，还有很多的东西要学，很长的路要走。寒假时间比较紧，匆匆忙忙将此书翻阅了一下，主要看了前面三部分：安装，文件，shell。还书时，略有些遗憾，主要是有些没看完，有些看了没记住。鸟哥说这不是一本手册，但我想，要是有这么一本通俗的、生动的手册也是不错的。   自己平时使用的是Ubuntu，因为有图形界面，对命令的使用不熟悉的多。略跑题地说下我用图形界面的原因：一是好看，二是不会忘记某些选项（终端下我会忘记某些参数）。所以看着这边《鸟哥的 Linux 私房菜 – 基础学习篇》，对于我来说，有很多新的东西要去学，要去记。拿Vim那节来说，看完才发现Vim有好多功能！原本，我只是会一些简单的操作：替换，查找，保存。然而书中还介绍了很多命令：: n1,n2 w [filename] 可以选择性地保存部分内容； :sp 来分割窗口。这些都是以前不曾了解的。   总之，这本书从初学者的角度，很好地介绍了如何使用Linux。当然这本书也可以发挥查漏补缺的作用。当然，想深入了解，这一本书还远远不够。   朱晟菁@USTCLUG   3/4/2013   来源声明   reading notes/zsj 鸟哥的 linux 私房菜 – 基础学习篇_读书笔记.txt · 最后更改: 2013/05/12 13:51 (外部编辑)  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/reading_notes/zsj_niao_linux_sfc_basic_readnote/",
"teaser": null
},{
"title": "screen",
"excerpt":"screen命令是在服务器维护等场合非常有用的一个命令。 如果你有ssh到远程服务器的经历的话，你应该知道如果将终端关闭的话，里面正在运行的所有任务都会强制退出，这就导致你必须等待任务完成才能退出。 使用 screen 可以解决这个问题。其作用便是虚拟一个新的tty终端，并在远程登录的场合不会因为退出、网络连接不稳定而中断当前shell。在执行耗时很长的操作、可能断网的操作、当前网络不稳定等场合使用十分方便。 主要命令 screen：开启一个新的虚拟终端。 screen -l：显示目前已有的虚拟终端 screen -r [pid]：连接之前断开的虚拟终端 为了方便记忆，也可以对虚拟终端进行命名： screen -S foobar ：开启一个以 foobar 为名称的虚拟终端； screen -r ：在当前仅有一个虚拟终端的情况下连接（attach）已有的虚拟终端，在有多个虚拟终端时效果同 screen -l； screen -r foobar ：连接以前名为 foobar 的虚拟终端。 在虚拟终端中，按 ctrl+A 进入 screen 命令模式，此时再按 d 可以断开(detach)（但不终止）当前的终端。 其他命令请在man screen中查看。 .screenrc脚本 # tar-bar hardstatus alwayslastline hardstatus string '%{=b}%{b}%-w%{.BW}[%n %t]%{-}%+w %=%{G}%C%A %Y-%m-%d'...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/screen/",
"teaser": null
},{
"title": "Linux下关于硬盘S. M. A. R. T的相关操作",
"excerpt":"主要命令：smartctl，包smartmontools中的一个组件。 Ubuntu可以通过apt-get install smartmontools来安装 常用命令： 有些硬盘需要先执行smartctl /dev/sdX -s on来开启硬盘的S. M. A. R. T信息访问 1. 查看硬盘的全部S. M. A. R. T信息 smartctl -a /dev/sdX 一个十分有用的命令，将给出许多有用的信息。 特别关注如下部分： SMART Attributes：给出硬盘S. M. A. R. T数据的值，其中很多可以用来判断磁盘性能和健康状况以及寿命。 SMART Error Log：给出硬盘历史上最近的5次错误细节。较新的硬盘都不应有错误数据，如果此处有记录错误而并没有察觉到硬盘的问题，不能存有侥幸心里而应该进行全面的硬盘检查。 SMART Self-test log：给出硬盘历史上以及正在进行的自检的时间和结果。一块健康的硬盘不应在此处出现错误。 2. 执行硬盘自检 smartctl -t [long|short] /dev/sdX 将进行硬盘内置的离线自检，在自检过程中系统不受影响仍可正常操作。 一般使用long（或extended）进行自检，虽然时间较长但可以发现硬盘几乎100%的错误，包括未使用的区块坏道以及表面错误等等。 自检的结果可以在smartctl -a或者smartctl -l selftest中查看 smartctl的GUI：GSmartControl，可以通过apt-get安装，图形操作十分直观。 更多信息请使用man...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/smartmontools/",
"teaser": null
},{
"title": "Linux 用户管理",
"excerpt":"Linux用户管理涉及的文件 /etc/passwd 查看passwd的内容，每一行代表了一个用户例如第一行： root:x:0:0:root:/root:/bin/bash 各个域的含义依次如下：用户名，密码，UID，GID，用户描述，home目录，shell。 出于安全考虑，用户的密码被加密之后保存在/etc/shadow中，参见对shadow文件的描述。因此，在passwd文件中，密码均为x。 详细参见 man 5 passwd /etc/shadow 这个文件为root所有，只有属于root组或者使用sudo权限才能读取此文件的内容。该文件中的内容不应该泄漏给他人，以防止破解。各个域的含义如下： :::::::: 详细参见 man shadow #### /etc/group 第一行内容示例： root:x:0: 各个域的含义如下: 组名，组密码，组ID，用户列表。 详细参见 man group ### Linux用户管理命令 #### adduser 通常使用adduser来直接创建用户账户。 adduser [-u uid] [-g gid] [-d home] [-s shell] username 参数解释如下： + -u 直接给出UID + -g 直接给出GID + -d 直接将home目录设置为已经存在的目录...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/linux_digest/user_adm/",
"teaser": null
},{
"title": "读书笔记",
"excerpt":"读书笔记递交指南 发送任意格式文件到邮件列表（建议使用 PDF 格式）。 如果是链接的话，建议是长期有效的链接，如本 Wiki。不建议临时的个人博客，以及科大本科生的 FTP。 强烈建议将读书笔记记录在本 wiki 上，这样便于自己更改和管理。 更多文章，请访问 Linux 文摘 读书笔记列表 《浪潮之巅》 笔记 作者 《浪潮之巅》读书笔记 张静宁 《黑客与画家》 笔记 作者 《黑客与画家》读书笔记 sadhen 《鸟哥的 Linux 私房菜 – 基础学习篇》读书笔记 zsj 《学习GNU Emacs》 笔记 作者 来自王光远同学的emacs读书笔记 王光远 Emacs读书笔记 sadhen 《手把手教你构建自己的Linux系统》 笔记 作者 手把手读书报告 黄若山 《程序员的自我修养》 笔记 作者 《程序员的自我修养》读书笔记 boj 《Advanced Bash...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/book/booknotes/",
"teaser": null
},{
"title": "LUG图书管理",
"excerpt":"以下信息或已过时，近期将进行新一版图书管理规定的修订 图书管理员特别提醒 什么时候借 想要阅读的同学可以直接来活动室。活动室在西区图书馆，最好在每周小聚之后随我们一同前往，其他时间也可以联系图书管理员。 借阅手续简明版 简单的说，我需要两个时间戳(邮件)，一个是你借书的时间，一个是你还书的时间。 在第一个时间戳上，请你附上你的个人信息。 在第二个时间戳上，请你附上你的读书笔记。 请这样这样撰写： 第一封邮件的主题 [借阅] 《书名》 第二封邮件的主题 [已还] 《书名》 接受捐赠 原则上最大程度的接受各种图书的捐赠，但希望图书内容与计算机科学或技术相关，或者和LUG相关，和Linux相关等。 接受的图书原则上希望完整，品相完好。 我们接受匿名或实名捐赠，对实名捐赠将会在LUG书库中写明捐赠者的个人姓名或单位名称，否则注明“匿名捐赠”。 所有捐赠图书，协会一经接受，即拥有对该图书的所有权和处理权，有权对图书进行出借，传阅等处理。在捐赠者未特殊声明的情况下，协会没有将捐赠图书交还捐赠者的义务。 捐赠者如果希望将所捐赠图书在离校时取回，需要在捐赠时声明，协会将在捐赠者离校时将图书交还捐赠者。如果图书出现丢失、损毁等，协会没有赔偿的义务。 借阅制度 为了使LUG书库的图书能够得到充分利用，大家可以在LUG活动室阅读这些图书，也可以将图书借出活动室。借阅读书必须遵守本制度手册。 活动室阅读 阅读要求 任何人都可以前往活动室阅读图书，前往活动室前可以联系书库管理员，预约前往时间；有活动室钥匙的可以自行前往。 借出活动室 借阅要求 原则上，只有加入 ustclug 邮件列表的同学才有资格将图书借出活动室阅读，出于管理上的考虑希望借阅的同学登记学生证或一卡通学号。 每人每次只能借出两本图书，借出第三本图书时，必须将前一本归还活动室 每本书每次最多只能借出两个月，超过两个月需要向协会申请续借，遇节假日可以顺延 借阅图书的同学，在归还前必须提交一份或若干份图书报告，读书笔记可以是单独的文章，也可以是发表到自己博客的文章，或者其他形式的阅读笔记 对于读书笔记的篇幅，内容，形式等没有任何强制性的要求，但是请不要让别的同学认为你是在 敷衍了事 。建议使用中文，英文或者别的一些计算机编程语言（对于很多这些书来说这可能是最好的方式）表达你的思想，但是希望作品本身易学易读并且和原书籍内容紧密相关。 请勿在图书上作出勾画，涂改，加注笔记等不利于图书长期保存的动作（我们欢迎你把自己对这本书的理解写成读书笔记影响更多的人。），否则将被视为不欢迎借书的人。对于污损，丢失，撕坏或其他严重的破坏应在两个月内赔偿一本相同的书或者按原价两倍赔偿。 借阅流程 发邮件给书库管理员（目前的图书管理员是sadhen）预约要借的书目，约定时间前往活动室取书 书库管理员编辑借阅记录记录借阅信息，借阅信息包括借阅者姓名、联系方式（邮件或者手机至少一个）、借阅时间、应还时间等 续借流程 在两个月期满前，如果不能阅读完，需要续借的，必须向书库管理员发邮件申请续借，并且在两月期满前至少提交一份读书笔记 两个月期满前一周，如果借阅者未主动提出续借，书库管理员有责任通过短信或邮件方式提醒借阅者 如果在借阅者申请续借前，已有其他同学申请预订同一本图书，则由书库管理员决定执行续借或者收回图书借给新同学（可以根据读书笔记的质量以及借阅者的借阅理由判定） 归还流程 向 ustclug 邮件列表发送读书笔记，可以是报告内容，也可以是自己的博文链接，或其他适当形式（也可以在阅读期间发送） 发邮件给书库管理员，约定时间前往活动室换书（有活动室钥匙的，可以直接归还，并发邮件通知书库管理员）...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/book/borrow_book/",
"teaser": null
},{
"title": "借阅记录",
"excerpt":"如欲借阅图书，请参阅 图书借阅管理制度。 2020 年借阅记录 书名 借阅者 联系方式 借阅日期 归还日期 备注 陶哲轩实分析 王子博 hypercube AT 0x01.me 2020-01-07 2020-09-04 - 概率论与数理统计 袁一玮 totoroyyw AT ustclug.org 2020-01-13 2020-09-02 - 概率论与数理统计习题全解指南 袁一玮 totoroyyw AT ustclug.org 2020-01-13 2020-09-02 - 人工智能-一种现代的方法 付佳伟 ibug AT ustclug.org 2020-08-25 2020-09-13 - 并行计算-结构、算法编程 付佳伟 ibug AT ustclug.org 2020-08-25 2020-09-13 -...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/book/borrow_history/",
"teaser": null
},{
"title": "LUG书库",
"excerpt":"目前LUG活动室有一些Linux系统相关比较经典的书籍，有一部分是LUG购买的，有一部分是网友捐赠的。 我们同时非常欢迎童鞋们将自己手头不再需要的好书捐献出来。捐赠图书可以联系我们。 关于如何借阅，如何捐赠等问题可以参阅：图书借阅管理制度 借阅记录与黑名单：借阅记录 读书笔记汇总：读书笔记 给LUG书库推荐好书： 联系图书管理员 书单 书单的分类比较粗糙，有改进意见请联系图书管理员 以下信息可能已经过时，请访问新版LUG书库：https://library.ustclug.org/ Linux入门 书名 作者 定价（￥） 备注 借阅情况 鸟哥的Linux私房菜 基础学习篇(第二版) 鸟哥 65 3本 LUG购置2 QuITh网友捐赠1 借出1本 鸟哥的Linux私房菜 基础学习篇(第三版) 鸟哥 88.00 2本 LUG购置 借出2本 完美应用Ubuntu Ubuntu China 55 LUG购置 - 从零开始学Linux 粱丽平、马飞 45 lizitian捐赠 - Linux服务器运维 书名 作者 定价(￥) 备注 借阅 鸟哥的Linux私房菜 服务器架设篇(第二版)...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/book/",
"teaser": null
},{
"title": "联系我们",
"excerpt":"官方邮件地址 您可以向我们直接发送电子邮件。 参与邮件列表讨论（推荐） 点击此处了解详情 Telegram上的LUG 加群链接见 jointele.ustclug.org 的 DNS TXT 记录 BBS 上的 LUG 前往瀚海星云BBS Linux 版与我们讨论。 QQ群上的LUG 适合于即时性较强的讨论，较正式的讨论还请使用官方邮件列表。 QQ 群: 群号请查看 qq.ustclug.org 的 DNS TXT 记录。校内学生请联系管理员了解详情。 IRC上的LUG 网络：Freenode 频道：#ustc_lug 存档：/~sadhen/irc.html 历史存档：/~guo/irc/irclog.txt Fishroom 存档：https://fishroom.tuna.moe/log/ustclug/today 面对面交流 USTC LUG 在校内的活动室： 西区：西区图书馆 206 室 东区：东区图书馆 605 室（已搬迁） 你也可以在 LUG 举办的各类活动中找到 LUG 的成员并当面进行交流。 QQ...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/contact/",
"teaser": null
},{
"title": "Join us",
"excerpt":"加入 LUG   如果你是中国科学技术大学校内学生，欢迎通过学校统一组织的社团招新流程注册成为 LUG 会员。   在非招新活动期间，你也可以将自己的 真实姓名，学号，性别，联系电话，邮箱 通过校内邮箱发送至我们（详见联系我们）登记注册。   在登记信息后，你就会收到我们每次活动的短信通知，也欢迎通过以下方式与我们取得联系。   与 LUG 取得联系   详见联系我们   参与 LUG 活动   详见LUG活动   参与 LUG 项目           在我们的邮件列表进行交流。            在LUG Gitlab 与 GitHub 中为 LUG 项目贡献代码。            联系管理员以加入服务器维护小组。       我们的issue tracker: https://github.com/ustclug/discussions  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/contribute/",
"teaser": null
},{
"title": "Linux 101",
"excerpt":"Linux 101 活动在每年的春季学期举行，旨在帮助对 Linux 感兴趣的新手了解 Linux，学习 Linux。   举办过的 Linux 101 活动列表见 LUG 活动   历史活动      Linux 101 活动讲义   Linux 101 活动讲义仓库   历往 Linux 101 活动存档  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/101/",
"teaser": null
},{
"title": "LUG日历",
"excerpt":"目前使用Google 日历 ，如果您在国内访问遇到困难，请尝试使用 USTCLUG 提供的网络加速服务或者访问与此日历同步的 localendar 。   (活动的具体时间和地点可以通过点击活动查看详情获取）   也可将下面的 ics 地址加入其他日历软件中： ustclug.ics    ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/calendar/",
"teaser": null
},{
"title": "信息安全大赛",
"excerpt":"科大信息安全大赛自 2014 年起已经连续举办六届，往届比赛均顺利举行，规模盛大，影响甚广。每年的比赛在新生入学季举行，向新生倾斜，赛前有动员会，对基础较薄弱的同学进行一些指导，比赛题目控制难度梯度，强调引导和教育作用，除常规奖项外并设立新生特别奖、Ada 奖等奖项鼓励同学们参加竞赛。考虑到同学们课业负担较重，比赛为期一周，在线上举行。   相关链接            中国科学技术大学第六届信息安全大赛（2019）             中国科学技术大学第五届信息安全大赛（2018）             中国科学技术大学第四届信息安全大赛（2017）      ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/hackergame/",
"teaser": null
},{
"title": "LUG 活动",
"excerpt":"LUG 活动概述请移步 LUG首页。 LUG 的所有活动均依照 社团章程 开展。 欢迎订阅 LUG 日历。 2016 年及之后的活动不在这里重复记录小聚信息了，请移步每周小聚页面查看。 Latest Events 日期 时间 地点 内容 2020-09-26 19:00-21:30 西区 3C103 软件自由日活动 注意：LUD (Linux User Dinner) 均为自愿参加活动，活动费用由参加者分摊，不从社团任何经费报销。关于 LUG 的财务管理制度详情见：/wiki/lug/finance Previous Events 日期 时间 地点 内容 2020-06-07 14:30-15:45 线上直播 Linux 101 第七课 Video 2020-05-24 14:30-15:00 线上直播 Linux 101 第六课 Video...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/",
"teaser": null
},{
"title": "Linux Install Party",
"excerpt":"Linux Install Party 主旨在于推广和安装 Linux，宣传和鼓励开源和自由软件精神。活动可以让同学们亲身“无痛”体验 Linux 系统，在安装 Linux 环节有专人指导，同时可以交流了解 Linux 的相关知识。每次派对包含几个面向入门用户的讲座，手把手的安装，近距离的自由交流等环节。   历史活动      2010年Linux Install Party  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/lip/",
"teaser": null
},{
"title": "Linux User Party",
"excerpt":"Linux User Party 在于为不同层次的 Linux 用户提供一个交流的平台。每次活动都会请到一些有经验的资深用户分享相关的 Linux 使用经验，创造多种多样的交流方式与途径，为校内乃至整个合肥地区的 Linux 用户提供一个交流平台。   历史活动      2014 Linux User Party 暨 Freeshell 用户交流会   2013科大LUG Linux User Party   2012科大LUG Linux User Party  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/lup/",
"teaser": null
},{
"title": "LUG 活动海报",
"excerpt":"每周小聚展板模板      2015 白帽子信息安全竞赛      2015 LaTeX 讲座   2015_poster_clerk_ma.pdf   2014 Linux User Party     ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/poster/",
"teaser": null
},{
"title": "Software Freedom Day",
"excerpt":"自由软件日是在国际自由软件基金会（SFI）的领导下，由自由/开源软件爱好者自发筹集的非盈利性活动。旨在为自由/开源软件爱好者提供一个信息交流平台，以及联合各社区举办各种自由/开源软件活动。 科大 LUG 已经成功的连续几届举办了合肥站的自由软件日活动。活动得到了龙芯梦兰、龙芯俱乐部、中标软件、中科红旗、中国开源软件推进联盟、深度科技等公司、开源社区，以及合肥工业大学，安徽大学等兄弟院校的大力支持。活动邀请过多个在国内开源软件领域非常有影响力的嘉宾，如科大网络中心的张焕杰老师，北京 GUG 主席李震宁先生，上海 LUG 主席姚欣宇，从事 MIPS 开发的刘世伟先生等，带来了各种内容的主题演讲。 活动介绍 SFD，可译为“软件自由日”，顾名思义是对自由、开源软件的庆祝活动。USTC LUG 自2010年起每年举办合肥中科大站的自由软件日活动，获得了不错的效果，当然其中也离不开各个公司、兄弟院校、社团、社区的大力支持。 历史 SFD 活动记录 2020 年 SFD 2020 年 SFD 于 2020 年 9 月 26 日举办 时间: 2020 年 9 月 26 日(周六)晚上 7:00 地点: 中国科大西区 3C103 讲者 主题 资料 李威威 《PLCT 在 spike 和 qemu...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/sfd/",
"teaser": null
},{
"title": "LUG 每周小聚",
"excerpt":"我们曾经…… 我们曾经苦于学习 Linux 无门， 我们发现很棒的工具却难于上手， 我们想分享自己的心得却无人理会， 我们曾经四处询问却处处碰壁。 每周小聚！ 每周我们选定一个主题和一位主持， 与您一同分享使用 Linux 的心得体会， 群策群力解决令人抓耳挠腮的问题， 共同发扬 GNU 文化，提高 Linux 水平。 自 2011 年 10 月起，每个周末都有每周小聚活动，由一位同学做技术分享演讲，欢迎所有师生参与。具体时间、地点和内容会在周四发到邮件列表和瀚海星云BBS Notice/Linux 版上。 如果您希望讨论某个主题或主持小聚，欢迎加入 LUG 邮件列表 每周小聚的时间地点我们会通过 LUG 邮件列表、BBS Linux/Notice 版等处发出通知，请大家持续关注！ 每周小聚的资料在这里：https://ftp.lug.ustc.edu.cn/weekly_party/ Notice 主讲人请注意： 毋忘上传 slides，越早越好(在愿意分享 slides 的前提下) slides 的版权问题？ 在 BBS Linux 发通知时，注意打上 LUG 标签 尽早编辑本 wiki，活动时间以本...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/events/weeklyparty/",
"teaser": null
},{
"title": "LUG@USTC 财务收支报告",
"excerpt":"2018 年换届后的财务报告由 LUG 电子账册自动生成，不再人工更新。本页面只为历史存档目的保留。 Debian/OSS服务器维护专款 时间 收支类型 数额（￥） 原因 2005 收入 3072.5 科大Debian站募捐(其中50$按照当时汇率折合成人民币405.5元) 捐赠情况查询» 2005 支出 2620 购买新主机 2005 支出 70 购买显卡(二手) 2005 支出 260 购买新UPS电源 2005 支出 122.5 转入活动经费 2010年10月 收入 122.5 由活动经费转入 2011年1月 收入 303.11 社区捐助 方式：支付宝 当前结余（2013-01-05更新） - 425.61 - LUG 活动经费 往年收支情况概览 时间段 总收入 总支出 净收入...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/finance/archive/",
"teaser": null
},{
"title": "捐赠LUG",
"excerpt":"如果你喜欢 USTC LUG 并希望为协会发展提供经济上的援助，可以向我们捐赠。 为了准确记载捐赠情况、确保财务规范，捐赠后请 务必向 donate@ustclug.org 发送邮件 说明以下信息，并关注财务报告中的记载是否及时、一致！ 您捐款的 日期 、 途径 、 金额 您希望留下的 捐赠者名称 （亦可指定匿名。默认为捐款渠道中记载的转账人名称） 款项用途： 通用经费 或 服务器维护专款 （默认为通用经费） 服务器维护专款单立账户，仅用于维护重要网络服务。 通用经费主要用于社团日常采购和活动开支，不会用于联谊、餐饮等与社团宗旨无关的目的，在必要时可能会转入服务器维护专款账户。 我们不推荐没有经济来源的在校生向我们捐款。 支付宝 小额捐赠推荐使用支付宝转账功能向 LUG 的负责人账号转账： 支付宝账户名称： josiemyj@gmail.com 姓名： 邱子悦 捐赠后请务必按本页顶部要求发送邮件告知我们。 学生社团无法作为组织开立银行或支付宝账户，所以需要使用个人账户收款。此账户会随社团负责人变化而变动，请注意查询最新信息。 通过校友基金会捐赠 如果您身在海外，或者需要用于个税减免的捐赠收据，您可以通过中国科大校友基金会（USTCAF）的 LUG 子基金进行捐赠。请在捐赠页面中“子基金”栏目选择“AFund”，并在注释中标明“捐赠科大LUG”。 在线捐赠页面： https://www.ustcaf.org/members/donation/prep-form 捐赠后请务必按本页顶部要求发送邮件告知我们。 通过新创基金会捐赠 如果您的捐赠金额较大（500 元以上），或者需要取得捐赠收据用于个税减免，您可以通过中国科学技术大学新创校友基金会来进行捐赠。 关于个税减免的相关信息，请访问 http://www.ustcif.org.cn/default.php/content/1448 捐赠请访问新创基金会的捐赠页面：http://www.ustcif.org.cn/WaysToGive/ 在捐赠表格中，捐赠项目请选择“其它”，并在说明处注明“为科大...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/finance/donate/",
"teaser": null
},{
"title": "Debian/OSS服务器维护捐款信息",
"excerpt":"捐款人 捐款数额(收款人) 捐款日期 捐款方式 郑裕峰 50￥(傅收) 2005/06/20 银行汇款 李凯 50￥(郑收) 2005/06/21 直接递交 马奎 50￥(郑收) 2005/06/21 直接递交 王健 20￥(郑收) 2005/06/21 直接递交 李国强 50￥(郑收) 2005/06/22 直接递交 苏勇 300￥(郑收) 2005/06/22 直接递交 詹剑 100￥(郑收) 2005/06/23 直接递交 王研科, 俞丽珍 100￥(李收) 2005/06/ 直接递交 李东方 20￥(郑收) 2005/06/ 直接递交 肖磊 200￥(吴收) 2005/06/ 直接递交 姚淅伟 30￥(吴收) 2005/06/ 直接递交 黄仲婴...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/finance/donate_lookup/",
"teaser": null
},{
"title": "财务报告",
"excerpt":"捐赠记录 捐赠方式请见 LUG 官网。 本表记载 2018 年换届后的捐赠记录，根据 LUG 电子账册自动生成。 之前的记录见历史存档。 日期 捐赠者 数额 用途 正在加载…… ${i.date} ${i.payee} ${i.amount} ${i.account} 服务器维护专款 本表记载 2018 年换届后的服务器维护专款收支记录，根据 LUG 电子账册自动生成。 之前的记录见历史存档。 由于换届前的服务器维护专款支出情况记载不明，在此将 2018 年换届时的所有捐款余额均记为服务器维护专款。 日期 数额 事由 正在加载…… ${i.date} ${i.amount} ${i.payee} 通用经费 本表记载 2018 年换届后的通用经费收支记录，根据 LUG 电子账册自动生成。 之前的记录见历史存档。 日期 数额 事由 正在加载…… ${i.date} ${i.amount} ${i.payee}...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/finance/",
"teaser": null
},{
"title": "友情链接",
"excerpt":"合作伙伴 烧饼博客 Coding 云端开发平台 深度操作系统 Xtom 中国科学技术大学图书馆 中国科学技术大学网络信息中心 中国科学技术大学信息安全俱乐部 姊妹社团 清华大学 TUNA 协会 开源社区 瀚海星云 BBS Linux 讨论区 Arch Linux 中文社区 Fedora 中文社区 开源工场 各地 LUG 地区 邮件列表 Homepage 上海 Shanghai Linux User Group SHLUG 北京 Beijing GNU/Linux User Group BJLUG 成都 Chengdu Linux User Group CDLUG 重庆 Chongqing Linux...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/links/",
"teaser": null
},{
"title": "LUG邮件列表",
"excerpt":"USTC LUG中的技术交流和活动通知通常都在邮件列表中。如果没有加入邮件列表，怎么好意思说自己是USTC LUG的一员呢？ 邮件列表存档 USTC LUG邮件列表所有帖子都永久存档、公开可见： http://archive.lug.ustc.edu.cn/ http://dir.gmane.org/gmane.user-groups.linux.ustclug https://groups.google.com/forum/#!forum/ustc_lug 如何加入 加入邮件列表的方法很简单：发送一封邮件到 ustc_lug+subscribe AT googlegroups.com （请把AT替换成@）某些邮箱不支持邮箱地址中的加号“+”，此时推荐使用Gmail。 推荐使用Gmail ，它有两个优点： threading（线索）把一封邮件及其回复显示在同一页面。LUG邮件列表中的一个主题常常引发数十个回复，此时threading可以不使收件箱被“刷屏”。如果把科大邮箱比作瀚海星云BBS的普通模式，那么Gmail的线索就是BBS的“同主题阅读”模式，也是其他论坛的常用显示方式。 强大的过滤器（filter）和标签（tag）可以使你轻松对邮件进行分类。例如，我们可以对不同的邮件列表（如果您订阅了多个）应用不同的标签，还可以设置是否在“收件箱”内显示。 如果您需要使用科大邮箱，可以在科大邮箱中设置自动转发到Gmail，或者在Gmail中设置从科大邮箱定时POP3取信。这样只需登录 Gmail，就能同时收 Gmail 和科大邮箱的邮件了。 如何回复 直接回复就行了！回复会被发到 ustc_lug AT googlegroups.com，然后邮件列表的提供商 (Google) 会把这封邮件转发给所有加入邮件列表的人。新人发布回复时需要审核，请耐心等待。 细心的同学可能注意到了：“From”一栏填的是发件人的私人邮件地址啊，为什么回复会被送到邮件列表呢？那是因为邮件中设置了 Reply-To: ustc_lug AT googlegroups.com 。如果你在用 Gmail，可以用“Show Original”功能来了解邮件协议的更多信息。 尽量少用附件，以免占用收件人过多的邮箱空间。不要使用闭源格式的附件。如果需要附件，建议上传到 home.ustc.edu.cn 的个人主页空间或者 rec.ustc.edu.cn 的网盘空间，然后贴出链接。 尽量用纯文本，少用 HTML 格式（如果客户端支持的话） 回复较长的邮件时，引文应该选择性地引用，以便让其他人知道在评论的是哪一段。 对于比较严肃的技术讨论，请尽量不要转移话题。如果确实要离题，请发一个新主题，改标题为“新标题 (was: 原标题)”。...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/mailinglist/",
"teaser": null
},{
"title": "LUG 负责人",
"excerpt":"公共联系方式 联系我们 主要负责人 代号 职务 姓名 邮箱 CEO 执行会长 袁一玮 totoroyyw AT ustclug.org - 执行副会长 高泽豫 zeyugao AT ustclug.org - 执行副会长 李缙 - CTO 技术部部长 明宇龙 myl AT ustclug.org - 技术部副部长 罗丽薇 loliw AT ustclug.org CFO 财务部部长 邱子悦 xyy AT ustclug.org COO 运营部部长 罗丽薇 loliw AT ustclug.org CPO 资产部部长 胡清宇...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/person-in-charge/",
"teaser": null
},{
"title": "资源导航",
"excerpt":"本站其他内容   这里的链接都指向本站（非wiki）的其他内容。     LUG 官方内容   Linux 入门公开课（试验版）   Linux 入门公开课是2014年春社团活动的成果，包含当时社团成员的授课录像与演示文稿。   由于是第一次试验，内容多有不足，请多包涵。   LUG FTP   LUG FTP 是社团内部的 FTP 服务，主要用来存储历史文件、存放学习资料。LUG FTP 的用户名与密码均为 ftp。   LUG FTP 也可通过 HTTP 只读访问文件，请点这里。请注意 ebook 目录暂时不提供 HTTP 访问。     友情托管   winland0704 在 LUG 主页服务器上托管了以下两个文档项目。   openSUSE 非官方指南   openSUSE 非官方指南为官方指南的非正式中译版本，可供参考。   Qt 编程指南   Qt 编程指南 是作者正在写作中的一本书。    *[FTP]: File Transfer Protocol  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/resources/",
"teaser": null
},{
"title": "LUG@USTC FTP 文件存档",
"excerpt":"简介 LUG FTP 对应域名为 ftp.lug.ustc.edu.cn。 注意：直接在浏览器中输入这个域名可能会被识别为 FTP 协议。 这里存储社团历史活动资料的存档，以及一些与 Linux、开源软件、编程等计算机科学与技术相关的学习资料。 访问 使用 HTTP 协议 站点链接：https://ftp.lug.ustc.edu.cn 支持匿名只读访问。请注意部分目录无法使用 HTTP 访问。 使用 FTP 协议 站点链接：ftp://ftp.lug.ustc.edu.cn 不支持 FTP 匿名访问。用户须使用公开帐号登陆至服务器。 用户名为 ftp。请联系管理员以了解详细信息。 使用 SFTP 协议 用户名为 ftp。请联系管理员以了解详细信息。 使用 AFP 协议 AFP (Apple Filing Protocol) 地址： afp://ftp.lug.ustc.edu.cn/ ，选择 Connect As Guest 即可，对所有文件拥有读取权限。 上传 管理员用户 如需使用 FTP...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/services/ftp/",
"teaser": null
},{
"title": "GitLab",
"excerpt":"        如果你在做课程实验……项目代码往哪里放？                       如果你们是一个小团队……把代码放在哪里才方便成员访问，还能直观地看到项目的进展？                        如果你想拥有一套专业的项目管理系统，却不会搭建服务器……                   一切尽在 GitLab！这是一个神奇的软件，让我们在校园里也能享受像 GitHub 一样的代码托管和项目管理服务，不仅访问速度快，而且支持私有项目。   https://git.lug.ustc.edu.cn/    出于存储、运维压力等方面的考虑，自 2019 年 12 月 29 日起，此服务仅限科大校内用户注册。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/services/gitlab/",
"teaser": null
},{
"title": "网络服务列表",
"excerpt":"S 级服务 开源镜像站（HTTP 访问）：https://mirrors.ustc.edu.cn 权威 DNS：ns-a.ustclug.org. ns-b.ustclug.org. ns-c.ustclug.org. A 级服务 代码托管平台：https://git.lug.ustc.edu.cn 回校访问服务 防污染 DNS（校内） B 级服务 主页 (本wiki)：https://lug.ustc.edu.cn 网络启动：pxe.ustc.edu.cn 图书馆透明计算系统 VPN 在线申请系统（校内） 轻量级网络加速服务（校内） 开源镜像站（定时同步；rsync、FTP访问；帮助页面）：https://mirrors.ustc.edu.cn 反向代理：*.proxy.ustclug.org 服务器统一认证：ldap.lug.ustc.edu.cn 内网 VPN C 级服务 LUG FTP：https://ftp.lug.ustc.edu.cn 旧的 LUG Planet（社团博客）：https://planet.ustclug.org 旧的 LUG 新闻站：https://news.ustclug.org Grafana 监控：https://monitor.ustclug.org LDAP 配置管理系统（GOsa²） Ganglia 监控：https://status.ustclug.org 服务等级与服务标准 S 级：最优先保障服务可用性，24 小时故障监控，故障自动转移 A 级：优先保障服务可用性，24...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/services/",
"teaser": null
},{
"title": "图书馆查询机简介",
"excerpt":"图书馆查询机，顾名思义，是位于图书馆内的一些用来查询图书所在位置的计算机。USTC LUG 一直以来对图书馆查询机系统进行着操作系统及软件上的维护。   历史沿革   现状   使用指南   技术细节   图书馆查询机系统   Github 项目   查询机运行状况监控：图书馆查询机状态  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/services/lib/",
"teaser": null
},{
"title": "开源软件镜像服务",
"excerpt":"科大 LUG 自成立起便在 2003 年通过 BBS 网上筹款的方式搭建了当时教育网内极少数的几个 Debian GNU/Linux 的镜像源（debian.ustc.edu.cn），随后又在其上添加了 Ubuntu Linux 的镜像。2008年，借助吴峰光师兄捐助的机器，搭建了科大的开源镜像服务器（oss.ustc.edu.cn），以吸纳更多的开源软件和 Linux 发行版。尽管如此，我们的服务器仍然有些不堪重负，服务供不应求。   2010 年底，在网络中心张焕杰老师的帮助下，我们获得了新的服务器，遂将之前两个镜像站的资源以及张老师自己搭建的 CentOS Linux 镜像整合到一起，形成了“科大镜像站”（mirrors.ustc.edu.cn）。新网站正式对外发布时，好评如潮。随后我们又成功申请到了Debian GNU/Linux 的中国官方镜像资格认证等多个官方镜像资格认证。   我们将一如既往的做好镜像服务器的维护工作，争取为大家提供更新更好的服务，使参与维护的同学得到更好的锻炼。   详细介绍     mirrors 首页 科大源使用帮助  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/services/mirrors/",
"teaser": null
},{
"title": "网络启动服务",
"excerpt":"中国科学技术大学自2005年起，由 USTC LUG 发起，开始对校园网内提供网络启动服务（以下简称 PXE 服务）。校园网内的师生可以设置电脑通过网络引导启动，进行安装 Linux、体验 Linux、维护本机系统等操作，此外，东、西区图书馆的查询机系统亦是通过 PXE 启动引导。PXE 服务为校内师生带来了极大的便利。   随着我校网络设施的不断升级和发展，网络应用在科研工作和日常生活中发挥着日益重要的作用。同时，PXE相关的技术在这些年中也有了很大的发展，可以为大家提供更多更实用的服务。   PXE 服务使用简介  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/services/pxe/",
"teaser": null
},{
"title": "LUG 网络服务总则",
"excerpt":"〇、总则 中国科学技术大学 Linux 用户协会（下称 LUG 或“我们”）向中国科大师生和 Linux 社区提供了一系列网络服务。用户在使用 LUG 网络服务之前，应当仔细阅读并同意本文各项条款。 除非相关网络服务的服务条款特别说明，否则本文各项规则适用于 LUG 提供的所有网络服务。这些服务包括但不限于： USTC blog space OpenVZ 虚拟主机服务（Freeshell） 代码托管服务（GitLab） 虚拟专用网络服务（OpenVPN） 软件源镜像（Mirrors） 中国科学技术大学网络启动服务（PXE） Time Machine 服务（TimeMachine） 用户开始使用 LUG 网络服务时，即视为无条件同意本规则和其他相关条款。 一、服务承诺 LUG 及其成员的行为受中华人民共和国法律法规、中国科学技术大学校规校纪的约束。 LUG 网络服务均为非营利性，我们不会以任何名义向用户强制收取任何费用。 我们会尽力保证服务稳定，但不对服务质量作任何保证。 我们承诺不会主动将用户提交的隐私数据泄露给第三方，用户隐私受到法律保护。 对用户通过 LUG 网络服务发表的合法原创内容，其著作权属于用户。 当 LUG 网络服务出现重大变更时，我们会通过用户提供的联系方式通知用户。 二、用户义务 用户不得利用 LUG 服务从事任何违反中华人民共和国法律法规、中国科学技术大学校规校纪和社会公共道德的活动。 未经 LUG 管理人员允许，用户不得利用 LUG 服务进行任何营利性活动。...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/services/rules/",
"teaser": null
},{
"title": "LUG 宣传账号一览",
"excerpt":"LUG1) 已在各个平台上建立了宣传用账号。本页面旨在对 SNS 账号使用情况及信息交流平台进行一定的整理。 正在维护 平台/账号类型 启用时间 名称 维护者 备注 Google groups ? ustc_lug@googlegroups.com 李博杰   IRC 2014-04-01 #ustc_lug 朱晟菁(zhsj) Freenode QQ 群 2014-03-31 USTC_Linux 崔灏 号码：334011318 QQ 群 2015-05-27 USTC Linux User Group 崔灏 号码：640650279，限实名校内学生，暂为邀请制           Twitter 2010-10-28 @ustclug 杨博远   Google+ 信息页 2014-08-24 USTC...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/lug/sns/",
"teaser": null
},{
"title": "开源镜像使用帮助列表",
"excerpt":"此处的帮助文档已经废弃，新的内容请访问 https://mirrors.ustc.edu.cn/help/     科大镜像源使用帮助由科大 LUG 成员与许多热心的朋友们共同编写。   本页面及各镜像源帮助页面源代码现托管在 GitHub 上，欢迎各位协助完善。 如果您有添加新镜像的建议与需求，请在 GitHub 上提交 issue.     科大开源软件镜像服务简介  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/",
"teaser": null
},{
"title": "Alpine Linux 镜像源使用帮助",
"excerpt":"收录架构           armhf            x86            x86_64       使用说明   编辑/etc/apk/repositories，然后在文件的最顶端添加(注意将3.3换成需要的版本)   http://mirrors.ustc.edu.cn/alpine/v3.3/main/   参考wiki   相关链接           官方主页: http://alpinelinux.org/            邮件列表: http://www.archlinux.org/mailman/listinfo/            论坛: http://forum.alpinelinux.org/forum            Wiki: http://wiki.alpinelinux.org/      ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/alpine/",
"teaser": null
},{
"title": "AOSC OS 镜像源使用帮助",
"excerpt":"anthon 为 AnthonOS 项目的官方源 http://repo.anthonos.org 的镜像。 快速设置 考虑到安同的系统情况可能时有改动，并且源也不少，我们就偷个懒： anthon-apt.sh # AOSC OSes, apt-dpkg cat /etc/apt/sources.list | egrep 'mirror|repo' | sed -r -e 's@(mirror|repo).anthonos.org@mirrors.ustc.edu.cn/anthon@g' &gt;&gt; /etc/apt/sources.list 如果你只想用 USTC 镜像的话，勇敢地把 &gt;&gt; 改成 &gt; 吧。由于 AOSC OS3 yum 暂时没有 fastestmirror，你需要做一些砍手的工作： anthon-yum.sh # AOSC OS3, yum-rpm sudo sed -r -e -i.orig 's@(mirror|repo).anthonos.org@mirrors.ustc.edu.cn/anthon@g' /etc/yum/repos.d/aosc.repo 接下来是分系统信息：...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/anthon/",
"teaser": null
},{
"title": "AOSP(Android) 镜像使用帮助",
"excerpt":"初始同步方法1 第一次同步数据量特别大，如果网络不稳定，中间失败就要从头再来了。所以我们提供了打包的 AOSP 镜像，为一个 tar 包，大约 16G（单文件 16G，注意你的磁盘格式要支持）。这样你 就可以通过 HTTP 的方式下载，该方法支持断点续传。 下载地址 http://mirrors.ustc.edu.cn/aosp-monthly/ 请注意对比 checksum。 然后根据下文 已有仓库如何改用科大源 的方法更改同步地址。 解压后用命令 repo sync 就可以把代码都 checkout 出来。 Note: tar包为定时从 https://mirrors.tuna.tsinghua.edu.cn/aosp-monthly/ 下载。 初始同步方法2 按照 Google 官方教程 https://source.android.com/source/downloading.html 将 https://android.googlesource.com/platform/manifest 替换为 git://mirrors.ustc.edu.cn/aosp/platform/manifest 。 具体做法摘录如下（以防墙抽风）： 首先下载 repo 工具。 mkdir ~/bin PATH=~/bin:$PATH curl https://storage.googleapis.com/git-repo-downloads/repo &gt; ~/bin/repo ##...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/aosp/",
"teaser": null
},{
"title": "archive.raspberrypi.org",
"excerpt":"修改/etc/apt/sources.list.d/raspi.list为以下内容   raspi.list   deb https://mirrors.ustc.edu.cn/archive.raspberrypi.org/ jessie main ui  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/archive.raspberrypi.org/",
"teaser": null
},{
"title": "Arch Linux 镜像使用帮助",
"excerpt":"收录架构   i686   x86_64   收录版本   ALL   使用说明   编辑/etc/pacman.d/mirrorlist，先注释掉里面的所有行，然后在文件的最顶端添加   mirrorlist   Server = http://mirrors.ustc.edu.cn/archlinux/$repo/os/$arch   相关链接   官方主页: http://www.archlinux.org/   邮件列表: http://www.archlinux.org/mailman/listinfo/   论坛: http://bbs.archlinux.org/   Wiki: http://wiki.archlinux.org/  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/archlinux/",
"teaser": null
},{
"title": "Arch Linux ARM 镜像使用帮助",
"excerpt":"Arch Linux ARM 是针对ARM架构移植的 Arch Linux 发行版。您可以使用它的默认镜像源 http://mirror.archlinuxarm.org/ ，它会自动解析到离用户较近的镜像，也可以手动设置我们的镜像源。   收录架构           ARMv5            ARMv6            ARMv7            AArch64       快速设置   编辑 /etc/pacman.d/mirrorlist ，先注释掉里面的所有行，然后在文件的最顶端添加   mirrorlist   Server = https://mirrors.ustc.edu.cn/archlinuxarm/$arch/$repo   相关链接           官方主页 http://archlinuxarm.org/            Github https://github.com/archlinuxarm            论坛 http://archlinuxarm.org/forum/            FAQ http://archlinuxarm.org/support/faq            镜像列表 http://archlinuxarm.org/about/mirrors       ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/archlinuxarm/",
"teaser": null
},{
"title": "Archlinux CN 镜像源使用帮助",
"excerpt":"简介   Arch Linux 中文社区仓库是由 Arch Linux 中文社区驱动的非官方用户仓库。包含中文用户常用软件、工具、字体/美化包等。   仓库地址：repo.archlinuxcn.org   该仓库地址可能会根据你所在的网络环境自动选择镜像源地址。   使用方法   在 /etc/pacman.conf 文件末尾添加两行：   [archlinuxcn] Server = https://mirrors.ustc.edu.cn/archlinuxcn/$arch   然后请安装 archlinuxcn-keyring 包以导入 GPG key。   相关链接   Arch Linux 中文社区主页： https://www.archlinuxcn.org   Arch Linux 中文社区仓库 / 镜像加速源介绍： https://www.archlinuxcn.org/archlinux-cn-repo-and-mirror/  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/archlinuxcn/",
"teaser": null
},{
"title": "BlackArch 镜像源使用帮助",
"excerpt":"简介   BlackArch 是一款基于 ArchLinux 的为渗透测试及安全研究人员开发的发行版, 相当于 Arch 版的 BackTrack/Kali。   仓库地址：blackarch.org/blackarch/   收录架构   i686   x86_64   ARMv6/7   使用方法   在 /etc/pacman.conf 文件末尾添加两行：   [blackarch] SigLevel = Optional TrustAll Server = https://mirrors.ustc.edu.cn/blackarch/$repo/os/$arch   相关链接   BlackArch 主页： http://blackarch.org   收录的工具列表： http://blackarch.org/tools.html  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/blackarch/",
"teaser": null
},{
"title": "替换及重置Homebrew默认源",
"excerpt":"替换brew.git:     cd “$(brew –repo)”     git remote set-url origin https://mirrors.ustc.edu.cn/brew.git   替换homebrew-core.git: cd \"$(brew --repo)/Library/Taps/homebrew/homebrew-core\" git remote set-url origin https://mirrors.ustc.edu.cn/homebrew-core.git   替换Homebrew Bottles源: 参考:替换Homebrew Bottles源   在中科大源失效或宕机时可以： 1. 使用清华源设置参考。 2. 切换回官方源：   重置brew.git: cd \"$(brew --repo)\" git remote set-url origin https://github.com/Homebrew/brew.git  重置homebrew-core.git: cd \"$(brew --repo)/Library/Taps/homebrew/homebrew-core\" git remote set-url origin https://github.com/Homebrew/homebrew-core.git   注释掉bash配置文件里的有关Homebrew Bottles即可恢复官方源。 重启bash或让bash重读配置文件。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/brew.git/",
"teaser": null
},{
"title": "替换及重置Homebrew默认源",
"excerpt":"替换brew.git:     cd “$(brew –repo)”     git remote set-url origin https://mirrors.ustc.edu.cn/brew.git   替换homebrew-core.git: cd \"$(brew --repo)/Library/Taps/homebrew/homebrew-core\" git remote set-url origin https://mirrors.ustc.edu.cn/homebrew-core.git   替换Homebrew Bottles源: 参考:替换Homebrew Bottles源   在中科大源失效或宕机时可以： 1. 使用清华源设置参考。 2. 切换回官方源：   重置brew.git: cd \"$(brew --repo)\" git remote set-url origin https://github.com/Homebrew/brew.git  重置homebrew-core.git: cd \"$(brew --repo)/Library/Taps/homebrew/homebrew-core\" git remote set-url origin https://github.com/Homebrew/homebrew-core.git   注释掉bash配置文件里的有关Homebrew Bottles即可恢复官方源。 重启bash或让bash重读配置文件。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/brew/",
"teaser": null
},{
"title": "Centos镜像使用帮助",
"excerpt":"收录架构 i386 x86_64 收录版本 5 6 7 使用说明 首先备份CentOS-Base.repo mv /etc/yum.repos.d/CentOS-Base.repo /etc/yum.repos.d/CentOS-Base.repo.backup 下载对应版本的CentOS-Base.repo, 放入/etc/yum.repos.d/ 这是CentOS 5的: CentOS-Base.repo # CentOS-Base.repo # # The mirror system uses the connecting IP address of the client and the # update status of each mirror to pick mirrors that are updated to and # geographically...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/centos/",
"teaser": null
},{
"title": "Chakra Linux 镜像使用帮助",
"excerpt":"收录架构   x86_64   收录版本   ALL   使用说明   编辑/etc/pacman.d/mirrorlist，先注释掉里面的所有行，然后在文件的最顶端添加     Server = http://mirrors.ustc.edu.cn/chakra/$repo/$arch   相关链接   官方主页: http://chakraos.org/home/   论坛: http://chakraos.org/forum/   Wiki: http://chakraos.org/wiki/  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/chakra/",
"teaser": null
},{
"title": "CPAN镜像使用帮助",
"excerpt":"使用说明 若你以前从未使用过CPAN，请在命令行下运行cpan Would you like me to automatically choose some CPAN mirror sites for you? (This means connecting to the Internet) [yes] 此处输入no Would you like to pick from the CPAN mirror list? [yes] 此处直接回车 You should select more than one (just in case the first isn't available). (1) Africa...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/cpan/",
"teaser": null
},{
"title": "CRAN镜像使用帮助",
"excerpt":"使用说明   在第一次执行install.package(“xxx”)时会弹出窗口让你选择镜像，此时选择China Hefei即可   也可以通过chooseCRANmirror()来打开窗口   相关链接           官方主页：http://cran.r-project.org/            FAQ：http://cran.r-project.org/faqs.html            文档：http://cran.r-project.org/doc/      ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/cran/",
"teaser": null
},{
"title": "CTeX 套装镜像使用帮助",
"excerpt":"CTeX 套装简介 （摘自 ctex.org 官方网站） CTeX 中文套装是基于 Windows 下的 MiKTeX 系统，集成了编辑器 WinEdt 和 PostScript 处理软件 Ghostscript 和 GSview 等主要工具。 CTeX 中文套装在 MiKTeX 的基础上增加了对中文的完整支持。 CTeX 中文套装支持 CJK, xeCJK, CCT, TY 等多种中文 TeX 处理方式。 注：请勿混淆 CTeX 套装与 CTeX 宏集。前者是基于 Windows 平台的 TeX 发行版，后者是跨平台、跨发行版、跨 TeX 引擎的 LaTeX 宏包集合。 使用方式 直接下载最新版的 .exe 文件安装即可。安装前请务必校验散列值和数字签名。 unstable...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/ctex/",
"teaser": null
},{
"title": "Debian Backports镜像使用帮助",
"excerpt":"注意：新版本 Debian Backports 已并入主源，单独的 debian-backports 目录只为兼容性保留。如需了解如何使用 debian-backports ，请参阅官方文档。     收录架构           i386            amd64            source       收录版本   stable-backports   使用说明   以Squeeze为例, 编辑/etc/apt/sources.list文件, 在文件最前面添加以下条目(操作前请做好相应备份)   deb http://mirrors.ustc.edu.cn/debian-backports/ squeeze-backports main contrib non-free deb-src http://mirrors.ustc.edu.cn/debian-backports/ squeeze-backports main contrib non-free   相关链接           官方主页: http://backports.debian.org/            邮件列表: http://backports.debian.org/Mailinglists/            镜像列表: http://backports.debian.org/Mirrors/      ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/debian-backports/",
"teaser": null
},{
"title": "Debian Multimedia镜像使用帮助",
"excerpt":"收录架构 i386 amd64 source 收录版本 stable unstable oldstable testing experimental 使用说明 以 Debian 8 “Jessie” 为例, 编辑/etc/apt/sources.list文件, 在文件最前面添加以下条目(操作前请做好相应备份) sources.list deb http://mirrors.ustc.edu.cn/debian-multimedia/ jessie main non-free deb-src http://mirrors.ustc.edu.cn/debian-multimedia/ jessie main non-free deb http://mirrors.ustc.edu.cn/debian-multimedia/ jessie-backports main deb-src http://mirrors.ustc.edu.cn/debian-multimedia/ jessie-backports main 如果遇到 GPG error，你可能需要手动更新 deb-multimedia-keyring，以下摘自 debian multimedia 首页： 06/02/2015 : Maybe I went too...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/debian-multimedia/",
"teaser": null
},{
"title": "Debian Security镜像使用帮助",
"excerpt":"收录架构 i386 amd64 source 收录版本 stable testing 使用说明 操作前请做好相应备份 一般情况下，更改 /etc/apt/sources.list 文件中 Debian Security 默认的源地址 http://security.debian.org/ 为 https://mirrors.ustc.edu.cn/debian-security 即可。 可以使用如下命令： sudo sed -i 's/security.debian.org/mirrors.ustc.edu.cn\\/debian-security/g' /etc/apt/sources.list 以 Jessie 为例, 编辑/etc/apt/sources.list文件, 在文件最前面添加以下条目(操作前请做好相应备份) sources.list deb http://mirrors.ustc.edu.cn/debian-security/ jessie/updates main non-free contrib deb-src http://mirrors.ustc.edu.cn/debian-security/ jessie/updates main non-free contrib 相关链接 官方主页: http://www.debian.org/ 邮件列表: http://www.debian.org/support#mail_lists Wiki: http://wiki.debian.org/...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/debian-security/",
"teaser": null
},{
"title": "Debian镜像使用帮助",
"excerpt":"收录架构 作为官方源之一，与 Debian 上游保持相同 收录版本 与 Debian 上游保持相同 使用说明 操作前请做好相应备份 一般情况下，更改 /etc/apt/sources.list 文件中 Debian 默认的源地址 http://httpredir.debian.org 为 http://mirrors.ustc.edu.cn 即可。 Debian 的默认源地址可能依情况而不同，请注意更改 httpredir.debian.org 为合适的地址。 可以使用如下命令： sudo sed -i 's/httpredir.debian.org/mirrors.ustc.edu.cn/g' /etc/apt/sources.list 也可以直接编辑，以 Jessie 为例，编辑 /etc/apt/sources.list 文件，在文件最前面添加以下条目 sources.list deb http://mirrors.ustc.edu.cn/debian stable main contrib non-free deb-src http://mirrors.ustc.edu.cn/debian stable main contrib non-free deb http://mirrors.ustc.edu.cn/debian stable-proposed-updates...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/debian/",
"teaser": null
},{
"title": "Docker 镜像使用帮助",
"excerpt":"使用说明 新版的 Docker 使用 /etc/docker/daemon.json（Linux） 或者 %programdata%\\docker\\config\\daemon.json（Windows） 来配置 Daemon。 请在该配置文件中加入（没有该文件的话，请先建一个）： { \"registry-mirrors\": [\"https://docker.mirrors.ustc.edu.cn\"] } Docker Daemon configuration file 文档： https://docs.docker.com/engine/reference/commandline/dockerd/#/daemon-configuration-file Docker for Windows 文档: https://docs.docker.com/docker-for-windows/#/docker-daemon 以下是一些过时的配置方法 在 Docker 的启动参数中加入: --registry-mirror=https://docker.mirrors.ustc.edu.cn Ubuntu 用户（包括使用 systemd 的 Ubuntu 15.04）可以修改 /etc/default/docker 文件，加入如下参数： DOCKER_OPTS=\"--registry-mirror=https://docker.mirrors.ustc.edu.cn\" 其他 systemd 用户可以通过执行 sudo systemctl edit docker.service 来修改设置, 覆盖默认的启动参数: [Service] ExecStart=...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/docker/",
"teaser": null
},{
"title": "Dotdeb镜像使用帮助",
"excerpt":"使用说明 1. 添加下面两行到 /etc/apt/sources.list ，并将 jessie 替换为自己所使用的版本名称： deb http://mirrors.ustc.edu.cn/dotdeb jessie all deb-src http://mirrors.ustc.edu.cn/dotdeb jessie all 2. 可选项： 如果你想在Debian Squeeze上安装PHP5.4的话，再添加下面这两行： deb http://mirrors.ustc.edu.cn/dotdeb squeeze-php54 all deb-src http://mirrors.ustc.edu.cn/dotdeb squeeze-php54 all 如果你想在Debian Wheezy上安装未启用Zend Thread Safety的PHP5.6的话，再添加下面这两行： deb http://mirrors.ustc.edu.cn/dotdeb wheezy-php56 all deb-src http://mirrors.ustc.edu.cn/dotdeb wheezy-php56 all 如果你想在Debian Wheezy上安装启用Zend Thread Safety的PHP5.6的话，再添加下面这两行： deb http://mirrors.ustc.edu.cn/dotdeb wheezy-php56-zts all deb-src http://mirrors.ustc.edu.cn/dotdeb wheezy-php56-zts...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/dotdeb/",
"teaser": null
},{
"title": "Eclipse 镜像使用帮助",
"excerpt":"使用科大镜像更新插件   以 Luna 为例，点击 Help → Install New Software... → Available Software Sites 可以看到所有的更新源，将其中的 download.eclipse.org 全部替换成 mirrors.ustc.edu.cn/eclipse 即可。   基本配置   Vim-like 快捷键绑定   See http://vrapper.sourceforge.net/home/   离线 Java API   See http://stackoverflow.com/questions/4664007/off-line-java-api-documentation-in-eclipse   参考资料   http://www.webupd8.org/2014/03/how-to-install-oracle-java-8-in-debian.html  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/eclipse/",
"teaser": null
},{
"title": "EPEL镜像使用帮助",
"excerpt":"收录架构 i386 amd64 SRPMS ppc64 使用说明 此源适用于Red Hat, CentOS, Scientific Linux版本5和6 若存在则先备份/etc/yum.repos.d/epel.repo和/etc/yum.repos.d/epel-testing.repo 下载下面的两个文件到/etc/yum.repos.d/ epel.repo [epel] name=Extra Packages for Enterprise Linux 6 - $basearch baseurl=http://mirrors.ustc.edu.cn/epel/6/$basearch #mirrorlist=https://mirrors.fedoraproject.org/metalink?repo=epel-6&amp;arch=$basearch failovermethod=priority enabled=1 gpgcheck=1 gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-EPEL-6   [epel-debuginfo] name=Extra Packages for Enterprise Linux 6 - $basearch - Debug baseurl=http://mirrors.ustc.edu.cn/epel/6/$basearch/debug #mirrorlist=https://mirrors.fedoraproject.org/metalink?repo=epel-debug-6&amp;arch=$basearch failovermethod=priority enabled=0 gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-EPEL-6 gpgcheck=1   [epel-source] name=Extra...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/epel/",
"teaser": null
},{
"title": "Fedora镜像使用帮助",
"excerpt":"收录架构 i686 x86_64 收录版本 所有仍在支持的版本 最新测试版本 使用说明 将以下保存为 fedora-ustc.repo fedora-ustc.repo [fedora] name=Fedora $releasever - $basearch - ustc failovermethod=priority baseurl=http://mirrors.ustc.edu.cn/fedora/releases/$releasever/Everything/$basearch/os/ #mirrorlist=https://mirrors.fedoraproject.org/metalink?repo=fedora-$releasever&amp;arch=$basearch enabled=1 metadata_expire=7d gpgcheck=1 gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-fedora-$basearch   [fedora-debuginfo] name=Fedora $releasever - $basearch - Debug - ustc failovermethod=priority baseurl=http://mirrors.ustc.edu.cn/fedora/releases/$releasever/Everything/$basearch/debug/ #mirrorlist=https://mirrors.fedoraproject.org/metalink?repo=fedora-debug-$releasever&amp;arch=$basearch enabled=0 metadata_expire=7d gpgcheck=1 gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-fedora-$basearch   [fedora-source] name=Fedora $releasever - Source - ustc failovermethod=priority...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/fedora/",
"teaser": null
},{
"title": "FreeBSD 镜像使用方法",
"excerpt":"此页面已过期。请移步 https://mirrors.ustc.edu.cn/help/freebsd.html 关于 FreeBSD pkgng 源，根据官方说明， FreeBSD 不允许同步软件包，我们尊重 FreeBSD 的选择，不提供 pkgng 镜像。 Due to very high requirements of bandwidth, storage and adminstration the FreeBSD Project has decided not to allow public mirrors of packages. FreeBSD 项目暂时不再接受新站点成为官方镜像源，且不向第三方镜像站点提供 pkgng 同步接口。因此，我们无法及时可靠地从官方站点同步数据。 目前我们仍会同步 FreeBSD 部分内容，但不包含 pkgng 中的软件包。 鉴于以上原因，我们不建议您使用科大镜像站提供的内容。建议您使用官方支持的镜像源。您可以在 https://www.freebsd.org/doc/handbook/eresources-web.html 找到官方镜像站的列表。 我们并非 FreeBSD 的官方源，所同步的文件受到非官方上游的限制。使用请自行承担风险。 使用说明...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/freebsd/",
"teaser": null
},{
"title": "Gentoo-Portage镜像使用帮助",
"excerpt":"收录架构   收录版本   使用说明   旧的 SYNC 方式已不推荐使用，建议使用新的 repos.conf   官网wiki：https://wiki.gentoo.org/wiki//etc/portage/repos.conf   单文件方式   新建或修改 /etc/portage/repos.conf ：   /etc/portage/repos.conf   [DEFAULT] main-repo = gentoo   [gentoo] location = /usr/portage sync-type = rsync sync-uri = rsync://rsync.mirrors.ustc.edu.cn/gentoo-portage/ auto-sync = yes   相关链接   官方主页: http://www.gentoo.org/   邮件列表: http://www.gentoo.org/main/en/lists.xml   论坛: http://forums.gentoo.org/   文档: http://www.gentoo.org/doc/en/   Wiki: http://wiki.gentoo.org/   镜像列表: http://www.gentoo.org/main/en/mirrors-rsync.xml  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/gentoo-portage/",
"teaser": null
},{
"title": "Gentoo镜像使用帮助",
"excerpt":"收录架构   收录版本   使用说明   在/etc/portage/make.conf中添加或修改：   GENTOO_MIRRORS=\"http://mirrors.ustc.edu.cn/gentoo/\"   相关链接   官方主页: http://www.gentoo.org/   邮件列表: http://www.gentoo.org/main/en/lists.xml   论坛: http://forums.gentoo.org/   文档: http://www.gentoo.org/doc/en/   Wiki: http://wiki.gentoo.org/   镜像列表: http://www.gentoo.org/main/en/mirrors2.xml  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/gentoo/",
"teaser": null
},{
"title": "Homebrew Bottles源",
"excerpt":"Homebrew Bottles是Homebrew提供的二进制代码包，目前镜像站收录了以下仓库：           homebrew/homebrew-core            homebrew/homebrew-dupes            homebrew/homebrew-games            homebrew/homebrew-gui            homebrew/homebrew-python            homebrew/homebrew-php            homebrew/homebrew-science            homebrew/homebrew-versions            homebrew/homebrew-x11       使用方法   对于bash用户：   echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.ustc.edu.cn/homebrew-bottles' &gt;&gt; ~/.bash_profile source ~/.bash_profile   对于zsh用户   echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.ustc.edu.cn/homebrew-bottles' &gt;&gt; ~/.zshrc source ~/.zshrc   更多说明  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/homebrew-bottles/",
"teaser": null
},{
"title": "homebrew-core源",
"excerpt":"homebrew-core是Homebrew的核心软件仓库，收录了大部分的常用软件。   使用方法   替换和重置Homebrew源  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/homebrew-core.git/",
"teaser": null
},{
"title": "Homebrew",
"excerpt":"该镜像已过期，新镜像在这里。请不要使用这个镜像，除非你完全清楚你在做什么。   替换homebrew默认源   cd /usr/local git remote set-url origin git://mirrors.ustc.edu.cn/homebrew.git  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/homebrew/",
"teaser": null
},{
"title": "infinality bundle 镜像使用帮助",
"excerpt":"使用方法   请在 /etc/pacman.conf 里根据需要添加：   [infinality-bundle] Server = http://mirrors.ustc.edu.cn/infinality-bundle/$arch   [infinality-bundle-multilib] Server = http://mirrors.ustc.edu.cn/infinality-bundle/multilib/$arch   [infinality-bundle-fonts] Server = http://mirrors.ustc.edu.cn/infinality-bundle/fonts   如果在更新过程中遇到了签名错误, 您可以选择设置 SigLevel = Optional TrustAll , 或者通过执行以下命令导入公钥来解决   # pacman-key -r 962DDE58 # pacman-key --lsign-key 962DDE58 # pacman -Syy   相关链接   官方主页: http://bohoomil.com/   ArchWiki: https://wiki.archlinux.org/index.php/Infinality  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/infinality-bundle/",
"teaser": null
},{
"title": "Kali镜像使用帮助",
"excerpt":"Kali，是Backtrack 5后续更新版本，它的作用大家都懂。 这里收录了最新的更新。 安装镜像下载地址：http://mirrors.ustc.edu.cn/kali-images/kali-latest/ 支持的系统架构 amd64 armel armhf i386 使用说明 以 1.1.0版本为例, 编辑 /etc/apt/sources.list 文件, 在文件最前面添加以下条目： 使用ipv6网络添加如下内容 deb http://mirrors6.ustc.edu.cn/kali kali main non-free contrib deb-src http://mirrors6.ustc.edu.cn/kali kali main non-free contrib deb http://mirrors6.ustc.edu.cn/kali-security kali/updates main contrib non-free 使用ipv4网络添加如下内容 deb http://mirrors.ustc.edu.cn/kali kali main non-free contrib deb-src http://mirrors.ustc.edu.cn/kali kali main non-free contrib deb http://mirrors.ustc.edu.cn/kali-security...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/kali/",
"teaser": null
},{
"title": "KDE 镜像使用帮助",
"excerpt":"一般来说，你无需阅读此帮助。因为KDE的官网会自动将一些软件的下载定向到中国科大的镜像。   KDE for Windows   点击这里可以下载到最新的 KDE for Windows installer。   双击这个安装器，只要在接下来的安装界面中添加 http://mirrors.ustc.edu.cn/kde 作为下载源，就可以完全用科大镜像下载 KDE 的软件了。   参考   https://techbase.kde.org/Projects/KDE_on_Windows/Installation  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/kde/",
"teaser": null
},{
"title": "kdemod镜像使用帮助",
"excerpt":"收录架构   i686   x86_64   收录版本   ALL   使用说明   最新版的Chakra已经默认添加了我们的源   注意   此源不能用于Archlinux   相关链接   官方主页: http://chakra-linux.org//   Wiki: http://chakra-linux.org/wiki  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/kdemod/",
"teaser": null
},{
"title": "Kodi镜像使用帮助",
"excerpt":"镜像目录结构 addons 官方插件库 apt iOS 版 Kodi 安装源 build-deps 编译 Kodi 依赖的其他开源项目代码 nightlies 与 Kodi 开发主分支同步编译的每日开发版安装包下载目录 releases Kodi 稳定版安装包下载目录（含 Beta 版和 RC 版） snapshots Kodi 每月发布的 Alpha 版安装包下载目录 tools Kodi 相关的工具软件（Kora 遥控软件） Kodi简介 Kodi（前身是 XBMC）媒体中心，是一个屡获殊荣的自由和开源的跨平台媒体播放器和用于 HTPC（Home theater PC，家庭影院 PC）的数字媒体娱乐中心软件。它使用遥控器作为主输入设备，针对3米左右观看距离而设计的用户界面，成为适应客厅使用的媒体播放器。它的图形用户界面让用户轻按遥控，就能方便地从硬盘、光盘、局域网和互联网浏览和观看视频、图片，收听广播和音乐。Kodi 项目由非营利的 XBMC 基金会管理，并由分布在世界各地的志愿者参与开发。自从它于2003年诞生以来，超过500名软件开发人员对 Kodi 作出贡献，并有60名核心开发人员。另外，还有200多名翻译人员在帮助它扩大影响范围，使它支持多达72种语言。 Kodi（当时叫“Xbox Media Center”）最初是作为第一代 Xbox 游戏机（现在已不支持）的一个媒体中心应用而开发的，而现在已经正式以原生应用运行于 Android、Linux、Mac...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/kodi/",
"teaser": null
},{
"title": "Linux 内核源码镜像",
"excerpt":"其 Git 仓库的链接为git://mirrors.ustc.edu.cn/linux.git。   断点续传   由于git clone不支持断点续传，所以可以使用支持断点续传的git fetch。一个简单的步骤如下所示，请按自己的需求酌情更改：   mkdir linux &amp;&amp; cd linux git init git fetch git://mirrors.ustc.edu.cn/linux.git git checkout FETCH_HEAD  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/linux.git/",
"teaser": null
},{
"title": "Linux 内核源码镜像",
"excerpt":"其 Git 仓库的链接为 git://mirrors.ustc.edu.cn/linux.git 。   断点续传   由于 git clone 不支持断点续传，所以可以使用支持断点续传的 git fetch 。一个简单的步骤如下所示，请按自己的需求酌情更改：   mkdir linux &amp;&amp; cd linux git init git fetch git://mirrors.ustc.edu.cn/linux.git git checkout FETCH_HEAD  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/linux/",
"teaser": null
},{
"title": "Linux Mint镜像使用帮助",
"excerpt":"收录架构           i386            amd64       收录版本           elyssa            felicia            gloria            helena            isadora            julia            katya            lisa            maya            nadia       使用说明   打开Software Manager，点击Edit⇒Software Sources   在Download from中选择Other   选择China⇒mirrors.ustc.edu.cn   点击Choose Server   相关链接      官方主页：http://www.linuxmint.com/  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/linuxmint/",
"teaser": null
},{
"title": "MariaDB 镜像源使用帮助",
"excerpt":"支持发行版 所有官方支持的发行版 收录版本 所有官方支持的版本 使用说明 Fedora, CentOS, Red Hat 使用 MariaDB Repository Configuration Tool 生成一份配置，保存为 /etc/yum.repos.d/mariadb.repo 然后执行以下命令替换源地址： sudo sed -i 's#yum.mariadb.org#mirrors.ustc.edu.cn/mariadb/yum#' /etc/yum.repos.d/mariadb # 建议使用 HTTPS sudo sed -i 's#http://mirrors.ustc.edu.cn#https://mirrors.ustc.edu.cn#g' /etc/yum.repos.d/mariadb 若安装时遇到错误 “Failed to connect to 2001:da8:d800:95::110: Network is unreachable”，将源地址中的 mirrors.ustc.edu.cn 替换为 ipv4.mirrors.edu.cn 以强制使用 IPv4： sudo sed -i 's#//mirrors.ustc.edu.cn#//ipv4.mirrors.ustc.edu.cn#g' /etc/yum.repos.d/mariadb Mint,...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/mariadb/",
"teaser": null
},{
"title": "MSYS2 镜像使用帮助",
"excerpt":"收录架构           MINGW: i686, x86_64            MSYS: i686, x86_64       获取基本组件包   请访问该镜像目录下的 distrib/ 目录（x86_64、i686），找到名为 msys2-&lt;架构&gt;-&lt;日期&gt;.exe 的文件（如 msys2-x86_64-20141113.exe），下载安装即可。   pacman 的配置   编辑 /etc/pacman.d/mirrorlist.mingw32 ，在文件开头添加：     Server = http://mirrors.ustc.edu.cn/msys2/mingw/i686   编辑 /etc/pacman.d/mirrorlist.mingw64 ，在文件开头添加：     Server = http://mirrors.ustc.edu.cn/msys2/mingw/x86_64   编辑 /etc/pacman.d/mirrorlist.msys ，在文件开头添加：     Server = http://mirrors.ustc.edu.cn/msys2/msys/$arch   然后执行 pacman -Sy 刷新软件包数据即可。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/msys2/",
"teaser": null
},{
"title": "NPM镜像使用帮助",
"excerpt":"中科大镜像站的 npm 镜像是 https://registry.npmjs.org/ 的反代。   使用说明   编辑 ~/.npmrc ，添加   registry=http://npmreg.mirrors.ustc.edu.cn/   若不想将本源设置为默认源，只想使用本源安装某个软件包，可在安装包时采用以下用法：   npm --registry http://npmreg.mirrors.ustc.edu.cn install &lt;packagename&gt;   中科大 npm 镜像支持 https 安全连接，如果您的网络运营商部署了缓存设备，或您对所处的网络环境不信任，请使用 https 替换上述 URL 中的 http 。   注意事项   不支持 publish，若出现错误，请将 ~/.npmrc 中的用户名密码部分注释掉，并删除缓存 ( rm -rf ~/.npm ) 重试。   相关链接   官方主页: https://www.npmjs.org/   *[URL]: Uniform Resource Locator  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/npm/",
"teaser": null
},{
"title": "openSUSE 镜像使用帮助",
"excerpt":"收录架构 i586 x86_64 收录版本 11.4 （不含 Update） 12.1 （不含 Update） 12.2 12.3 13.1 13.2 Leap 42.1 Leap 42.2 Tumbleweed (Factory) 使用说明 手动配置软件源 （以下配置方法适用于从未自行配置软件源的用户。其他用户请根据具体情况自行配置 ，以下仅供参考。） 终端下配置方法 禁用原有软件源 sudo zypper mr -da 添加科大镜像源（以 openSUSE Leap 42.2 为例） sudo zypper ar -fc https://mirrors.ustc.edu.cn/opensuse/distribution/leap/42.2/repo/oss USTC:42.2:OSS sudo zypper ar -fc https://mirrors.ustc.edu.cn/opensuse/distribution/leap/42.2/repo/non-oss USTC:42.2:NON-OSS sudo zypper ar...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/opensuse/",
"teaser": null
},{
"title": "openwrt 镜像存档使用说明",
"excerpt":"说明   由于 OpenWrt 上游不提供 rsync 服务, 而且用 lftp 与上游进行同步的时候总是会出现文件下载不完整的情况, 所以 USTC Mirrors 目前改为对 http://downloads.openwrt.org 做反向代理.   同步的地址由原来的 http://mirrors.ustc.edu.cn/openwrt 改为 http://openwrt.mirrors.ustc.edu.cn   原来的地址目前仍会保留, 以后将择日删除.  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/openwrt/",
"teaser": null
},{
"title": "PyPI 镜像使用帮助",
"excerpt":"如何使用科大 mirrors 加速 pip？ 编辑 ~/.pip/pip.conf 文件（如果没有则创建之），将 index-url 开头的一行修改为下面一行： index-url = https://mirrors.ustc.edu.cn/pypi/web/simple 如果运行 pip 时, 提示如下错误 configparser.MissingSectionHeaderError: File contains no section headers. 请在 ~/.pip/pip.conf 最上方加上 [global] 这一 section header 如： pip.conf [global] index-url = https://mirrors.ustc.edu.cn/pypi/web/simple format = columns 同步方式 使用 bandersnatch，每4小时从 pypi.python.org 官方同步。 相关链接 PyPI Official Mirrors: https://pypi.python.org/mirrors PEP-381 Mirroring...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/pypi/",
"teaser": null
},{
"title": "Qt 镜像使用帮助",
"excerpt":"在线安装   从 http://mirrors.ustc.edu.cn/qtproject/official_releases/online_installers/ 下载在线安装器。   运行在线安装器后在设置里设置 http 代理为 mirrors.ustc.edu.cn:1080，并 禁用默认源，添加新源 http://mirrors.ustc.edu.cn/qtproject/online/qtsdkrepository/linux_x64/root/qt/（其他版本注意更改地址）  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/qtproject/",
"teaser": null
},{
"title": "Raspbian镜像使用帮助",
"excerpt":"此处内容可能已过时，最新版本的帮助参见：https://mirrors.ustc.edu.cn/help/raspbian.html Raspbian简介 Raspbian是专门用于ARM卡片式计算机Raspberry Pi®“树莓派”的操作系统。 Raspberry Pi®“树莓派”是2012年问世的ARM计算机，旨在为儿童和所有的计算机爱好者提供一套廉价的编程学习与硬件DIY平台。树莓派基于ARM，具有1080P高清视频解析能力，附带用于硬件开发的GPIO接口，使用Linux操作系统。售价仅$25~$35。 Raspbian系统是Debian的定制版本。得益于Debian从7.0/wheezy开始引入的“带硬件浮点加速的ARM架构”(armhf)，Debian 7.0在树莓派上的运行性能有了很大提升。Raspbian默认使用LXDE桌面，内置C和Python编译器。 Raspbian是树莓派的开发与维护机构The Raspbeery Pi Foundation“树莓派基金会”，推荐用于树莓派的首选系统。 由于以下原因，Raspbian单独组建了自己的软件源： Debian下所有的软件包都需要用armhf重新编译。 树莓派有部分特有的软件包，例如Python的GPIO操作库。 树莓派用户倾向于探索、尝试最新的软件。这与Debian软件源的策略完全不同。 使用说明 编辑 /etc/apt/sources.list 文件。删除原文件所有内容，用以下内容取代： deb http://mirrors.ustc.edu.cn/raspbian/raspbian/ jessie main non-free contrib deb-src http://mirrors.ustc.edu.cn/raspbian/raspbian/ jessie main non-free contrib 编辑此文件后，请使用 sudo apt-get update 命令，更新软件列表。 系统架构 armhf(*) 系统版本 wheezy jessie stretch (即，oldstable, stable, testing) 更新频率 每日更新1次。 声明 Raspbian是由独立开发者维护的，与树莓派基金会并无直接联系。...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/raspbian/",
"teaser": null
},{
"title": "Revproxy",
"excerpt":"各资源的对应关系如下     registry-1.docker.io          docker.mirrors.ustc.edu.cn   packages.elastic.co           elastic.proxy.ustclug.org   ppa.launchpad.net             launchpad.proxy.ustclug.org   archive.cloudera.com/cdh5/    cloudera.proxy.ustclug.org/cdh5/   downloads.lede-project.org    lede.proxy.ustclug.org   downloads.openwrt.org         openwrt.proxy.ustclug.org   registry.npmjs.org            npmreg.proxy.ustclug.org   www.npmjs.com                 npm.proxy.ustclug.org   fonts.gstatic.com             fonts-gstatic.proxy.ustclug.org   fonts.googleapis.com          fonts.proxy.ustclug.org   ajax.googleapis.com           ajax.proxy.ustclug.org   themes.googleusercontent.com  google-themes.proxy.ustclug.org   secure.gravatar.com           gravatar.proxy.ustclug.org  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/revproxy/",
"teaser": null
},{
"title": "添加ROS源",
"excerpt":"sudo sh -c ‘. /etc/lsb-release &amp;&amp; echo “deb http://mirrors.ustc.edu.cn/ros/ubuntu/ $DISTRIB_CODENAME main” &gt; /etc/apt/sources.list.d/ros-latest.list’  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/ros/",
"teaser": null
},{
"title": "RPMFusion 使用说明",
"excerpt":"rpmfusion是为Fedora/RHEL提供额外rpm软件包的第三方软件源。 配置方式 使用下列命令，可以同时启用其 free 和 nonfree 软件源： Fedora 22+ su -c 'dnf install http://mirrors.ustc.edu.cn/rpmfusion/free/fedora/rpmfusion-free-release-$(rpm -E %fedora).noarch.rpm http://mirrors.ustc.edu.cn/rpmfusion/nonfree/fedora/rpmfusion-nonfree-release-$(rpm -E %fedora).noarch.rpm' Fedora 14 至 Fedora 21 su -c 'yum install --nogpgcheck http://mirrors.ustc.edu.cn/rpmfusion/free/fedora/rpmfusion-free-release-$(rpm -E %fedora).noarch.rpm http://mirrors.ustc.edu.cn/rpmfusion/nonfree/fedora/rpmfusion-nonfree-release-$(rpm -E %fedora).noarch.rpm' RHEL 5 或兼容系统 su -c 'rpm -Uvh http://mirrors.ustc.edu.cn/rpmfusion/free/el/updates/5/i386/rpmfusion-free-release-5-1.noarch.rpm http://mirrors.ustc.edu.cn/rpmfusion/nonfree/el/updates/5/i386/rpmfusion-nonfree-release-5-1.noarch.rpm' RHEL 6 或兼容系统 su -c 'yum...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/rpmfusion/",
"teaser": null
},{
"title": "替换gems默认源",
"excerpt":"gem sources  #列出默认源     gem sources –remove https://rubygems.org/  #移除默认源     gem sources -a https://mirrors.ustc.edu.cn/rubygems/  #添加科大源      替换Rails默认源   cd path/to/your/project #Linux only: sed -i \"/^source/c source 'http://mirrors.ustc.edu.cn/rubygems/'\" Gemfile  #OS X only: sed -ig \"s/^source.*/source 'http:\\\\/\\\\/mirrors.ustc.edu.cn\\\\/rubygems\\\\/'/g\" Gemfile  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/rubygems/",
"teaser": null
},{
"title": "Rust Crates 镜像使用帮助",
"excerpt":"使用说明   在 $HOME/.cargo/config 中添加如下内容   [registry] index = \"git://mirrors.ustc.edu.cn/crates.io-index\"   如果所处的环境中不允许使用 git 协议, 可以把上述地址改为   index = \"http://mirrors.ustc.edu.cn/crates.io-index\"   同步频率为每两个小时更新一次.   如果 cargo 版本为 0.13.0 或以上, 需要更改 $HOME/.cargo/config 为以下内容:   [source.crates-io] registry = \"https://github.com/rust-lang/crates.io-index\" replace-with = 'ustc' [source.ustc] registry = \"git://mirrors.ustc.edu.cn/crates.io-index\"   相关链接   官方主页: https://crates.io/  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/rust-crates/",
"teaser": null
},{
"title": "使用说明",
"excerpt":"请配合rustup来使用.   rustup 安装方法可参考 官方的 README.   设置环境变量 RUSTUP_DIST_SERVER (用于更新 toolchain)   export RUSTUP_DIST_SERVER=https://mirrors.ustc.edu.cn/rust-static   以及 RUSTUP_UPDATE_ROOT (用于更新 rustup)   export RUSTUP_UPDATE_ROOT=https://mirrors.ustc.edu.cn/rust-static/rustup  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/rust-static/",
"teaser": null
},{
"title": "Scientific Linux 镜像使用帮助",
"excerpt":"收录版本 6 使用说明 下载sl-ustc.repo放入/etc/yum.repo.d/中 sl-ustc.repo [sl] name=Scientific Linux $releasever - $basearch - ustc.edu.cn baseurl=http://mirrors.ustc.edu.cn/scientificlinux/$releasever/$basearch/os/ #mirrorlist=http://ftp.scientificlinux.org/linux/scientific/mirrorlist/sl-base-6.txt enabled=1 gpgcheck=1 gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-sl file:///etc/pki/rpm-gpg/RPM-GPG-KEY-sl6 file:///etc/pki/rpm-gpg/RPM-GPG-KEY-cern   [sl-security] name=Scientific Linux $releasever - $basearch - security updates - ustc.edu.cn baseurl=http://mirrors.ustc.edu.cn/scientificlinux/$releasever/$basearch/updates/security/ #mirrorlist=http://ftp.scientificlinux.org/linux/scientific/mirrorlist/sl-security-6.txt enabled=1 gpgcheck=1 gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-sl file:///etc/pki/rpm-gpg/RPM-GPG-KEY-sl6 file:///etc/pki/rpm-gpg/RPM-GPG-KEY-cern     [sl-source] name=Scientific Linux $releasever - Source - ustc.edu.cn baseurl=http://mirrors.ustc.edu.cn/scientificlinux/$releasever/SRPMS/...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/scientificlinux/",
"teaser": null
},{
"title": "Trisquel镜像使用帮助",
"excerpt":"收录架构 ALL 收录版本 Toutatis(6.0) Brigantia(5.5) Dagda(5.0) Slaine(4.5) Taranis(4.0) Awen(3.5) Dwyn(3.0) Robur(2.0) 使用说明 Trisquel使用APT软件包管理系统，故其软件源使用方法与Ubuntu或Debian等很相似。 以 Toutatis 为例, 编辑 /etc/apt/sources.list 文件 (需要使用 sudo), 在文件最前面添加以下条目(操作前请做好相应备份) deb http://mirrors.ustc.edu.cn/trisquel/ toutatis main deb-src http://mirrors.ustc.edu.cn/trisquel/ toutatis main deb http://mirrors.ustc.edu.cn/trisquel/ toutatis-security main deb-src http://mirrors.ustc.edu.cn/trisquel/ toutatis-security main deb http://mirrors.ustc.edu.cn/trisquel/ toutatis-updates main deb-src http://mirrors.ustc.edu.cn/trisquel/ toutatis-updates main deb http://mirrors.ustc.edu.cn/trisquel/ toutatis-backports main...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/trisquel/",
"teaser": null
},{
"title": "Ubuntu镜像使用帮助",
"excerpt":"收录架构 ALL 收录版本 所有 Ubuntu 当前支持的版本，包括开发版，具体版本见 https://wiki.ubuntu.com/Releases 对于 Ubuntu 不再支持的版本，请参考 Ubuntu Old Release，https://mirrors.ustc.edu.cn/ubuntu-old-releases/ 使用说明 软件包管理中心（推荐） 在软件包管理中心“软件源”中选择“中国的服务器”下mirrors.ustc.edu.cn即可自动使用。 手动更改配置文件 操作前请做好相应备份 一般情况下，更改 /etc/apt/sources.list 文件中 Ubuntu 默认的源地址 http://archive.ubuntu.com/ 为 http://mirrors.ustc.edu.cn 即可。 可以使用如下命令： sudo sed -i 's/archive.ubuntu.com/mirrors.ustc.edu.cn/g' /etc/apt/sources.list 当然直接编辑 /etc/apt/sources.list 文件（需要使用 sudo）也可以，以 Ubuntu 16.04 为例，在文件最前面添加以下条目： sources.list # 默认注释了源码镜像以提高 apt update 速度，如有需要可自行取消注释 deb https://mirrors.ustc.edu.cn/ubuntu/ xenial main...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/ubuntu/",
"teaser": null
},{
"title": "UKSM Kernel镜像使用帮助",
"excerpt":"UKSM是 http://kerneldedup.org/ 项目为内核的KSM的算法进行的一个优化，目前 mirrors.ustc 已提供 ubuntu 12.04 和 fedora 16 的源，具体的使用方法如下：   Fedora 16   x86 _64源：http://mirrors.ustc.edu.cn/uksm-kernel/uksm-fedora-x86_64.repo   i686源：http://mirrors.ustc.edu.cn/uksm-kernel/uksm-fedora-i686.repo   下载后放入/etc/yum.repos.d/ 然后使用yum命令或软件包管理器安装新的内核。 ====Ubuntu 12.04==== http://mirrors.ustc.edu.cn/uksm-kernel/ubuntu/uskm-ubuntu-12.04.list   下载后放入 /etc/apt/sources.list.d 然后使用apt-get命令或软件包管理器安装新的内核。 ====相关链接==== * 官方主页： http://kerneldedup.org/   _  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/uksm-kernel/",
"teaser": null
},{
"title": "ustclug 自建软件源使用帮助",
"excerpt":"收录架构   i386, amd64, armhf   收录版本   针对Debian Jessie挑选的部分软件，版本按需确定。   使用说明      编辑sources.list文件：   snippet.bash   echo deb https://mirrors.ustc.edu.cn/ustclug ustclug main | sudo tee /etc/apt/sources.list.d/ustclug.list      使用apt-key add添加缺失的公钥：   snippet.bash   wget -q https://mirrors.ustc.edu.cn/ustclug/ustclug.asc -O - | sudo apt-key add -      在apt update后即可正常使用。   注意 ：LUG@USTC对其中的软件包的来源不做任何保证，请谨慎使用。   相关链接   无  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/ustclug/",
"teaser": null
},{
"title": "Kodi镜像使用帮助",
"excerpt":"镜像目录结构 addons 官方插件库 apt iOS 版 Kodi 安装源 build-deps 编译 Kodi 依赖的其他开源项目代码 nightlies 与 Kodi 开发主分支同步编译的每日开发版安装包下载目录 releases Kodi 稳定版安装包下载目录（含 Beta 版和 RC 版） snapshots Kodi 每月发布的 Alpha 版安装包下载目录 tools Kodi 相关的工具软件（Kora 遥控软件） Kodi简介 Kodi（前身是 XBMC）媒体中心，是一个屡获殊荣的自由和开源的跨平台媒体播放器和用于 HTPC（Home theater PC，家庭影院 PC）的数字媒体娱乐中心软件。它使用遥控器作为主输入设备，针对3米左右观看距离而设计的用户界面，成为适应客厅使用的媒体播放器。它的图形用户界面让用户轻按遥控，就能方便地从硬盘、光盘、局域网和互联网浏览和观看视频、图片，收听广播和音乐。Kodi 项目由非营利的 XBMC 基金会管理，并由分布在世界各地的志愿者参与开发。自从它于2003年诞生以来，超过500名软件开发人员对 Kodi 作出贡献，并有60名核心开发人员。另外，还有200多名翻译人员在帮助它扩大影响范围，使它支持多达72种语言。 Kodi（当时叫“Xbox Media Center”）最初是作为第一代 Xbox 游戏机（现在已不支持）的一个媒体中心应用而开发的，而现在已经正式以原生应用运行于 Android、Linux、Mac...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/mirrors/help/xbmc/",
"teaser": null
},{
"title": "Vim笔记",
"excerpt":"Vim基本操作 “一个光标的故事”（方向键不是最好的选择） ⇒ The Vim Way 先阅读vimtutor，根据提示进行操作练习 ⇒ 先尝试“生存下来” 常用模式：normal, lastline, visual, insert, … ⇒ 熟练在它们中切换 字词句段篇 ⇒ word/string/paragraph/blockwise ⇒ 尝试在它们之间移动、选定、编辑 搜索式移动 ⇒ F/f，T/t，/，？，…… 查看当前词语的man手册页 ⇒ Shift-k 查看当前词语的定义处（局部变量） ⇒ gd 跳转到文件 ⇒ gf 块（blockwise）操作 ⇒ v/c/d/y + a/i + {/[/(/“/‘ 窗口间的移动 ⇒ \\+ h/i/j/k/ 学会使用帮助 Vim中键入： :help xxx 即可获得关于xxx的帮助。xxx可以是选项、命令、甚至快捷键组合。 Folding...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/redsky/vim_note/",
"teaser": null
},{
"title": "实用脚本集锦",
"excerpt":"这里收集来自网络的各种优秀的脚本。                  USTC 网络通脚本       2016/09/13 19:12                               豆瓣电台       2010/11/25 19:41       Stephen Zhang                 下载在线视频       2010/11/18 12:06       Stephen Zhang                 ssh代理       2010/11/27 21:30       tinyfox                 You-Get       2013/04/29 16:04       Darcy Shen          ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/scripts/",
"teaser": null
},{
"title": "豆瓣电台",
"excerpt":"摘自瀚海星云bbs：http://bbs.ustc.edu.cn/cgi/bbstcon?board=Linux&amp;file=M.1286547291.A 针对网速慢的用户以及豆瓣电台的改动做了些修改～: D dbfm.pl #!/usr/bin/perl -w use LWP; use HTTP::Cookies; use JSON; use Encode; use Term::ANSIColor; #use Smart::Comments;   my $time = 0; $SIG{INT} = \"quit\";   my $b = LWP::UserAgent-&gt;new; $b-&gt;cookie_jar(HTTP::Cookies-&gt;new);   my $form = { form_email=&gt;'your_id', ###----- 你的帐号-----### form_password=&gt;'your_passwd', ###----- 你的密码 ----### redir=&gt;\"/service/account/?return_to=http%3A%2F%2Fdouban.fm&amp;amp;mode=checkid_setup\", };   #-------login the douban....","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/scripts/douban/",
"teaser": null
},{
"title": "下载在线视频",
"excerpt":"这个脚本借助于http://www.flvcd.com/，分析各主流视频网站的视频地址，根据给定的视频网页地址，下载其中的视频。 get-video.sh #!/bin/bash   flv_web_addr=$1 flv_dir=$HOME/videos #存放视频地址的位置 flvcd_page_file=/tmp/flv_page_file   wget -q -O $flvcd_page_file \"http://www.flvcd.com/parse.php?format=high&amp;kw=$flv_web_addr\" flvurls=( $(cat $flvcd_page_file | grep \"&lt;U&gt;\" | sed s/\\&lt;U\\&gt;//g) ) #取出所有片段的视频地址 flvtitles=( $(cat $flvcd_page_file | grep \"&lt;N&gt;\" | iconv -f gb2312 -t utf8 | sed -n \"s/\\s\\{1,\\}/_/g;s/&lt;N&gt;//gp\") ) #取出所有片段的标题，将空格替换为下划线 nr_urls=${#flvurls[@]}   if [ $nr_urls -eq 0...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/scripts/download_flv/",
"teaser": null
},{
"title": "ssh代理",
"excerpt":"这个脚本通过自动登录免费的ssh账户，实现自动的ssh代理， 绑定的端口为7070 ssh_proxy.sh #!/bin/bash   cd `dirname $0` #进入ssh_proxy.sh所在的目录 SSH_ACCOUNT_SITE=\"http://dailimm.com/freessh.php\" #提供免费ssh账户的网站   'wget' -q $SSH_ACCOUNT_SITE -O /tmp/ssh_site HOST=$(cat /tmp/ssh_site | grep \"服务器地址\" | sed \"s/^.*value=\\\"\\(.*\\)\\\" onClick.*$/\\1/\") #获取服务器地址 USER= `cat /tmp/ssh_site | grep \"服务器用户\" | sed \"s/^.*value=\\\"\\(.*\\)\\\" onClick.*$/\\1/\"` #获取用户名 PASSWORD= `cat /tmp/ssh_site | grep \"服务器密码\" | sed \"s/^.*value=\\\"\\(.*\\)\\\" onClick.*$/\\1/\"` #获取密码  ...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/scripts/ssh_proxy/",
"teaser": null
},{
"title": "USTC 网络通脚本",
"excerpt":"Bash版 来源：http://bbs.ustc.edu.cn/cgi/go?cgi=bbscon&amp;bid=77&amp;fn=M4CAEC63D wlt.sh #!/bin/bash   curl -c /tmp/wlt \"http://wlt.ustc.edu.cn/cgi-bin/ip?cmd=login&amp;name=yourname&amp;password=yourpass\" &gt; /dev/null curl -b /tmp/wlt \"http://wlt.ustc.edu.cn/cgi-bin/ip?cmd=set&amp;type=6&amp;exp=0\" &gt; /dev/null rm /tmp/wlt 脚本说明： 其中yourname和yourpass分别是用户名密码， type = 0 -- 教育网出口 1 -- 电信出口 2 -- 联通出口 3 -- 电信出口2 4 -- 联通出口2 5 -- 电信出口3 6 -- 联通出口3 7 -- 教育网出口2 8 -- 移动测试国际出口...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/scripts/wlt/",
"teaser": null
},{
"title": "You-Get",
"excerpt":"一个Python3写的YouTube/Youku 视频下载器（实际上不止这两个）。  具体参见项目主页：http://www.soimort.org/you-get/   功能           支持YouTube、Vimeo等国外视频网站            支持断点续传            可设置HTTP代理       许可证   You-Get在MIT License下发布。  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/scripts/you_get/",
"teaser": null
},{
"title": "中国科学技术大学开源软件镜像",
"excerpt":"mirrors.ustc.edu.cn 由中国科学技术大学、中国科学技术大学网络信息中心支持，USTC LUG 维护。 机器域名 IPv4/v6: mirrors.ustc.edu.cn （能解析出教育网/电信/移动/v6地址） v4-only: ipv4.mirrors.ustc.edu.cn （能解析出教育网/电信/移动地址） v6-only: ipv6.mirrors.ustc.edu.cn 在有些地方 DNS 会解析出电信地址，但使用教育网地址访问更快，这时可以通过修改 hosts 指定强制使用教育网地址访问。 教育网IP：202.38.95.110 电 信IP：202.141.160.110 移 动IP：202.141.176.110 IPv6：2001:da8:d800:95::110 支持的访问方式 http、https、ftp rsync - 部分 为什么？ 提供的服务 请访问 mirrors 主页以获取完整列表。 使用帮助 请使用开源镜像使用帮助列表，或点击主页源列表旁边的“Help”链接。 欢迎您协助我们更新使用帮助，请访问 LUG 的 GitHub 项目。我们对您的帮助表示感谢。 状态监控 在首页点击页面上方的同步状态链接，可以查看当前各镜像的同步状态，包括 成功与否/上游源/镜像体积等。 大家如果知道更好（更新、更快）的上游源，请联系我们。 如果同步出现故障，服务器的管理员会收到邮件通知，以尽快处理，所以大家看到状态 监控页面中有显示同步失败的条目时，无需联系我们。 如果同步状态上显示同步正常，但实际使用过程中发现镜像有问题，请联系我们。 服务器维护文档 Bad...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/server/mirrors/",
"teaser": null
},{
"title": "中国科学技术大学校园网 PXE 服务 FAQ",
"excerpt":"一般用户 什么是 PXE PXE(Pre-boot Execution Environment)是由Intel设计的协议，它可以使计算机通过网络启动。协议分为client和server两端，PXE client在网卡的ROM中，当计算机引导时，BIOS把PXE client调入内存执行，并显示出命令菜单，经用户选择后，PXE client将放置在远端的操作系统通过网络下载到本地运行。 — 摘自 IBM中国 In the mid-90’s, Compaq, Dell, HP, Intel, and Microsoft jointly released a system design guide for building Net PC systems. The guide describes a method of booting the operating system from a network server. This method eventually became...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/server/pxe/faq/",
"teaser": null
},{
"title": "中国科学技术大学网络启动服务",
"excerpt":"pxe.ustc.edu.cn 由中国科大图书馆、网络中心和学生 Linux 用户协会共同维护，旨在为科大校园网提供各种网络启动服务。现在支持引导 Debian、Ubuntu、Arch Linux、CentOS 等常见 Linux/UNIX 发行版安装镜像或 LiveCD，同时还提供 Clonezilla、GParted Live 等实用系统维护工具。 中国科学技术大学校园网 PXE 服务 FAQ 如果遇到使用问题，请邮件联系 lug AT ustc.edu.cn。 新版网络启动服务 基于 GRUB 的新版网络启动服务支持传统 PXE 模式和UEFI 模式的网络启动。代码位于 https://github.com/ustclug/simple-pxe 校内 DHCP 服务会自动推送网络启动配置，只要在 BIOS 设置中开启网络启动就可以了。 从本地 GRUB2 加载（UEFI） 如果您的机器是 UEFI 模式启动的、UEFI 固件带有网络支持，并已经安装有 GRUB2，则可以在 GRUB 命令行中直接加载网络启动菜单： insmod efinet http net_bootp configfile (http,202.38.93.94)/boot2/menu/root.menu...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/server/pxe/",
"teaser": null
},{
"title": "《程序员的自我修养》读书笔记",
"excerpt":"李博杰 (bojieli AT gmail DOT com) 最后修改：2012-06-01 近来在郭家华的推荐下，读了LUG书库的《程序员的自我修养——链接、装载与库》一书，有种相见恨晚的感觉。然而快到期末考试了，没有时间把全书读完，因此只写了一部分。 我读技术类图书有个习惯，或者说是毛病：经常是先想想如果是自己设计这个系统会采用怎样的一种机制，然后再去读书中所讲的实现方式。由于计算机应用系统的设计不是什么算法难题，一般都能设计出一套像模像样的机制；然而从结构的优雅性角度考虑，我设计的机制有时充斥着一些与UNIX文化不符的元素。本文撷取链接、装载与库中的几个设计点，与大家分享我个人的想法与UNIX/Linux大师的设计。 There are two ways of constructing a software design. One is to make it so simple that there are obviously no deficiencies; the other is to make it so complicated that there are no obvious deficiencies. The first method is far...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/user/boj/linkers-and-loaders/",
"teaser": null
},{
"title": "使用chroot编译android",
"excerpt":"请直接参考参考资料   安装dchroot和debootstrap   $ sudo aptitude install dchroot debootstrap   更改配置文件   $ sudo tee -a /etc/schroot/schroot.conf &lt;&lt;EOF [lucid] description=Ubuntu 10.04 LTS (Lucid Lynx) location=/var/chroot/lucid priority=3 users=pdecat groups=pdecat root-groups=root EOF   安装 Ubuntu10.04   $ sudo debootstrap --variant=buildd --arch amd64 lucid /var/chroot/lucid http://mirrors.ustc.edu.cn/ubuntu/   参考资料   http://blog.decat.org/aosp-step-by-step-instructions-for-setting-up-a-chrooted-ubuntu-10-04-64bit-build-environment-on-ubuntu-11-10-and-12-04-hosts/   图书馆查询机系统的制作与启动过程   ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/user/sadhen/android/",
"teaser": null
},{
"title": "Emacs读书笔记",
"excerpt":".emacs.d   这是我的配置文件：https://github.com/sadhen/.emacs.d  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/user/sadhen/emacs/",
"teaser": null
},{
"title": "《黑客与画家》读书笔记",
"excerpt":"Fenng 说这本书的三个主要的主题是黑客精神、创业和编程语言，我深以为然。当然，这本书还涉及到了其它很多有意思的话题。比如不能说的话、财富等等。 翻译经常是一件吃力不讨好的事。即使翻译的再好，如果原著本身很经典的话，大家都还是喜欢看原著。当然，像《歌德尔、爱舍尔、巴赫》之类的书得排除在外。本书的译者是 阮一峰，其译文和博客行文流畅自然，都值得一读。 关于财富 人们往往因为财富的分配而忽略了财富的创造。人们常常抱怨财富分配的不均匀。这很正常，没有一种分配方式能让所有人觉得公平公正。然而人们在抱怨分配不均时，往往会犯一个认知上的错误，即财富的总量是个const。然而，人类社会的财富实实在在是在不断甚至是以极快的速度在增长着。所以，获得财富的手段是争取财富分配上的增加或者直接创造财富。后者即创业。 黑客们喜欢创造。有些创造可能仅仅是黑客们自己把玩的玩具。有些则转化为我们人类社会的财富。 禁忌 人类社会的禁忌并不常常是合理的。有些源于历史上的无知，然而不幸的传承了下来。黑客们不喜欢禁忌，黑客们向往自由。然而有时候，黑客们也只能是沉默的大多数。关于这个话题，详见《黑客与画家》第三章。 编程语言 本书中提到了LISP这门古老而极具生命力的编程语言，也谈论了一些作者本人对编程语言的看法。本人对编程语言的了解十分有限。下面是我的看法。 哪种编程语言最好 经常在邮件列表里面看到一群人，为了自己喜爱的编程语言争论。那么哪种语言最好呢？其实往往这些问题的提出者不怀好意，或者不知道如何提问？这种人通常被称为 Troll。 那么哪种语言最好呢？ 首先能回答这个问题的人必须是了解至少两门编程语言的人。否则谈何比较？！ 其次，如果要讨论好不好的问题，首先需要度量好坏的标准，在这些标准下面，这个问题才真正具有意义。总不能说“我喜欢它，它就是好，这不需要理由！”。实际上，从编程语言的历史上看，一门语言的出现往往是因为某种需求，或者是解决现有的一些编程语言存在的问题。而且在设计编程语言的过程中，很难避免trade offs——为了某些特性，就必须得牺牲另外一些特性。 问：争论，到底怎样才好？ 讨论过程中难免争论，局内人争个热火朝天，局外人看个不明所以。网上的争论尤为如此，经常是断章取义，且双方似乎互相理解不了对方的文字。 我的观点是在讨论过程中，尽量考虑阅读者的感受，另外要含有一定的信息量，而不是噪音。 问：LISP家族的后代会是“好”的语言吗？ 问：编程语言的本质是什么？ 计算的本质是什么？ 问：理想的编程语言是怎样的？ Guile: 作为一种扩展语言 以上的一些问题是我思考过，有些得到了自己答案，有些还没有想明白。寒假趁闲， 接触 了一下scheme。接触即平时也只是用 Guile，简单的试一下自己写的scheme代码能不能运行，结果是不是符合预期。 目前在读《The Little Schemer》，此书且不论内容，形式上便令人耳目一新： 阿基里斯：《The Little Schemer》讲的是什么？ 乌龟：讲的是计算的本质。 阿基里斯： 计算机的本质是什么？ 乌龟： 是计算的本质，不是计算机的本质。 ……（这是我杜撰两个问答） Guile是GNU Ubiquitous Intelligent Language for Extensions的缩写，可以说是scheme的解释器之一。然而一开始写Guile并不是为了写一个解释器，从名字可以看出，Guile是为了方便扩展而诞生的。 我们从Emacs可以看出一种优秀软件的特点：高度可定制性。而高度可定制性依赖于表达力丰富的扩展语言。于Emacs,...","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/user/sadhen/hackers_and_painters/",
"teaser": null
},{
"title": "About Me",
"excerpt":"我的笔记   1.使用chroot编译android   2.Emacs读书笔记   3.《黑客与画家》读书笔记   我的Slides   1.Bash Scripting   2.python2-networkx可视化    LOG   2014/10/21：给本dokuwiki安装了markdownku插件，插件主页  ","categories": [],
"tags": [],
"url": "https://lug.ustc.edu.cn//wiki/user/sadhen/",
"teaser": null
}]